[
  {
    "name": "Androlafi",
    "artist": "Kurt von Stetten",
    "slug": "androlafi",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2013-02-09",
    "catalogNumber": "SMR013",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/androlafi.jpg",
    "featuredQuote": {
      "text": "Terrific, all over the place, and quite unlike anything else I've heard so far this year.",
      "source": "Something Daily"
    },
    "description": "The term \"bedroom project\" carries numerous pejorative connotations, namely lo-fi, half-baked experimentation. But in the world of Kurt von Stetten, the bedroom is merely ground zero for songs that transcend time and genre. Harnessing von Stetton's love of early 90s indie rock (think Pavement, Sebadoh and early Modest Mouse) interweaved with his own insecurities, fears and passions, von Stetton's seventh solo outing Androlafi is his most accomplished and self-assured, a record that proudly stands alongside DIY revisionists Kurt Vile and Ty Segall, and also the seminal 90s output of his heroes.\n\nThe themes of Androlafi (aka Witches) are conjured from von Stetten's obsession with gothic folklore and the eternally frightening cautionary tales told to children. \"I think that most of these songs reference fear and how people deal with fear,\" explains von Stetten. \"Many of the songs are based on the stories my mother and father told me about their childhood and the stories that were told to them. These stories were fun and fantastic, but meant to mask great anxieties. Fear is a powerful motivator and the impetus for a lot of beauty.",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "Pretty much an indie delight.",
        "source": "Golden Mixtape",
        "url": null
      },
      {
        "text": "Listening to von Stetten’s music is like ingesting a drug for the first time. As your psyche ascends towards the initial drop you release yourself for what’s to come.",
        "source": "Visions of the Unexcused",
        "url": null
      },
      {
        "text": "Taking us back to the very birth of modern guitar music... the complete antithesis of so called \"manufactured pop\".",
        "source": "Sound of Confusion",
        "url": null
      },
      {
        "text": "Terrific, all over the place, and quite unlike anything else I’ve heard so far this year.",
        "source": "Something Daily",
        "url": null
      },
      {
        "text": "Celebrate the avant-garde and wildly eccentric... a superbly talented multi-instrumentalist that comes highly recommended.",
        "source": "Mojophenia",
        "url": null
      },
      {
        "text": "Von Stetten makes music that never sounds dated or too indebted to its influences.",
        "source": "Beats Per Minute",
        "url": null
      },
      {
        "text": "Von Stetten has made music that shouts to be heard... cohesive and original.",
        "source": "The Noise (scroll)",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "293",
        "title": "The love rolls on for Kurt von Stetten's Androlafi",
        "date": "2013-04-15",
        "excerpt": "More love for Kurt von Stetten's latest, Androlafi ! The Noise calls it \" Music that shouts to be heard .\" Why thank you. And the lovely folks at Golden Mixtape say it's \" An indie delight. \" All in a"
      },
      {
        "id": "287",
        "title": "Kurt von Stetten Androlafi UK review.",
        "date": "2013-03-25",
        "excerpt": "Love from across the pond sounds like this: \" Almost taking us back to the very birth of modern guitar music. This is the complete antithesis of so called \"manufactured pop\". Naturally it'll sell a fr"
      },
      {
        "id": "291",
        "title": "Kurt von Stetten's Anthropos Elafi video",
        "date": "2013-03-25",
        "excerpt": "Nice little write-up of Kurt von Stetten's Antrhopos Elafi video (from his latest, Androlafi ) via the fine folks at Beats Per Minute ."
      },
      {
        "id": "282",
        "title": "The kids love Androlafi!",
        "date": "2013-02-20",
        "excerpt": "For Kurt von Stetten's new album, Androlafi , the word is in. And the word is good. Something Daily called the album, \" Terrific, all over the place, and quite unlike anything else I’ve heard so far t"
      },
      {
        "id": "277",
        "title": "Busy times in Static Motor land!",
        "date": "2013-01-18",
        "excerpt": "No rest.. we've got The Longwalls CD release show for Kowloon coming up Saturday, January 26! We've also got the release of Kurt von Stetten's new one, Androlafi , coming up Tuesday, February 19th. In"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1031446612/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/androlafi\">Androlafi by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Animals",
    "artist": "Kurt von Stetten",
    "slug": "animals",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2014-09-30",
    "catalogNumber": "SMR014",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/animals.jpg",
    "featuredQuote": {
      "text": "Animals is one of the best albums of the year",
      "source": "Visions of the Unexcused"
    },
    "description": "The ninth solo album from Boston's DIY wunderkind Kurt von Stetten.\n\nA man has a condition that allows him to forget his entire world every five minutes; as a result he feels like he knows everything (and hates it all) like a child. A woman describes the possible end of the world to her brother in the woods where they grew up. A boy leaves home to become an artist because he was already pre-destined to be poor and miserable (he is sorry). A man loses both arms while charged with securing arms for his troops in the civil war- his scout laughed at him and left him for dead. I had a fever dream when I was a child- the theme song from \"three's company\" was playing in the background. A group of boys decides not travel home after the last world war- they decide that this tree is probably as good as any a place to call home. A young man tries to get people to like him by throwing a \"rager\" at his house- he was picking broken beer bottles out of his lawn for weeks to come. Faith will dry your veins- especially for young artists. Math involves unbreakable theorems. Starting a family makes you think about very basic things. A young girl meditates and has random thoughts- it is ok though, because she feels \"complete\" now. You can talk all you want, young man, but you are still making pretty pictures. Thinking that you have special powers and having them are two very different things- just ask your daughters. People in positions of power say some really stupid things about life, religion, science, and leadership.",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "One of the best albums of the year",
        "source": "Visions of the Unexcused",
        "url": null
      },
      {
        "text": "Perhaps all of these records are annual invitations into a complex mind of a musical intellect, a mind full of radical ideas of a broader picture too ambiguous for a casual listener to understand. But discernible and eloquent nonetheless.",
        "source": "Bishop & Rook",
        "url": null
      },
      {
        "text": "An album filled with expansive, full",
        "source": "bodied Indie rock songs.\n—Popa’s Tunes",
        "url": null
      },
      {
        "text": "Interesting concepts for subject matter and an amazing work ethic to pull this all off.",
        "source": "Examiner.com",
        "url": null
      }
    ],
    "bandcampUrl": "bandcamp.com/album/animals",
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "627",
        "title": "Kurt von Stetten is (still) winning the internet",
        "date": "2014-12-10",
        "excerpt": "Kurt von Stetten is killing it! On the heels of composing the new theme for the Lost at Home Podcast , a fantastic interview by the fab folks at Visions of the Unexcused —entitled \" The Last Renaissan"
      },
      {
        "id": "567",
        "title": "Kurt von Stetten wins the internet with original song for fan!",
        "date": "2014-10-22",
        "excerpt": "You read right. A couple weeks ago our own Kurt von Stetten held a contest on Twitter : he asked followers to post short videos of themselves listening to his latest release, Animals . For those that "
      },
      {
        "id": "560",
        "title": "Kind words from Bishop & Rook on Kurt von Stetten's latest, \"Animals\"",
        "date": "2014-10-20",
        "excerpt": "The fine folks at Bishop & Rook have written a really nice review of Kurt von Stetten's latest release, \" Animals .\" They write, \" Perhaps all of these records are annual invitations into a complex mi"
      },
      {
        "id": "536",
        "title": "Kurt von Stetten's \"Animals\" on sale now, new video for We Were So Very Wrong",
        "date": "2014-09-30",
        "excerpt": "Animals , the latest home-brewed effort from Boston DIY wunderkind Kurt von Stetten is on sale now! Downloads only this time around kids (Obamacare is hitting KvS industries pretty hard). Grab it here"
      },
      {
        "id": "534",
        "title": "Early love for Kurt von Stetten's \"Animals.\"",
        "date": "2014-09-23",
        "excerpt": "The fine folks over at Examiner.com and Popa's Tunes have some nice things to say about Animals , the new album by Kurt von Stetten . The album comes out Tuesday 9/30 and is Kurt's 9th full length in "
      },
      {
        "id": "508",
        "title": "Kurt von Stetten \"Animals\" out 9/30!",
        "date": "2014-08-19",
        "excerpt": "It's that time a year again folks! Our own Kurt von Stetten has a new release ready for the fall! It's called Animals and it finds Kurt coloring way outside the lines and conjuring up animals of many "
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=782194552/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/animals\">Animals by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Birds and Clouds",
    "artist": "Kurt von Stetten",
    "slug": "birds-and-clouds",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2006-03-14",
    "catalogNumber": "SMR008",
    "formats": [
      "Vinyl",
      "Digital"
    ],
    "coverImage": "assets/images/albums/birds-and-clouds.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan’s Smashing Life"
    },
    "description": "Kurt's home-made masterpiece Birds and Clouds, on blue vinyl. Pretty cool. A few of these songs are regulars in the Drama Queens live sets (I bet you can guess one of them), so if you like 'em, this is where you can get 'em. Available for free download!",
    "tracks": [],
    "credits": null,
    "press": [],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=617842240/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/birds-and-clouds\">Birds and Clouds by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Bon Fortuna",
    "artist": "Kurt von Stetten",
    "slug": "bon-fortuna",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2015-10-06",
    "catalogNumber": "SMR015",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/bon-fortuna.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan’s Smashing Life"
    },
    "description": "Dreamy, bold and always slightly irreverent, Boston's Kurt von Stetten returns with his 10th solo effort—a glorious dispatch of fearlessly fuzzed-out low-fi pop. Once again written and recorded entirely on his own—with Kurt playing every instruments—Bon Fortuna is truly s DIY gem.\n\nSongs built from overheard conversations and art-school flashbacks span ideas of fear and love and desperation. In Kurt’s own words…\n\nWhile sailing over they had some grand ideas, but the forest was unforgiving (and so was god... any god). A man can make a world inside- very much as wild, dangerous, and free as outside. Once you give in to an idea and take a leap- you might make history (but the people around you may knock your teeth out in the process). Over a sea of men, fists, and knives you realize your life is precious. Guest lecturers often open with guiding principals and immediate sweeping observations; this is often meant to force a master and apprentice relationship when there really is none (especially when my shit is more John Blaze than that). Guy feelings are so deep and not communicated. A persistent general menaces a town for a rumored treasure (a treasure hidden in plain sight); an enemy bomb breaks a dam and the flood actually results in one of the best harvests in years. I know not to leave my car or mouth running. A man goes to help his former love before he dies (he doesn't need directions- he was taught well), but the journey was not fulfilling. A young man on the E train, having just read Oedipus, exclaims \"Oedipus was a pussy\". There are lots of rumored (and fake) beasts in dark lake, but the townsfolk usually just end up harpooning each other in the dark. It was a pretty easy mistake if you think about it- I'm sure it will work out- if I don't see you, good luck!",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "“Spanish Ship’ is still a powerful statement. It’s bold, hard",
        "source": "hitting, well-crafted… Plus, it’s not even the best track on the LP, which shows you just how good this guy is.”\n— The Sound of Confusion",
        "url": null
      },
      {
        "text": "“Another fantastic von Stetten album… it very well be his most solid work to date, and that’s saying quite a bit.”",
        "source": "Visions of the Unexcused",
        "url": null
      },
      {
        "text": "“A dreamy, multi",
        "source": "layered and methodical record.”\n— Bishop and Rock",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "752",
        "title": "Kurt von Stetten's \"Bon Fortuna\" on sale now!",
        "date": "2015-10-06",
        "excerpt": "We're pleased as punch to announce Bon Fortuna —the new record by Kurt von Stetten —is on sale now! Dreamy, bold and always irreverent, Kurt returns with a glorious dispatch of fearlessly fuzzed-out a"
      },
      {
        "id": "749",
        "title": "More kind words on \"Bon Fortuna,\" the new album by Kurt von Stetten out 10/6",
        "date": "2015-09-29",
        "excerpt": "\"Another fantastic von Stetten album... it very well be his most solid work to date, and that’s saying quite a bit.\" That's what our pals at Visions of the Unexcused have to say about the new Kurt von"
      },
      {
        "id": "744",
        "title": "The Sound of Confusion reviews Kurt von Stetten's \"Bon Fortuna\"—and it's a good one!",
        "date": "2015-09-15",
        "excerpt": "\"'Spanish Ship' is still a powerful statement. It's bold, hard-hitting, well-crafted, and at well under three-minutes it doesn't outstay its welcome. Plus, it's not even the best track on the LP, whic"
      },
      {
        "id": "723",
        "title": "\"Bon Fortuna\" by Kurt von Stetten on sale October 6",
        "date": "2015-09-08",
        "excerpt": "Get ready folks! Bon Fortuna —The 10th solo album from Kurt von Stetten is on its way! Look for a digital release on 10/6, and if you follow KvS on Twitter keep an eye out for give-aways of physical c"
      },
      {
        "id": "705",
        "title": "On tap for the fall: new KvS, Longwalls and... Gatsby?",
        "date": "2015-09-04",
        "excerpt": "Wow, what a summer. And now, back to school. Our own Kurt von Stetten has completed his 10th solo album in 10 years! Damn. It's called Bon Fortuna and is slated for an October release date. Meanwhile,"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2046206354/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/bon-fortuna\">Bon Fortuna by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Broken but not undone",
    "artist": "Kurt von Stetten",
    "slug": "broken-but-not-undone",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2012-10-01",
    "catalogNumber": "SMR012",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/broken-but-not-undone.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan’s Smashing Life"
    },
    "description": "DIY doesn't carry the same allure and integrity it once did. With the technology at hand, any kid can make a crisp, professional recording. What we've lost is a warts and all ethos, and an intangible passion that comes only from real instrumentation, coated with blood and sweat, and maybe a few tears. Enter the world of DIY practitioner Kurt von Stetten.\n\nThe sounds, textures, and nuances on Broken, But Not Undone are 100% von Stetten. While he's always done his own instrumentation, von Stetten had the last three records professionally mixed and mastered. On Broken, there's nowhere to hide, and the results may not be technically flawless, but it's the way von Stetten wants you to hear it. \"I really tried to just play with sound on a lot of these songs,\" recalls von Stetten. \"I know that I mix incorrectly and that I do not know what I am doing sonically but this is the way I hear them.\" The result is a gloriously chaotic, beautiful trip into the psyche of one of today's great unsung artists.",
    "tracks": [
      {
        "number": 1,
        "title": "Those that Know"
      },
      {
        "number": 2,
        "title": "Tooahyaysay"
      },
      {
        "number": 3,
        "title": "Cashier Girls"
      },
      {
        "number": 4,
        "title": "Bucky Fuller"
      },
      {
        "number": 5,
        "title": "Slime"
      },
      {
        "number": 6,
        "title": "Age of No"
      },
      {
        "number": 7,
        "title": "Nature is a ride or die bitch"
      },
      {
        "number": 8,
        "title": "Competition (Fuck Bob Pollard)"
      },
      {
        "number": 9,
        "title": "Song for a Phobic, part 3"
      },
      {
        "number": 10,
        "title": "Sally Dear"
      },
      {
        "number": 11,
        "title": "Nickname: Cowboy Shit"
      },
      {
        "number": 12,
        "title": "Her First Crew"
      }
    ],
    "credits": "Words and music: Kurt von Stetten (BMI)\nInstrumentation: Kurt von Stetten: guitar, vocals, cello, keys, drums/percussion, and bass\nEngineered & mixed: Kurt von Stetten\nMastered: (Vinyl) Mike Quinn (Moontower) at Q Division Studios / (CD) Kurt von Stetten\nDesign: Kurt von Stetten",
    "press": [
      {
        "text": "With many great releases this year from the likes of genre champion Ty Segall, it is hard to think of the mantle passing. Yet, Kurt von Steffen clearly assumes the throne with this altogether perfect record. With every element perfectly placed, but retaining enough edge for a Soho street, Broken, But Not Undone is the singular must have of the fall.",
        "source": "Floorshime Zipper Boots",
        "url": null
      },
      {
        "text": "Two years after releasing two breakout albums (both of which made our 2011 Best of List",
        "source": "one artist having two songs on the list was a first here on rslblog.com. Seriously kids, you need to own these records.) Kurt von Stetten (The Longwalls) today unleashes a new effort, Broken, but Not Undone, which promises more jangly distortion, altered reality and realized heartbreak… he is operating on a different plane.\n— Ryan’s Smashing Life",
        "url": null
      },
      {
        "text": "Kurt von Stetten is to Boston what Robert Pollard is to Dayton… Von Stetton’s music is consistently unique, challenging, and thoroughly rewarding.",
        "source": "Visions of the Unexcused",
        "url": null
      },
      {
        "text": "Intriguing, though",
        "source": "provoking low-fi excellence. Fans of GBV take notice.\n— The Dadada",
        "url": null
      },
      {
        "text": "Deceptively large scale, with soaring dream pop and loud lo fi garage rock… This is an artist worth checking out.",
        "source": "The Horn",
        "url": null
      },
      {
        "text": "This song is erratic, insecure, passionate and sweaty all at once. Gloriously chaotic.",
        "source": "Alan Cross",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "478",
        "title": "More kind words on KvS' Broken But Not Undone",
        "date": "2014-02-07",
        "excerpt": "The fine folks at The Dadada have remarked that on Broken But Not Undone , Kurt von Stetten \" continues to pump out intriguing, though-provoking low-fi excellence. Fans of GBV take notice .\" Just anot"
      },
      {
        "id": "476",
        "title": "Kurt von Stetten is to Boston what Robert Pollard is to Dayton",
        "date": "2014-02-03",
        "excerpt": "Those aren't our words. Nope. They come from the keyboard of Visions of the Unexcused . And clearly they know what they're talking about. They go on to say that Kurt von Stetten's latest— Broken But N"
      },
      {
        "id": "470",
        "title": "KvS' Broken But Not Undone lands in the RSL top 50 for 2013!",
        "date": "2014-01-06",
        "excerpt": "Ryan's Smashing Life has long been one of, if not the , best music blogs in Boston. So we're pleased as punch that Kurt von Stetten's Broken But Not Undon e has made the blog's best of list for 2013! "
      },
      {
        "id": "452",
        "title": "The Horn reviews KvS' Broken But Not Undone",
        "date": "2013-12-10",
        "excerpt": "Listen to The Horn ! They know of what they speak, and what they speak is this: Broken but Not Undone (the latest from Kurt von Stetten ) is \"deceptively large scale, with soaring dream pop and loud l"
      },
      {
        "id": "456",
        "title": "WMBR Music Director names KvS' Broken But Not Undone as one of the best of 2013.",
        "date": "2013-12-10",
        "excerpt": "The very smart, talented, forward-thinking Chris from WMBR has named Kurt von Stetten's latest— Broken But Not Undone —as one of the best of 2013 . He's a Music Director, and it's MIT, so he knows wha"
      },
      {
        "id": "447",
        "title": "Kind words on Broken But Not Undone",
        "date": "2013-12-09",
        "excerpt": "Alan cross has described \"Those That Know,\" the first track off Broken But Not Undone —the new LP by Kurt von Stetten —thusly, \"This song is erratic, insecure, passionate and sweaty all at once. Glori"
      },
      {
        "id": "396",
        "title": "Kurt von Stetten live on WMBR",
        "date": "2013-11-20",
        "excerpt": "We had quite a day yesterday! We launched this new site, release the new Kurt von Stetten album Broken But Not Undone , and capped things off with a short (but sweet) acoustic appearance on WMBR's Pip"
      },
      {
        "id": "371",
        "title": "Broken, But Not Undone by Kurt von Stetten on sale now! (mostly...)",
        "date": "2013-11-19",
        "excerpt": "Few things are harder to wrangle in the land of DIY than a firm release date for vinyl. You give ample time, even push back the release date to be safe. And then the test pressings take longer than yo"
      },
      {
        "id": "393",
        "title": "Early love for KvS' Broken But Not Undone",
        "date": "2013-11-19",
        "excerpt": "One sale today and the early reviews are already in! Floorshime Zipper Boots calls Broken But Not Undone an \" altogether perfect record...the singular must have of the fall. \" Meanwhile our pal Ryan's"
      },
      {
        "id": "352",
        "title": "New video from Kurt von Stetten!",
        "date": "2013-11-16",
        "excerpt": "Video for the first single— Those That Know —off the new Kurt von Stetten album Broken, But Not Undone . Dig it... then question why you ever entertained the notion of going art / music school. Dummy."
      },
      {
        "id": "343",
        "title": "Broken, but note undone.. the new album by Kurt von Stetten out on vinyl / digital 11/19.",
        "date": "2013-11-14",
        "excerpt": "We're more than a little excited about this one. Kurt's second of the calendar year, Broken, but not undone is a return to the sort of homemade indie rock that's been lost in the din of quasi-talented"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=4274708306/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/broken-but-not-undone\">Broken, but not undone by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Careers in Science",
    "artist": "The Longwalls",
    "slug": "careers-in-science",
    "artistSlug": "the-longwalls",
    "releaseDate": "2011-06-07",
    "catalogNumber": "SMR003",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/careers-in-science.png",
    "featuredQuote": {
      "text": "A start-to-finish power-pop gem.",
      "source": "Beat The Indie Drum"
    },
    "description": "The Longwalls are serious about their science. “Careers” is their pulpy run at sci-fi triumph and failure—equal parts spaghetti western and 1950s futurism, pedal steel and 8-bit keyboard, failed missions in space, dystopian states of the body and mind, and phantom extra terrestrials that we may or may not have seen. It’s cold and dangerous in space; Careers in Science is the cosmonaut’s companion in the dark void between the stars.\n\nOne of science fiction’s greatest attributes is its ability to present incredibly relatable, even classic themes through a modern prism, and it’s the perfect vehicle for The Longwalls this time around. Family failure and feelings of inadequacy are way more fun if they happen in space! Still rooted in their own brand of Americana and post-pop, The Longwalls stretch their legs in the studio, head in new textural directions, and collaborate in songwriting like never before.",
    "tracks": [
      {
        "number": 1,
        "title": "Careers in Science"
      },
      {
        "number": 2,
        "title": "Where Things Go to Fade"
      },
      {
        "number": 3,
        "title": "In the Cooler"
      },
      {
        "number": 4,
        "title": "Sargasso in Space"
      },
      {
        "number": 5,
        "title": "Homecoming"
      },
      {
        "number": 6,
        "title": "Sex and Work"
      },
      {
        "number": 7,
        "title": "King of Country"
      },
      {
        "number": 8,
        "title": "UFO"
      }
    ],
    "credits": "Alan Wuorinen – vocals, acoustic guitar, pedal steel, backing vocals, lonesome whistle\nKurt von Stetten – drums, cello, hand percussion, “Cooler” space guitar & “Eno” keys, backing vocals\nDan London – bass, backing vocals (lead on “Sex and Work”)\nBrandon Comstock – electric guitar, electric piano / 8-bit emulators, backing vocals (lead on “Fade” and “UFO”)\n\nSongs by Alan (BMI); \"Fade\" and \"UFO\" by Brandon (BMI); \"Sex and Work\" by Dan.\nMusic by The Longwalls. Trumpet on \"Careers\" by Damian David.\nProduced The Longwalls with Mike Quinn\nEngineered, mixed, and mastered by Mike Quinn (Moontower) at Q Division Studios\nDesign by Alex Budnitz",
    "press": [
      {
        "text": "The pure sound of these songs provide such visceral pleasure that between being swept along into the reflecting tide pool of tracks like “Sargasso in Space,’’ or being struck by the stately, Sheila Divine-esque “King of Country,’’ parsing any over-arching narrative or grand theme seems beside the point.",
        "source": "Boston Globe",
        "url": null
      },
      {
        "text": "A start-to-finish power-pop gem with equal amounts jangle and twang.",
        "source": "Beat The Indie Drum",
        "url": null
      },
      {
        "text": "With a burst of clash-like rhythms mixed with an Elvis Costello, jangling guitar, The Longwalls lay down an epic sound on Careers in Science as it slips and slides its way into an anthem of sorts for the post-punk, neo-new wave rockers.",
        "source": "Culture Bomb",
        "url": null
      },
      {
        "text": "There’s an awful lot to like in these pleasurably jangly songs. Mostly this is a fun romp. “Sex and Work” is not only ingenious, but infectiously catchy. And tunes like “Sargasso in Space” and “UFO” are practically anthemic. Actually, even songs like the countryish “Homecoming” and the light-hearted “In the Cooler” (dig that middle-eight!) might well have the sort of staying power denied to more ponderous, self-serious local entries, in just the same way that currently I would rather listen to airy L.A. pop like the Turtles than to the querulous and far doomier Doors, or to the Rezillos and the Revillos than to, say, Public Image Limited. Highly recommended.",
        "source": "The Noise (scroll)",
        "url": null
      },
      {
        "text": "Modern Springsteen, but with a indie touch",
        "source": "Oh So Fresh! Music",
        "url": null
      },
      {
        "text": "Rock spunk and Americana bells and whistles (quite literally).",
        "source": "Ride the Tempo",
        "url": null
      },
      {
        "text": "These Boston fellas sure know how to make some fine music for our ears.",
        "source": "Dysonsound",
        "url": null
      },
      {
        "text": "A leap forward.",
        "source": "Americana Rock Mix",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC0FDEE6035936214",
    "relatedPosts": [
      {
        "id": "931",
        "title": "Live video. Kind words. Alan represents The Longwalls at Outlaw Roadshow 2016 this past fall in NYC.",
        "date": "2016-12-21",
        "excerpt": "Well ain't this a hum-dinger! Alan opens up with \"Sargasso in Space\" off The Longwalls ' classic 2012 EP, Careers in Science ; follows it up with a tease from the band's forthcoming 6th release with ("
      },
      {
        "id": "295",
        "title": "We play the guitar on the MTV...",
        "date": "2013-09-05",
        "excerpt": "Kurt von Stetten's L.A.R.P (from 2011's Cyclops ), as well as Sargasso in Space and Where Things Go to Fade by The Longwalls (from 2011's Careers in Science ) are all being featured this month on a ce"
      },
      {
        "id": "246",
        "title": "Hot best of '11 action—Longwalls style!",
        "date": "2012-01-22",
        "excerpt": "The Longwalls ' Careers in Science album has also landed on a few of best of 2011 lists by the fine folks at The Noise , Twangville , and Beat the Indie Drum ! Thanks to all! Was a good year in SMR la"
      },
      {
        "id": "230",
        "title": "Careers in Science: \"Rural America meets the urban streets\"",
        "date": "2011-08-30",
        "excerpt": "The fine folks over at Culture Bomb have some very nice things to say about The Longwalls' Careers in Science Album! Lines like \"clash-like rhythms mixed with an Elvis Costello, jangling guitar\" make "
      },
      {
        "id": "228",
        "title": "Careers in Science hangin' around!",
        "date": "2011-08-23",
        "excerpt": "The Longwalls' album \" Careers in Science \" is hanging around the Noise local radio chart. The album has been on the charts since April is hanging in there at #15 for August. Big thanks to all the loc"
      },
      {
        "id": "226",
        "title": "BTID hearts (x4!) Careers in Science",
        "date": "2011-07-18",
        "excerpt": "Matt at Beat The Indie Drum has called The Longwalls' Careers in Science a \"start-to-finish power-pop gem.\" He's really smart, so you should listen to what he has to say! Thanks Matt!"
      },
      {
        "id": "222",
        "title": "Ingenious, infectious, and practically anthemic!",
        "date": "2011-05-04",
        "excerpt": "Wow! Some very kind words from The Noise on The Longwalls new album Careers in Science . (Although, we think the CriticTron 3000 needs an upgrade...). Check it out! (scroll..)"
      },
      {
        "id": "220",
        "title": "Two months in the Top 10!",
        "date": "2011-04-29",
        "excerpt": "Whoa! Two months in the top 10 of the Noise Local Radio Chart for The Longwalls ' Careers in Science ! Big thanks (again) to all the local DJs for spinning the new record!!"
      },
      {
        "id": "218",
        "title": "#7 with a bullett!",
        "date": "2011-04-21",
        "excerpt": "#7 with a bullet!! The Longwalls' new album Careers in Science has made the top 10 of The Noise local radio chart for the month of April! Huge thanks to our friends at WMBR , WMFO , WFNX , WZLX and al"
      },
      {
        "id": "216",
        "title": "Thank you!!",
        "date": "2011-04-12",
        "excerpt": "A HUGE thank you is in order for everyone who came out to The Longwalls' Careers in Science CD release show at Precinct on Friday night. We had a blast, thank you so much! And thanks to Glenn Yoder an"
      },
      {
        "id": "209",
        "title": "As we suspected—people are loving \"Careers in Science\"!!",
        "date": "2011-03-04",
        "excerpt": "\" The pure sound of these songs provide such visceral pleasure .\" Some very kind words indeed on The Longwalls' Careers in Science from the Boston Globe ! Meanwhile, Oh So Fresh! Music thinks the albu"
      },
      {
        "id": "205",
        "title": "Blogging about Careers in Science",
        "date": "2011-02-22",
        "excerpt": "Curious about The Longwalls' upcoming Careers in Science album?!? Head on over to Alan's blog where he's talking about the thinking behind each song, posting early demos, live recordings, and a few of"
      },
      {
        "id": "207",
        "title": "Careers in Science / Longwalls update",
        "date": "2011-02-22",
        "excerpt": "Hey ya'll! A few things to check out: (1) Brandon's colleague Alex talks about Careers in Science album art design over on the Sametz blog ! (2) Ride the Tempo gave the album a nice 'lil mention . (3)"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2426230404/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/careers-in-science\">Careers in Science by The Longwalls</a></iframe>"
  },
  {
    "name": "Cycle",
    "artist": "Kurt von Stetten",
    "slug": "cycle",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2012-03-01",
    "catalogNumber": "SMR011",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/cycle.jpg",
    "featuredQuote": {
      "text": "A definite must have",
      "source": "Floorshime Zipper Boots"
    },
    "description": "When I mess up I hit the all clear...\n\nKurt von Stetten returns with his 12th solo effort—in 12 years. This new mega release, entitled Cycle, ebbs and flows from track to track, bunny-hopping textures and moods like no other KvS release to date. Kurt explores new territory and mines new sounds, creating textural songs that float about you as if they can be reached out and touched. And, once again, the entire album was written, performed, and recorded by Kurt.\n\nIn Kurt's own words...\n\nIn a perfect world the division of labor between the mind and body is simple - until then let's calculate. You'd better run, for the heat of the sun is unparalleled. You talk then I talk, but I am really just going to rephrase what you say. It is going to be really hard to tell this story in the future so he will have to round out some of the harder edges. Those letters just pile up so instead of collecting them she just throws them away. It starts with a jolt and you do what you are told, but you get to decide if it should be fight or flight. Communication should be based on a shared set of facts, absent that you should just rely on past experience. After a rough year of travel and self reflection James is finally on the mend. They have studied the language, but they cannot confirm what is being said. He's not a bad man- oh I have seen way worse! Both sides didn't really know that they broke up. You cannot own it and despite all best efforts you cannot know it. After a good amount of trouble, and really I mean trouble, you have decided that you have had enough. Seriously bro I thought I could get this supported by our town, I am sorry. Ok so I saw this creature while fishing, way out in the deep, it had a curved spine made of protruding bone. Sometimes it is worth it to get grounded- so he decided he didn't need his weekends anymore. Set the repeats up really high. Through it all, for better or worse, she was a scientist first. After the accident it was a good sign that he knew something was hurting. During a dark stretch in his youth he could be seen shouting a people in bars. Humid summer night. Some things look very easy when you are young.",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "\"What you get is delicious indie rock. Plenty of catchy tunes and hooks, engaging riffs and some 12 string twang for a little depth. This album delivers both quantity and quality, and is a definite must have.\"",
        "source": "Floorshime Zipper Boots",
        "url": null
      }
    ],
    "bandcampUrl": "bandcamp.com/album/cycle",
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "966",
        "title": "Kurt von Stetten delivers a \"definite must have\"",
        "date": "2017-11-10",
        "excerpt": "The very knowledgable folks at Floorshime Zipper Boots have deemed Kurt von Stetten's \"Cycle\" a \"definite must have.\" We certainly agree. And at 23 tracks, it's both quant and qual. Star qual to be ex"
      },
      {
        "id": "962",
        "title": "\"Cycle\" —23 new tracks from Kurt von Stetten— on sale now!",
        "date": "2017-10-27",
        "excerpt": "Hey now! It's that time of year. Again. We don't how he does it, we're just happy he does. These 23 new tracks from Kurt von Stetten are quite a trip. Distorted synths and REM jangle cohabitate as Kur"
      },
      {
        "id": "952",
        "title": "Kurt von Stetten back with new (double!) album entitled \"Cycle\"",
        "date": "2017-10-17",
        "excerpt": "Clocking in at an hour plus with 23 tracks, this is a ton of new material from our favorite son, Kurt von Stetten . This new mega release, entitled Cycle , ebbs and flows from track to track, bunny-ho"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1100626880/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/cycle\">Cycle by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Cyclops",
    "artist": "Kurt von Stetten",
    "slug": "cyclops",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2010-04-01",
    "catalogNumber": "SMR009",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/cyclops.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan’s Smashing Life"
    },
    "description": "Diverging from the pop-centric sound of his last release Pyramid, the eclectic and intricate garage rock on Kurt von Stetten's Cyclops deals with fantasy and the fever of awesome ideas; everything from war to fashion. As with each of his releases, he relies on minimal story telling and the power of simple song structure...\n\nA man spends his whole life pretending to be a writer and as a result never has an authentic experience. A young couple tries to escape a war zone, but the two warring factions constantly try to force them to pick a side. A futuristic soldier rethinks his life while he is trapped in a fox hole, pinned down by enemy robot fire. An old boxer grows tired of hitting people and life. A father tells his son about his \"wild years\" and the son realizes that his father is really just a big pussy. A young man gives himself entirely over to fantasy and spends his days fighting a Cyclops and an Invisible Menace. An artist tries to communicate complex ideas through interpretive dance and realizes that, on some level, he must take into account the vernacular of the audience. A fisherman and his crew are bested by a whale and almost starve on the open water. After a man-made accident, a man and woman realize that they have super powers and after denying it they come to accept their awesome responsibility. An older office worker writes a graphic novel and after years of hiding it away starts showing it to people despite being terrified of criticism. A man realizes that scientific inquiry always has its risks- especially if society does not like what you discover. A man berates the hipsters on bikes blocking the sidewalk as he is trying to walk by the Middle East club... in Central Square.",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "A gifted creator... New England's top new talent... The man wears his heart on his sleeve and much of the magic ends up on the records here. Cyclops is the new one and here we find the best sound of the two, it's a fantastic example of isolationist creativity. Von Stetten proves, time and again, he is his own man... New England has a prolific genius on its hands and his name is Kurt von Stetten.",
        "source": "Ryan's Smashing Life Cyclops hits the right notes, pushes the right buttons and becomes near and dear to the heart — Music Savage The album deepens with each listen, and I’ve very much enjoyed hearing it again and again. — Music Savage (best of 2011) Bursts with unparalleled joy and spontaneity; it is packed with wonderfully quirky, restlessly melodious guitar pop that recalls indie rock’s best moment in a playful and condensed mishmash. — The Owl Mag A fearless solo act. — Earmilk Cyclops is an aural feast not to be overlooked. This is probably the coolest thing I’ve heard in the last several months! This is destined to be your new favorite album. — The Noise (scroll) Those not afraid of taking on something different should check out Kurt von Stetten. — Golden Mixtape Continually fresh with every listen. — Elusive Little Comments Kurt definitely can not be genre defined. If you come up with one, well then shit, he’s sitting alone in it. But with the amount of aural pleasure that’s coming from that genre, I’m sure it’s not much of a lonely place. — Dysonsound Somewhere between hypnotic and epic. — Online Rock You'll have to seek out \"Cyclops,\" but I assure you it's worth the effort. — In Tune (The Daily News)",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "4v0nX_Vntm8",
    "relatedPosts": [
      {
        "id": "627",
        "title": "Kurt von Stetten is (still) winning the internet",
        "date": "2014-12-10",
        "excerpt": "Kurt von Stetten is killing it! On the heels of composing the new theme for the Lost at Home Podcast , a fantastic interview by the fab folks at Visions of the Unexcused —entitled \" The Last Renaissan"
      },
      {
        "id": "295",
        "title": "We play the guitar on the MTV...",
        "date": "2013-09-05",
        "excerpt": "Kurt von Stetten's L.A.R.P (from 2011's Cyclops ), as well as Sargasso in Space and Where Things Go to Fade by The Longwalls (from 2011's Careers in Science ) are all being featured this month on a ce"
      },
      {
        "id": "289",
        "title": "Kurt von Stetten featured in Vans BMX video!",
        "date": "2013-03-27",
        "excerpt": "We couldn't be more excited about Vans pairing our own Kurt von Stetten with the amazing BMX rider Dan Sandoval . The track is \"He's no Writer\" off Kurt's 2011 release, Cyclops . The rest speaks for i"
      },
      {
        "id": "256",
        "title": "Kurt von Stetten on Pandora!",
        "date": "2012-05-22",
        "excerpt": "Pandora listeners— Kurt von Stetten's album Cyclops is now up on Pandora (along with 2009's History ). Easier said then done. Check it out, Kurt makes great radio."
      },
      {
        "id": "252",
        "title": "More love for the Cyclops!",
        "date": "2012-04-11",
        "excerpt": "Somehow we missed these: Boston's own The Noise recently ran a glowing review of Kurt von Stetten's Cyclops calling it an \" aural feast not to be overlooked .\" Damn. And the Elusive Little Comments bl"
      },
      {
        "id": "236",
        "title": "Video: Code of Fisherman by Kurt von Stetten",
        "date": "2012-01-20",
        "excerpt": "In case you missed it, Kurt von Stetten produced a video for the track Code of Fisherman off his new album Cyclops . Kurt hand painted all the elements before scanning them into his Commadore 64 to ge"
      },
      {
        "id": "244",
        "title": "Best of 2011 for KvS' Cyclops *and* Pyramid!",
        "date": "2012-01-20",
        "excerpt": "Kurt von Stetten's Cyclops has made into a couple of stellar \"best of\" lists for 2011. Ryan's Smashing Life included both Cyclops and Pyramid on his list and called Kurt a \"gifted creator\" and a \"prol"
      },
      {
        "id": "234",
        "title": "Kurt von Stetten's Cyclops is killing it!",
        "date": "2011-12-13",
        "excerpt": "Early reviews are in from Dysonsound , Music Savage , The Owl Mag , Earmilk , and Migrate Music . It's official, Kurt von Stetten's new album Cyclops is KILLING IT. More soon, when we catch our breath"
      }
    ],
    "youtubeVideo": "4v0nX_Vntm8",
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3677298469/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/cyclops\">Cyclops by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Dark Academy",
    "artist": "The Longwalls",
    "slug": "dark-academy",
    "artistSlug": "the-longwalls",
    "releaseDate": "2010-06-01",
    "catalogNumber": "SMR002",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/DA.jpg",
    "featuredQuote": {
      "text": "The Longwalls have one of the sweetest Alt Country ballads I’ve heard in a while.",
      "source": "Slowcoustic"
    },
    "description": "Both darker and more varied than their 2008 debut (Field Guide for the Zombie Survivalist),The Longwalls' second release is A 21-minute trip down memory lane with Guided By Voices, Wilco, and a stack of comic books along for the ride. Songs about families, friends, spirits, and A-bombs stalk a line between The Longwalls' love of big twang and classic American indie rock.",
    "tracks": [
      {
        "number": 1,
        "title": "Playwrights"
      },
      {
        "number": 2,
        "title": "Dark Academy"
      },
      {
        "number": 3,
        "title": "Saturday"
      },
      {
        "number": 4,
        "title": "Touchdown"
      },
      {
        "number": 5,
        "title": "Ghosts"
      },
      {
        "number": 6,
        "title": "Brave Arms"
      }
    ],
    "credits": "Alan Wuorinen – vox, acoustic guitar, electric piano\nDan London – bass, backing vox (lead on \"Saturday\")\nKurt Von Stetten – drums, cello, hand percussion\nBrandon Comstock – electric guitars, glockenspiel, backing vox (lead on \"Ghosts\")\n\nSongs by Alan Wuorinen (BMI) except \"Ghosts\" by Brandon (BMI) and \"Saturday\" by Dan. Music by The Longwalls.\n\nEngineered, mixed and mastered by Mike Quinn Moontower Studios (www.moontowerstudio.com) November 2009 - January 2010.\nArtwork by Steve Madden www.smadden.com.",
    "press": [
      {
        "text": "The Longwalls have one of the sweetest Alt Country ballads I’ve heard in a while.",
        "source": "Slowcoustic",
        "url": null
      },
      {
        "text": "A perfect blend of Americana and catchy-as-heck pop.",
        "source": "Band in Boston",
        "url": null
      },
      {
        "text": "A good addition to your collection if you want some indie cred in your otherwise twangy music catalog.",
        "source": "Twangville",
        "url": null
      },
      {
        "text": "Our Americana is one that can look one direction and see America, yet look the other direction and see the wild expanses of the untamed ocean. The Longwalls have captured this essence in Dark Academy.",
        "source": "Boston Band Crush",
        "url": null
      },
      {
        "text": "A host of catchy hooks, jangly guitar combined with an indie sensibility.",
        "source": "Beat Surrender",
        "url": null
      },
      {
        "text": "This record has all the earmarks of a future classic and gets better with every listen.",
        "source": "The Noise (scroll)",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC0FDEE6035936214",
    "relatedPosts": [
      {
        "id": "931",
        "title": "Live video. Kind words. Alan represents The Longwalls at Outlaw Roadshow 2016 this past fall in NYC.",
        "date": "2016-12-21",
        "excerpt": "Well ain't this a hum-dinger! Alan opens up with \"Sargasso in Space\" off The Longwalls ' classic 2012 EP, Careers in Science ; follows it up with a tease from the band's forthcoming 6th release with ("
      },
      {
        "id": "214",
        "title": "New video for The Longwalls' \"Ghosts\"!",
        "date": "2011-03-07",
        "excerpt": "The Longwalls have just released a haunting, stop-motion video for the song Ghosts off 2010's Dark Academy EP. Check it out ! The video was produced by our good friend Ryan Murphy , be sure to let him"
      },
      {
        "id": "185",
        "title": "The Noise loves \"Dark Academy\"!",
        "date": "2010-04-30",
        "excerpt": "Boston's own The Noise can't recommend The Longwalls more highly, and says Dark Academy has \"all the earmarks of future classic and gets better with every listen.\" Gee, that's really nice of them. Rea"
      },
      {
        "id": "162",
        "title": "Dark Academy looming...",
        "date": "2010-04-14",
        "excerpt": "The Longwalls ' new EP Dark Academy is in hand and will be available soon here at Static Motor as well as CD Baby, iTunes, and many other fine retail outlets. We also have a release show set for Satur"
      },
      {
        "id": "160",
        "title": "Kind words on Dark Academy",
        "date": "2010-04-07",
        "excerpt": "Wow, some *very* kind words on The Longwalls ' Dark Academy EP on the Slowcoustic blog . Check it out!"
      },
      {
        "id": "183",
        "title": "Get some indie cred in your twang collection!",
        "date": "2010-04-02",
        "excerpt": "The fine folks at Twangville have posted a nice review of The Longwalls Dark Academy EP. They think we do a little Jayhawks and mix in a little Shins. But I swear, there ain't no wah-wah anywhere. Hav"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=220835075/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/dark-academy\">Dark Academy by The Longwalls</a></iframe>"
  },
  {
    "name": "Field Guide for the Zombie Survivalist",
    "artist": "The Longwalls",
    "slug": "field-guide-for-the-zombie-survivalist",
    "artistSlug": "the-longwalls",
    "releaseDate": "2008-10-31",
    "catalogNumber": "SMR001",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/FGZS.jpg",
    "featuredQuote": {
      "text": "A perfect blend of Americana and catchy-as-heck pop.",
      "source": "Band in Boston"
    },
    "description": "The Longwalls' home-brewed debut, Field Guide for the Zombie Survivalist, is a cascading picture book of persons, places and things--living and undead. With cinematic songs about redheads, zombies, God, painkillers, good jobs and really bad ones, The Longwalls stalk a line from classic indie rock to big-twang Americana––with a few heady stops along the way.",
    "tracks": [],
    "credits": null,
    "press": [],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "iBvmxC084fc",
    "relatedPosts": [
      {
        "id": "181",
        "title": "The Longwalls' Zombies! kicks off PopMatters Mixtape",
        "date": "2009-09-21",
        "excerpt": "Nom Nom Nom....PopMatters Mixtape #4 is all about zombies, so who better to kick if off than your Longwalls?!?! It's a great mix, and they even embedded our video. Check it out!!"
      },
      {
        "id": "149",
        "title": "Zombies! Premiere!",
        "date": "2009-09-06",
        "excerpt": "The Longwalls ' Zombies! video premiere with the Plymouth Rock Studios gang is set for Friday, October 30! Details so far: Renting a theatre, showing a bunch of zombie shorts, then the video launch, t"
      },
      {
        "id": "151",
        "title": "More Zombies! bloggage",
        "date": "2009-09-06",
        "excerpt": "Another article on The Longwalls' Zombies! video shoot, and what a fully-functioning Plymouth Rock Studios could mean to their community."
      },
      {
        "id": "154",
        "title": "Even more Zombies! bloggage",
        "date": "2009-09-06",
        "excerpt": "A nice blog post on The Longwalls' weekend video shoot for Zombies down at Plymouth Rock Studios here . Thanks!"
      },
      {
        "id": "156",
        "title": "All Zombies all the time!",
        "date": "2009-09-06",
        "excerpt": "A great recap of the The Longwalls Zombies! video shoot from Director Louie Jannetty on his blog ."
      },
      {
        "id": "158",
        "title": "Field Guide almost sold out!",
        "date": "2009-09-06",
        "excerpt": "The Longwalls' debut— Field Guide for the Zombie Survivalist — is just about sold out. There's 4 copies (I think!) available on CD Baby , that's about it. If you want the CD, get it now as we probably"
      },
      {
        "id": "76",
        "title": "Zombie shoot, great success!",
        "date": "2009-09-04",
        "excerpt": "Thank you thank you thank you to everyone who took part in the The Longwalls' Zombies! shoot this weekend down at Plymouth Rock Studios. The crew (Louie Jannetty Director,Josh Bethoney Producer, and S"
      },
      {
        "id": "79",
        "title": "Zombies on the blog",
        "date": "2009-09-04",
        "excerpt": "A nice blog post on The Longwalls' weekend video shoot for Zombies down at Plymouth Rock Studios here . Thanks guys!"
      },
      {
        "id": "73",
        "title": "Zombies are coming!",
        "date": "2009-09-01",
        "excerpt": "The Longwalls video shoot for Zombies starts next Friday night! We'll be shooting Friday night, all day Saturday, and Sunday morning. Gonna be a long weekend but we're pretty excited about it. In prep"
      }
    ],
    "youtubeVideo": "iBvmxC084fc",
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3196483263/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/field-guide-for-the-zombie-survivalist\">Field Guide for the Zombie Survivalist by The Longwalls</a></iframe>"
  },
  {
    "name": "Five Songs",
    "artist": "Gatsby",
    "slug": "five-songs",
    "artistSlug": "gatsby",
    "releaseDate": "2003-01-01",
    "catalogNumber": "SMR016",
    "formats": [
      "CD"
    ],
    "coverImage": "assets/images/albums/five-songs.jpg",
    "featuredQuote": {
      "text": "Wrenching vocals add a sense of urgency, sneaking a touch of Cheap Trick flair into the mix as the band blasts through its precision pop.",
      "source": "Splendid"
    },
    "description": "The quick follow-up to the Amy Single. Holding up a Line and Donna were recorded for the Vinyl Ritchie Compilation disc, and Moderator (a song with Brandon on lead vox), was slotted in the middle to give the EP two distinct halves with re-mixed Pretend and Amy at the top.\n\nReleased in May 2003 at a sold-out release show at the Lizard Lounge in Cambridge, these recordings find Gatsby doing what it did best: blasting out frenetic pop with lots of hooks, guitars and harmonies.",
    "tracks": [
      {
        "number": 1,
        "title": "Pretend"
      },
      {
        "number": 2,
        "title": "Amy"
      },
      {
        "number": 3,
        "title": "Moderator"
      },
      {
        "number": 4,
        "title": "Donna"
      },
      {
        "number": 5,
        "title": "Holding up a Line"
      }
    ],
    "credits": "Jay Figueroa - guitars\nScott Robinson - drums\nBrandon Comstock - guitars, vocals\nAlan Wuorinen - vocals, bass\n\nRecorded, mixed and mastered with Mike Quinn at Moontower Studio, Cambridge.",
    "press": [
      {
        "text": "The only flaw with this friend is that it shows up to say hello, and barely gives you time to shake hands before you find yourself saying goodbye. With five songs clocking in at under twelve minutes, this little reunion doesn’t last anywhere near as long as you would like it to.",
        "source": "Northeast Performer",
        "url": null
      },
      {
        "text": "“Moderator” is the real killer here",
        "source": "fast-paced drums and dirty guitar riffs pound the band’s pop home, while wrenching vocals add a sense of urgency, sneaking a touch of Cheap Trick flair into the mix as the band blasts through its precision pop.\n— Splendid",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": [],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2014461788/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://gatsby.bandcamp.com/album/five-songs\">Five Songs by Gatsby</a></iframe>"
  },
  {
    "name": "Floods + Fires",
    "artist": "Gatsby",
    "slug": "floods-fires",
    "artistSlug": "gatsby",
    "releaseDate": "2005-05-01",
    "catalogNumber": "SMR017",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/floods-fires-hq.jpg",
    "featuredQuote": {
      "text": "Gatsby have the great American indie-guitar rock album on their hands.",
      "source": "Big Takeover"
    },
    "description": "A more balanced affair than the Five Songs EP (2003), Floods + Fires is a dynamic set that pits Gatsby's penchant for noisy, double-time, indie-rock assaults against slower-tempo pop, quiet melodies, and hints of twang. In the end, Floods + Fires is about conflict and the energy that conflict creates...and ultimately takes away. Gatsby's only full-length--and ultimately its swan song, Floods + Fires earned significant critical praise from local, regional, and national reviewers, and found regular radio play on more than 100 stations throughout New England and beyond.\n\nDigital download includes two bonus tracks that we were stupid enough to leave off the CD. If you buy the CD we'll send 'em to you separately.",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "Played through top to bottom, Floods + Fires is a great album.",
        "source": "Now on Tour",
        "url": null
      },
      {
        "text": "Gatsby’s forte is the same as Superchunk’s: riff",
        "source": "driven songs with unconventional melodies that don’t seem like they should be catchy — but somehow are. It’s a much easier trick to describe than to pull off, and Gatsby does better at it than most.\n— Pathetic Caverns",
        "url": null
      },
      {
        "text": "5th best New England CD of 2005",
        "source": "Worcester Magazine",
        "url": null
      },
      {
        "text": "Gatsby have the great American indie",
        "source": "guitar rock album on their hands.\n— Big Takeover",
        "url": null
      },
      {
        "text": "Nothing could prepare you for Floods + Fires. Gatsby have been likened to Hüsker Dü, Heatmiser, Guided by Voices, The Feelies and Das Damen, and here, at last, you’ll get the impression that they’ve earned the comparisons.",
        "source": "Splendid",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": [],
    "soundcloudEmbed": "<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?visual=true&url=https%3A%2F%2Fapi.soundcloud.com%2Fplaylists%2F58059&show_artwork=true\"></iframe>"
  },
  {
    "name": "Floods + Fires [Turbo Edition]",
    "artist": "Gatsby",
    "slug": "floods-fires-turbo-edition",
    "artistSlug": "gatsby",
    "releaseDate": "2012-11-01",
    "catalogNumber": "SMR018",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/floods-fires-turbo-edition.jpg",
    "featuredQuote": {
      "text": "Gatsby have the great American indie-guitar rock album on their hands.",
      "source": "Big Takeover"
    },
    "description": "10 years ago, Gatsby released Floods + Fires. A week later, we broke up.\n\nLike many bands before us, we were left with boxes and boxes of CDs. Boxes that continue to clutter closets. CDs that will never ever be sold. An album that too few heard, but one that I’ve recently came to truly appreciate.\n\nWe were an impressionable lot. At least I was. Raised on metal with an affinity for punk and new wave, Gatsby stumbled into the Boston music scene of the early aughts and found itself immediately influenced by the many great bands of the day. We were the naive, excitable \"happy-to-be-there\" guys, and over the course of a few years we soaked it all up. With the sounds of the day clattering around in our heads, we spent the better part of 2004 making Floods + Fires (original release).\n\nWhile recording I was mostly concerned, too a fault, with how everything measured up to our peers. “What would X band do with this part?” It’s a taxing way to make an album, but I suppose it pushed us a bit (and you can certainly hear nods to Boston bands circa 2003-5 all over the album).\n\nA bit drained by May 2005, we only played a handful of shows after its release before quietly exiting the scene without the typical Boston farewell show fanfare. But I’d listen to the album from time to time. And over the years, with more distance, I became really fond of the music. Impressed even.. in a \"how they hell did we pull that off?!?\" sort of way. And now, 10 years on, I have a true appreciation of the songwriting and the performances.\n\nTo commemorate the 10 year anniversary of its release, I asked our old pal Mike Quinn at Moontower/Q-Division to dig up the old recordings and do a new mix and master, cut out the 4 instrumental interludes, and add back two songs that (stupidly, my bad) didn't make the final cut back in 2004. The result is fast and fresh. Turbo. \n\nAnd digital only. No damn CDs… ;)\n\nEnough said. On behalf of my mates Alan, Scott, and Jay—please enjoy this fresh take on our humble classic.\n\nCheers,\nbrandon",
    "tracks": [
      {
        "number": 1,
        "title": "Pretty To Think So"
      },
      {
        "number": 2,
        "title": "Snakes"
      },
      {
        "number": 3,
        "title": "High Low"
      },
      {
        "number": 4,
        "title": "All My Fault"
      },
      {
        "number": 5,
        "title": "Grad School"
      },
      {
        "number": 6,
        "title": "Prize Fight"
      },
      {
        "number": 7,
        "title": "Paint"
      },
      {
        "number": 8,
        "title": "Agent Birds"
      },
      {
        "number": 9,
        "title": "My Piano"
      },
      {
        "number": 10,
        "title": "Cut Me Down"
      },
      {
        "number": 11,
        "title": "Dodging Bullets"
      },
      {
        "number": 12,
        "title": "Serial Bride"
      }
    ],
    "credits": "Jay Figueroa – guitars\nScott Robinson – drums\nBrandon Comstock – guitars, vocals\nAlan Wuorinen – vocals, bass\n\nAll songs by Alan (c) BMI 2005, except Grad School by Brandon (c) BMI 2005.\n\nOriginally recorded, and mixed with Mike Quinn at Moontower Studio, Cambridge. Mastered by Ian Kennedy at New Alliance East.\n\nRemixed and mastered summer/fall 2015  by Mike Quinn, Moontower Studio / Q Division\n\nTurbo Edition artwork: Alex Budnitz",
    "press": [
      {
        "text": "Played through top to bottom, Floods + Fires is a great album.",
        "source": "Now on Tour",
        "url": null
      },
      {
        "text": "Gatsby’s forte is the same as Superchunk’s: riff",
        "source": "driven songs with unconventional melodies that don’t seem like they should be catchy — but somehow are. It’s a much easier trick to describe than to pull off, and Gatsby does better at it than most.\n— Pathetic Caverns",
        "url": null
      },
      {
        "text": "5th best New England CD of 2005",
        "source": "Worcester Magazine",
        "url": null
      },
      {
        "text": "Gatsby have the great American indie",
        "source": "guitar rock album on their hands.\n— Big Takeover",
        "url": null
      },
      {
        "text": "Nothing could prepare you for Floods + Fires. Gatsby have been likened to Hüsker Dü, Heatmiser, Guided by Voices, The Feelies and Das Damen, and here, at last, you’ll get the impression that they’ve earned the comparisons.",
        "source": "Splendid",
        "url": null
      }
    ],
    "bandcampUrl": "https://gatsby.bandcamp.com/album/floods-fires-turbo-edition",
    "soundcloudPlaylist": "https://soundcloud.com/staticmotor/sets/gatsby-floods-fires-turbo-editon",
    "youtubePlaylist": null,
    "relatedPosts": [
      {
        "id": "779",
        "title": "REISSUE: Floods + Fires [Turbo Edition] by Gatsby",
        "date": "2015-12-01",
        "excerpt": "We're excited (and a little proud) to announce today's release of Floods + Fires [Turbo Edition] —a newly remixed and remastered edition of Gatsby's classic 2005 full-length. Download it for FREE! Her"
      },
      {
        "id": "705",
        "title": "On tap for the fall: new KvS, Longwalls and... Gatsby?",
        "date": "2015-09-04",
        "excerpt": "Wow, what a summer. And now, back to school. Our own Kurt von Stetten has completed his 10th solo album in 10 years! Damn. It's called Bon Fortuna and is slated for an October release date. Meanwhile,"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2275489411/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://gatsby.bandcamp.com/album/floods-fires-turbo-edition\">Floods + Fires (Turbo Edition!) by Gatsby</a></iframe>"
  },
  {
    "name": "Full Circle Commonwealth Women Up Front",
    "artist": "Various Artists",
    "slug": "full-circle-commonwealth-women-up-front",
    "artistSlug": "various-artists",
    "releaseDate": "2016-03-08",
    "catalogNumber": "SMR023",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/full-circle-commonwealth-women-up-front.jpg",
    "featuredQuote": {
      "text": "Expertly curated and features compelling music from start to finish.",
      "source": "Floorshime Zipper Boots"
    },
    "description": null,
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "Expertly curated and features compelling music from start to finish. It’s a great way to sample the best of Boston’s female driven indie scene.",
        "source": "Florshime Zipper Boots",
        "url": null
      },
      {
        "text": "All these singers and bands excel in writing cool, gorgeous songs. They showcase vocal range and musical prowess. Impossible not to listen to it from start to finish again and again and again. Every song impresses with its songwriting, composition and ability to move, soothe or groove.",
        "source": "Amy Steele for Entertainment Realm",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": [],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3057375547/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://fullcirclecomp.bandcamp.com/album/full-circle-commonwealth-women-up-front\">Full Circle - Commonwealth Women Up Front by Various Artists</a></iframe>"
  },
  {
    "name": "Gold Standard",
    "artist": "The Longwalls",
    "slug": "gold-standard",
    "artistSlug": "the-longwalls",
    "releaseDate": "2015-03-10",
    "catalogNumber": "SMR005",
    "formats": [
      "Vinyl",
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/gold-standard.jpg",
    "featuredQuote": {
      "text": "A near perfect tome of Americana-infused fuzz pop.",
      "source": "Visions of the Unexcused."
    },
    "description": "The Longwalls return with their 5th release, Gold Standard. After a series of contemplative EPs, Gold Standard is 11 tracks of glorious, fuzzed-out, Americana-infused post-pop. And no, the title is certainly not a statement. It's a nostalgic reference to an unattainable past. There was a time where there was a bona fide benchmark. That time, whether or not the benchmark actually existed or not, is gone. Misguided nationalistic optimism to the extreme. An idealized form. A gold standard now rendered antiquated by the march of reality, modernity, and violence. So..., now what?",
    "tracks": [
      {
        "number": 1,
        "title": "The Gold Standard"
      },
      {
        "number": 2,
        "title": "Home"
      },
      {
        "number": 3,
        "title": "Hold it"
      },
      {
        "number": 4,
        "title": "Oh My Brother"
      },
      {
        "number": 5,
        "title": "Too Many Prayers"
      },
      {
        "number": 6,
        "title": "Rukia"
      },
      {
        "number": 7,
        "title": "Simple Thoughts"
      },
      {
        "number": 8,
        "title": "Burger and Fries"
      },
      {
        "number": 9,
        "title": "Simo"
      },
      {
        "number": 10,
        "title": "Unarrested"
      },
      {
        "number": 11,
        "title": "Bankai"
      }
    ],
    "credits": "Alan Wuorinen— vocals (lead on 1, 3. 6, 9, 11), acoustic guitar, pedal steel, keys\n\nKurt von Stetten— drums, cello, hand percussion\n\nDan London— bass, acoustic guitar, vocals (lead on 4 and 8)\n\nBrandon Comstock— electric guitar, acoustic guitar, banjo, keys, vocals (lead on 2, 5, 7, 10)\n\nSongs 1, 3, 6, 9, 11 by Alan (BMI); 2, 5, 7, 10 by Brandon (BMI); 4 and 8 by Dan (SESAC).\n\nMusic by The Longwalls.\n\nRecorded & Mixed by Alex Allinson at The Bridge Sound & Stage. Assistants: Alexander Hayes, Ryan Ainsworth. Intern: Dave Pettibone\n\nTrumpets on “Hold it” by Ian Connelly and Tyler Mehlenbacher\n\nMastered by Mike Quinn at Moontower Studio, Q Division.\n\nDesign by Alex Budnitz.",
    "press": [
      {
        "text": "“One of the east coast’s standout pop acts, you aren’t going to want to miss what I’ve already come to describe as “Boston’s best kept secret” for good reason.. they make dark pop and sugarly death songs better than most anybody else I know.”",
        "source": "Ryan’s Smashing Life",
        "url": null
      },
      {
        "text": "“After a series of killer EP’s The Longwalls have released a near perfect tome of Americana",
        "source": "infused fuzz pop in their new LP, Gold Standard.”\n— Visions of the Unexcused",
        "url": null
      },
      {
        "text": "“‘Gold Standard’ bristles with modern angst… the band eases fluidly between emotions and influences; “Simple Thoughts” has a slow",
        "source": "burning country flavor, while the vocals echo coldly through the beginning of “Rukia,” before the layers of reverb, piano, and percussion are brought to a boiling climax.”\n— DigBoston",
        "url": null
      },
      {
        "text": "“Gold Standard” further presents the band as a strong force that produces some catchy songs with a bit of a punk attitude and grit… there is attitude here in the fuzzy overdrive sounds.",
        "source": "Redline Roots",
        "url": null
      },
      {
        "text": "“They craft some of the most innovative and refreshing tunes around.”",
        "source": "MusicBoxPete",
        "url": null
      },
      {
        "text": "“Supporting each other and putting out music and art in the world is just enough. The standards have changed a little bit for us, so to hell with the gold standard, we are doing our own thing,”",
        "source": "The Huntington News",
        "url": null
      },
      {
        "text": "“An interesting piece of work that combines an old",
        "source": "fashioned rock ethos with a more modern sensibility… The Longwalls manage to create a sound that is identifiably unique and I hope they continue to explore more of their distorted tonal music in future albums.”\n— Surviving the Golden Age",
        "url": null
      }
    ],
    "bandcampUrl": "bandcamp.com/album/keep-safe-boston-2016-compilaton-for-fenway-health",
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC0FDEE6035936214",
    "relatedPosts": [
      {
        "id": "935",
        "title": "The Longwalls wish you a happy, snowy Sunday!",
        "date": "2017-01-08",
        "excerpt": "Big thanks to Rob at Sleepover Shows for putting this all together. The song is, of course, \" Home \" off 2015's Gold Standard . Enjoy!"
      },
      {
        "id": "931",
        "title": "Live video. Kind words. Alan represents The Longwalls at Outlaw Roadshow 2016 this past fall in NYC.",
        "date": "2016-12-21",
        "excerpt": "Well ain't this a hum-dinger! Alan opens up with \"Sargasso in Space\" off The Longwalls ' classic 2012 EP, Careers in Science ; follows it up with a tease from the band's forthcoming 6th release with ("
      },
      {
        "id": "918",
        "title": "The Longwalls' lend to track to \"Keep Safe Boston 2016,\" a benefit compilation for Fenway Health",
        "date": "2016-10-23",
        "excerpt": "Keep Safe Boston 2016 Compilation For Fenway Health is dedicated in loving memory to all lives affected by the events of June 12, 2016 at Pulse nightclub in Orlando, Florida. The Longwalls are proud t"
      },
      {
        "id": "765",
        "title": "Video Premiere: The Longwalls – Zombies! – Live at The Bridge Sound and Stage",
        "date": "2015-10-30",
        "excerpt": "Big thanks to our pal Derek at Visions of the Unexcused for premiering the first video from The Longwalls - Live at The Bridge . The Longwalls classic track Zombies! gets the acoustic treatment here c"
      },
      {
        "id": "762",
        "title": "Kind words on The Longwalls from Ryan's Smashing Life",
        "date": "2015-10-09",
        "excerpt": "As The Longwalls get ready to head back to The Bowery Electric in NYC for The Outlaw Roadshow 2015, Ryan's Smashing Life has posted some very kind words on the band and their latest album— Gold Standa"
      },
      {
        "id": "705",
        "title": "On tap for the fall: new KvS, Longwalls and... Gatsby?",
        "date": "2015-09-04",
        "excerpt": "Wow, what a summer. And now, back to school. Our own Kurt von Stetten has completed his 10th solo album in 10 years! Damn. It's called Bon Fortuna and is slated for an October release date. Meanwhile,"
      },
      {
        "id": "694",
        "title": "A crazy few weeks for The Longwalls!",
        "date": "2015-03-20",
        "excerpt": "Well.. that was fun!! Huge thanks to everyone who came out to The Bridge Sound & Stage for The Longwalls ' Gold Standard release show! (Check out this preview from MusicBoxPete ). It was an amazing ti"
      },
      {
        "id": "685",
        "title": "DigBoston interviews The Longwalls",
        "date": "2015-03-06",
        "excerpt": "The fine folks at DigBoston paid a visit to The Longwalls rehearsal space last week to discuss the new album, Gold Standard , the release party Saturday March 7 , and otherwise what the hell the band "
      },
      {
        "id": "679",
        "title": "Early love for The Longwalls' \"Gold Standard\"",
        "date": "2015-02-25",
        "excerpt": "Two of our favorite Boston blogs— Redline Roots and Visions of the Unexcused —have offered some kind words on the new Longwalls record, Gold Standard . Redline Roots writes, \" Gold Standard further pr"
      },
      {
        "id": "677",
        "title": "\"Gold Standard\" by The Longwalls on sale now!",
        "date": "2015-02-24",
        "excerpt": "More than a year in the making... we're so very proud to release the new full-length album by Boston's The Longwalls ! After a series of contemplative EPs, Gold Standard , bursts forth with 11 tracks "
      },
      {
        "id": "667",
        "title": "The Longwalls release party for \"Gold Standard\" set for Saturday, March 7",
        "date": "2015-01-23",
        "excerpt": "Join The Longwalls on Saturday, March 7 as they celebrate the release of their new full-length album, Gold Standard . The party will be held at Bridge Sound and Stage —the studio where the album was r"
      },
      {
        "id": "650",
        "title": "The Longwalls' \"Gold Standard\" to be released 2/24!",
        "date": "2015-01-08",
        "excerpt": "After a series of contemplative EPs, The Longwalls return with Gold Standard —11 tracks of glorious, fuzzed-out, Americana-infused post-pop. Enjoy a quick taste here, look out for the album release (l"
      },
      {
        "id": "494",
        "title": "The Longwalls live on air!",
        "date": "2014-07-31",
        "excerpt": "And possibly a bit tipsy. Give a listen to WEMF this Saturday afternoon from 4-6pm and hear the mighty Longwalls on The Outlaw Radio Show . They'll be hanging with host extraordinaire Ryan Spaulding a"
      },
      {
        "id": "490",
        "title": "Much new music on the way!",
        "date": "2014-06-30",
        "excerpt": "Making making making. That's what we do! Here's the latest... The new Longwalls album, tentatively titled The Gold Standard, is nearing completion. 11 songs (!) are in the hopper over at Bridge Sound "
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1038709307/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/gold-standard\">Gold Standard by The Longwalls</a></iframe>"
  },
  {
    "name": "Gutt",
    "artist": "Kurt von Stetten",
    "slug": "gutt",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2010-04-01",
    "catalogNumber": "SMR009-1",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/gutt.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan's Smashing Life"
    },
    "description": "Ready, ready, ready, ready, ready, ready, ready, set gooooooo...\n\nBold, defiant, insatiable. Boston's Kurt von Stetten returns with his 11th solo effort—in 11 years. Noisy and angular. Low lows. High highs. Big and fragile. Playful and tuneful as ever. And once again written and recorded entirely on his own—with Kurt himself playing every instrument.\n\nIn Kurt's own words...\n\n20 tracks can't be wrong. Give Gutt a go.A smart woman sets a silly kid on the right path. Everything is a stand in for a youth that gets further away every day. He is a performer by vocation, but don't get it twisted, it is just a job. Writing checks to get out of jams is not the smartest thing in the world to do- but it is an adventure. You said you have no one, but you have your health. He will keep that secret because of loyalty, no matter the corporeal price. Just wait it out- it will pass. Putting labels on situations is sometimes a good thing for self preservation. I still use the same dutch oven I was given in childhood. No matter what they say, these things unfold in ways that were never captured on film. We are from the last generation that know we are constant lairs. It really is only a dream- you do not have to create a narrative. The choice is not exactly desirable. He is pretty sure he can make a deal and get out of the situation, but his heart is pounding none the less. Finally, Johnny gets a diagnosis- and it is not good! At night is when it is the worst, but then you wake up and see the good side- I mean it is still a tough loss for the home team though. An overly dramatic response to an everyday situation - just sit there and listen. Continue to wait it out. When ghosts visit you in dreams they are under no obligation to make sense- in fact they could care less. Congratulations, you got what you wanted, but now you have to think about things like heirs.",
    "tracks": [
      {
        "number": 1,
        "title": "In a car, falling in love"
      },
      {
        "number": 2,
        "title": "To him it was youth"
      },
      {
        "number": 3,
        "title": "Performer"
      },
      {
        "number": 4,
        "title": "Adventure"
      },
      {
        "number": 5,
        "title": "Pink lungs"
      },
      {
        "number": 6,
        "title": "A secret from my kingpin"
      },
      {
        "number": 7,
        "title": "Wait it out"
      },
      {
        "number": 8,
        "title": "Stressor"
      },
      {
        "number": 9,
        "title": "Good man"
      },
      {
        "number": 10,
        "title": "Every shade of grey"
      },
      {
        "number": 11,
        "title": "70s son"
      },
      {
        "number": 12,
        "title": "Only in dreams"
      },
      {
        "number": 13,
        "title": "Desirable"
      },
      {
        "number": 14,
        "title": "Tragic but fun"
      },
      {
        "number": 15,
        "title": "A diagnosis for Johnny"
      },
      {
        "number": 16,
        "title": "Snake mountain (explicit lyrics)"
      },
      {
        "number": 17,
        "title": "Nosferatyou"
      },
      {
        "number": 18,
        "title": "Sunshine"
      },
      {
        "number": 19,
        "title": "The future is fashion"
      },
      {
        "number": 20,
        "title": "Kings and sons"
      }
    ],
    "credits": "All vocals instruments by Kvs\nEngineered, mixed and mastered (ha!) by KvS\nArtwork by KvS",
    "press": [],
    "bandcampUrl": "bandcamp.com/album/gutt",
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "924",
        "title": "Kurt von Stetten releases video for \"The Future is Fashion\" from new album Gutt—on sale now!",
        "date": "2016-10-28",
        "excerpt": "A new animated video from Kurt von Stetten dropped in our laps last night! It's for the track \"The Future is Fashion\" of off Kurt's new one, Gutt . It's 20 tracks, it's EPIC, and it's on sale now! Dow"
      },
      {
        "id": "909",
        "title": "Kurt von Stetten to release new album, Gutt, Friday 10/28",
        "date": "2016-10-21",
        "excerpt": "Well, well, well. Here we are busy with another Longwalls album, getting into our fall routines and.. oh looky here: A new KvS album called Gutt ! I guess it has been a year since the excellent Bon Fo"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3969164635/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/gutt\">Gutt by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Happy to See Me",
    "artist": "Dan London",
    "slug": "happy-to-see-me",
    "artistSlug": "dan-london",
    "releaseDate": "2013-04-30",
    "catalogNumber": "SMR021",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/H2SM.jpg",
    "featuredQuote": {
      "text": "Sun soaked guitar spiel with Alt-Pop immediacy. File under Ray Davies or Tom Petty.",
      "source": "Mojophenia"
    },
    "description": "Written over the course of several years in between Nashville and Boston, Happy to See Me is a record about changes——lots and lots of changes. A smart mix of Ray Davies and east coast cool, Happy to See Me is a midnight run through the trials and tribulations associated with becoming comfortable in one's own skin. Better late than never. The album is Dan's solo debut album, and features help from old friends Mike Quinn (Moontower / Q Division, and Kurt von Stetten.",
    "tracks": [
      {
        "number": 1,
        "title": "Little Bit About Me"
      },
      {
        "number": 2,
        "title": "Rock Stars"
      },
      {
        "number": 3,
        "title": "Bold and the Beautiful"
      },
      {
        "number": 4,
        "title": "Katherine Comes Along"
      },
      {
        "number": 5,
        "title": "Flashlight In My Pocket"
      },
      {
        "number": 6,
        "title": "Brooklyn Heights"
      },
      {
        "number": 7,
        "title": "Special"
      },
      {
        "number": 8,
        "title": "Gravity and Time"
      },
      {
        "number": 9,
        "title": "Dirty Jokes"
      },
      {
        "number": 10,
        "title": "The Wrong Place"
      },
      {
        "number": 11,
        "title": "Jersey Devil"
      },
      {
        "number": 12,
        "title": "Crazy Girls"
      },
      {
        "number": 13,
        "title": "Oh Transylvania"
      }
    ],
    "credits": "Dan London: Lead and Backing Vocals, Guitars, Bass, Mandolin, MTron\nWill Dickson: Drums\nKurt von Stetten: Cello, Ukele, Washboard, Tambourine, Backing Vocals, Space Keys, Cowbell\nIlene Altman: Piano, Keys, Backing Vocals, Melodica\nMike Quinn: Wulitzer, Backing Vocals",
    "press": [
      {
        "text": "Sun soaked guitar spiel with Alt",
        "source": "Pop immediacy. File under Ray Davies or Tom Petty.\n— Mojophenia",
        "url": null
      },
      {
        "text": "Melancholic with a surefire guitar or a catchy piano melody, slowly blossoming with graceful strings and a velvet backing vocals.",
        "source": "Alt Country Forum (translated from Dutch)",
        "url": null
      },
      {
        "text": "Whatever the question, Happy to See Me is one mighty fine answer.",
        "source": "Write.Click.Cook.Listen",
        "url": null
      },
      {
        "text": "You get the Ray Davies/Elvis Costello/Bruce Springsteen influences throughout. It’s a fun listen, to be sure.",
        "source": "Sonic Masala",
        "url": null
      }
    ],
    "bandcampUrl": "http://danlondon.bandcamp.com/",
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": [
      {
        "id": "250",
        "title": "More praise for Dan London's Happy to See Me!",
        "date": "2012-04-10",
        "excerpt": "\" Sun soaked guitar spiel with Alt-Pop immediacy. File under Ray Davies or Tom Petty. \" That's what Mojophenia has to say about Dan London's Happy to See Me . And our friends over at Americana Roots w"
      },
      {
        "id": "248",
        "title": "Happy to See Me reviews!",
        "date": "2012-03-01",
        "excerpt": "A couple nice reviews are in for Dan London's solo debut Happy to See Me . Both involve food— one explicitly , the other (in Dutch!) likely the result of a rather hilarious translation . Oh, and pick "
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2589783237/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://danlondon.bandcamp.com/album/happy-to-see-me-2\">Happy To See Me by Dan London</a></iframe>"
  },
  {
    "name": "History",
    "artist": "Kurt von Stetten",
    "slug": "history",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2010-04-01",
    "catalogNumber": "SMR009-2",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/history.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan's Smashing Life"
    },
    "description": "History shows Kurt at his best, mixing and matching story-telling, mental picture-taking, and his favorite indie-rock memories. The result is a remarkably fresh, and often sweet, collection of tunes.",
    "tracks": [],
    "credits": null,
    "press": [],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "358",
        "title": "KvS and the Vans Downtown Showdown!",
        "date": "2012-08-07",
        "excerpt": "Wouldn't you know it.. our own Kurt von Stetten's song 50cc's (off the album History ) is featured in this here skate highlights video from the Blueprint Obstacle at the 2012 Vans Downtown Showdown. D"
      },
      {
        "id": "256",
        "title": "Kurt von Stetten on Pandora!",
        "date": "2012-05-22",
        "excerpt": "Pandora listeners— Kurt von Stetten's album Cyclops is now up on Pandora (along with 2009's History ). Easier said then done. Check it out, Kurt makes great radio."
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2576919820/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/history\">History by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "I Will Take You Back",
    "artist": "Dan London",
    "slug": "i-will-take-you-back",
    "artistSlug": "dan-london",
    "releaseDate": "2016-09-01",
    "catalogNumber": "SMR022",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/i-will-take-you-back.jpg",
    "featuredQuote": {
      "text": "Sun soaked guitar spiel with Alt-Pop immediacy. File under Ray Davies or Tom Petty.",
      "source": "Mojophenia"
    },
    "description": "Dan London, bassist for Boston-based band The Longwalls, is back with his sophomore solo album I Will Take You Back.\n\nWith songs written during a time and place spanning from Nashville, TN twenty years ago, to Jamaica Plain in the last two years, the album reflects that sense of growth and time. Reminiscent of Elvis Costello and Neil Young, it's old school indie with a hint of alt-country; music meant for vinyl and a turntable, or for driving through small towns on back country roads.\n\nThe lead single anchors the album, and is semi-autobiographical, according to London.\n\n\"The title has that double entendre that worked: the singer of the record, a hyper-real version of me in some far off meta-verse, is looking for what went right and what went wrong in his romantic endeavors, when a smoky Pan with a penchant for pop culture comes along and says I'll be your huckleberry.\"\n\nLet that Pan lead you on a introspective musical journey as well.",
    "tracks": [
      {
        "number": 1,
        "title": "Nothing To Be Afraid Of"
      },
      {
        "number": 2,
        "title": "Bob Fosse Dreams of Napoleon in Leather"
      },
      {
        "number": 3,
        "title": "Let’s Get It Over With"
      },
      {
        "number": 4,
        "title": "I Will Take You Back"
      },
      {
        "number": 5,
        "title": "In the Wind"
      },
      {
        "number": 6,
        "title": "Music For Cats"
      },
      {
        "number": 7,
        "title": "Too Cool For School"
      },
      {
        "number": 8,
        "title": "She Found Your Picture In My Phone"
      },
      {
        "number": 9,
        "title": "I Can Play the Game With You"
      },
      {
        "number": 10,
        "title": "Songs For the Ladies"
      },
      {
        "number": 11,
        "title": "See the Night"
      },
      {
        "number": 12,
        "title": "This Ain’t No Lullabye"
      }
    ],
    "credits": "Recorded, mixed, and mastered by Mike Quinn at the Moontower, Davis Square, Somerville, MA. at Q Division\n\nDan London - lead vocals, harmonies, guitars, bass, Mtron, mandolin (9), banjo (9)\nWill Dickson - drums (all songs but 3 and 11)\nKurt von Stetten - drums (3, 11), tambourine, cowbell (1, 10), cello (5), washboard (8), harmonies (1), shaker (2, 6), keys (5), guiro (6)\nBrandon Comstock - guitars (3, 7), guitar solo (3), harmonies (3, 12)\nLew London - mandolin (9)\nMike Quinn - harmonies (1, 2, 3, 12)\n\nAll songs written by Dan London © 2014 | Published by Drunken Ballerina Music / SESAC\n\nDesign by Alexander S. Budnitz",
    "press": [],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": [
      {
        "id": "642",
        "title": "Dan London makes best of 2014 on the Americana Rock Soundoff!",
        "date": "2015-01-07",
        "excerpt": "Our pal Von has included Dan London on his best of 2014 edition of the Americana Rock Soundoff !. It's a great collection of music and we're proud Dan made the cut. Give a listen and check out Dan's l"
      },
      {
        "id": "604",
        "title": "Dan London's \"I Will Take You Back\" to be released Tuesday, 11/18",
        "date": "2014-11-03",
        "excerpt": "We're proud to announce that Longwalls bassist Dan London will release his second solo effort— I Will Take You Back —on Tuesday, November 18. With songs written during a time and place spanning from N"
      },
      {
        "id": "490",
        "title": "Much new music on the way!",
        "date": "2014-06-30",
        "excerpt": "Making making making. That's what we do! Here's the latest... The new Longwalls album, tentatively titled The Gold Standard, is nearing completion. 11 songs (!) are in the hopper over at Bridge Sound "
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3469207098/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://danlondon.bandcamp.com/album/i-will-take-you-back\">I Will Take You Back by Dan London</a></iframe>"
  },
  {
    "name": "Into the Safety of the Alley",
    "artist": "Kurt von Stetten",
    "slug": "into-the-safety-of-the-alley",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2010-04-01",
    "catalogNumber": "SMR009-3",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/into-the-safety-of-the-alley.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan's Smashing Life"
    },
    "description": "Kurt's 3rd release, Several Hours and Ghosts and Demons were mainstays of early Drama Queens' sets, No Game too. Lots of good home-brewed fuzz-rock. Kurt plays every instrument on every track, per usual. You know the drill. Available for free download.",
    "tracks": [
      {
        "number": 1,
        "title": "Several Hours"
      },
      {
        "number": 2,
        "title": "No Game"
      },
      {
        "number": 3,
        "title": "Beer Store"
      },
      {
        "number": 4,
        "title": "Aeroplanes"
      },
      {
        "number": 5,
        "title": "Bumblebees"
      },
      {
        "number": 6,
        "title": "Indy Comic Scenes"
      },
      {
        "number": 7,
        "title": "Ghosts and Demons"
      },
      {
        "number": 8,
        "title": "Tough Kids"
      },
      {
        "number": 9,
        "title": "A Rocket"
      },
      {
        "number": 10,
        "title": "He Had a Job"
      },
      {
        "number": 11,
        "title": "Bomb Wildly"
      },
      {
        "number": 12,
        "title": "Nostalgia"
      }
    ],
    "credits": "Kurt von Stetten - everything",
    "press": [],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "81",
        "title": "Classic Kurt!",
        "date": "2009-09-05",
        "excerpt": "Kurt von Stetten's Tree and Into the Safety of the Alley available now for free download!"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=466923479/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/into-the-safety-of-the-alley\">Into the Safety of the Alley by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Kowloon",
    "artist": "The Longwalls",
    "slug": "kowloon",
    "artistSlug": "the-longwalls",
    "releaseDate": "2012-10-30",
    "catalogNumber": "SMR004",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/kowloon.jpg",
    "featuredQuote": {
      "text": "The Longwalls evoke wintry discontent and hope springing eternal within the walls of their latest album, Kowloon... a lovely novella of an album.",
      "source": "The Owl Mag"
    },
    "description": "In Hong Kong there was once a walled city, Kowloon. An ungoverned 6-acre city within a city, home to 33,000 people. Urban density and decay in overdrive. A crush of tiny apartments. Trash and running water in the streets. Rare pools of light.\n\nYet life maintained. Amidst the darkness and back-alley operators. Against the cold stone, ash, and dust. An embodiment of the unplanned and unchecked, a mix of pessimism and isolationism, a Kowloon can grow within the mind before you know it. Twenty teetering stories of paralyzing uncertainty walled off from rational thought.\n\nKowloon was eventually demolished; a peaceful park of scenic gardens quietly rest in its place. Life maintains.\n\nKowloon is The Longwalls' 3rd release in as many years. It was recorded entirely on their own in their rehearsal space and home studios.",
    "tracks": [
      {
        "number": 1,
        "title": "Vaasa"
      },
      {
        "number": 2,
        "title": "Big MT"
      },
      {
        "number": 3,
        "title": "Long for Shipwrecks"
      },
      {
        "number": 4,
        "title": "Liberty Bell"
      },
      {
        "number": 5,
        "title": "Woods Pretty"
      },
      {
        "number": 6,
        "title": "Kowloon"
      },
      {
        "number": 7,
        "title": "Maybe Golden"
      },
      {
        "number": 8,
        "title": "Bring me Peace"
      }
    ],
    "credits": "Alan Wuorinen – vocals, acoustic guitar, upright bass, pedal steel, synths\nKurt von Stetten – drums, cello, hand percussion, synths, backing vocals\nDan London – bass, acoustic guitar, mandolin, backing vocals (lead on \"Bring me Peace\")\nBrandon Comstock – electric guitar, acoustic guitar, banjo, synths, backing vocals (lead on \"Shipwrecks\" and \"Woods Pretty\")\n\nSongs by Alan (BMI); \"Shipwrecks\" and \"Woods Pretty\" by Brandon (BMI); \"Bring me Peace\" by Dan (SESAC).\nMusic by The Longwalls.\n\nProduced & Enginnered by Kurt von Stetten and The Longwalls at Arlington Music Studios and the Beat Dojo\nMixed by Owen Curtin with Marly Carre at Bridge Sound and Stage\nMastered by Eric Baird at Half Son of Audio\nDesign by Alex Budnitz",
    "press": [
      {
        "text": "These songs soar and crash with astonishing grace... The power is unmistakable.",
        "source": "Aiding & Abetting",
        "url": null
      },
      {
        "text": "The Longwalls evoke wintry discontent and hope springing eternal within the walls of their latest album, Kowloon... a lovely novella of an album.",
        "source": "The Owl Mag",
        "url": null
      },
      {
        "text": "The Longwalls have created a solid album that treats melancholy with a bit of twang, a pinch of grunge and a ton of heart.",
        "source": "mxdwn",
        "url": null
      },
      {
        "text": "The Longwalls capture the sound of a dusty repetitious highway and the lonely poetic spirit of adventure.",
        "source": "Mojophenia",
        "url": null
      },
      {
        "text": "At once unsettling, melancholic, and peaceful. Indeed, as the listener reaches the final track a feeling of tranquility has already been delivered.",
        "source": "Boston Music Vibe",
        "url": null
      },
      {
        "text": "Their honest folk music involved a lot of depth.",
        "source": "Golden Mixtape",
        "url": null
      },
      {
        "text": "A mix of guitar twang and noise pop.",
        "source": "Indies and the Underground",
        "url": null
      },
      {
        "text": "Maybe it’s growing up, maybe its early onset seasonal affective disorder, but on Kowloon, guitars fuzz, vocals reverb ever so slightly, and the songs can take a bit more of an introspective feel. Sonically, it is a sharp sound that sounds like a great direction for the band.",
        "source": "Music Savage",
        "url": null
      },
      {
        "text": "The Longwalls excel at mixing dissonance and tension in with hummable melodies. In that regard, they live somewhere between a more rustic Velvet Underground and a less new-post-punk the National.",
        "source": "The Noise (scroll)",
        "url": null
      },
      {
        "text": "Boston rock band The Longwalls wrote an entire EP inspired by Kowloon, the area from Hong Kong where I am from. Their inspiration came from way way back when Kowloon was a walled city. How they managed to do that, I don’t know.",
        "source": "Panic Manual",
        "url": null
      },
      {
        "text": "The band masterfully blends traditional folk instruments and music with a modern style of synth usage, sound modulation, and atmospheric noise dynamics that is really quite impressive and pleasing to the ears.",
        "source": "Red Line Roots",
        "url": null
      },
      {
        "text": "This collection of songs should be enjoyed by a wide audience. I hope the Longwalls are discovered outside of their New England home base.",
        "source": "Twangville",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": "https://soundcloud.com/bostonemissions/bostonemissions-1",
    "youtubePlaylist": "PLC0FDEE6035936214",
    "relatedPosts": [
      {
        "id": "931",
        "title": "Live video. Kind words. Alan represents The Longwalls at Outlaw Roadshow 2016 this past fall in NYC.",
        "date": "2016-12-21",
        "excerpt": "Well ain't this a hum-dinger! Alan opens up with \"Sargasso in Space\" off The Longwalls ' classic 2012 EP, Careers in Science ; follows it up with a tease from the band's forthcoming 6th release with ("
      },
      {
        "id": "284",
        "title": "More love for The Longwalls' Kowloon!",
        "date": "2013-03-25",
        "excerpt": "\" Masterfully blends traditional folk instruments and music with a modern style .\" More very kind words on The Longwalls ' Kowloon -- this time from the new Red Line Roots blog !"
      },
      {
        "id": "280",
        "title": "Kowloon rolls on...",
        "date": "2013-01-31",
        "excerpt": "A full-moon-sized thank you to everyone who trekked out in the cold Saturday for The Longwalls ' Kowloon release show. Epic night. Much love. We won't soon forget. Meanwhile, kind words on Kowloon con"
      },
      {
        "id": "277",
        "title": "Busy times in Static Motor land!",
        "date": "2013-01-18",
        "excerpt": "No rest.. we've got The Longwalls CD release show for Kowloon coming up Saturday, January 26! We've also got the release of Kurt von Stetten's new one, Androlafi , coming up Tuesday, February 19th. In"
      },
      {
        "id": "271",
        "title": "Love of Kowloon from... Kowloon!",
        "date": "2012-12-11",
        "excerpt": "We never thought someone born in Kowloon would ever hear the new Longwalls record . Small world, and we're glad the music found him. Thanks to the Ricky from the Panic Manual for his post and recollec"
      },
      {
        "id": "273",
        "title": "The Longwalls' Kowloon featured on Boston Emissions",
        "date": "2012-12-11",
        "excerpt": "Big thanks to Anngelle Wood and Boston Emissions for featuring The Longwalls ' Kowloon Sunday night (alongside old pals The Beatings and Black Helicopter ). Stream to the first hour , and check out th"
      },
      {
        "id": "275",
        "title": "More praise for The Longwalls' Kowloon.",
        "date": "2012-12-11",
        "excerpt": "\"The Longwalls have created a solid album that treats melancholy with a bit of twang, a pinch of grunge and a ton of heart.\" That's what the fine folks at mxdwn have to say about the new Longwalls rec"
      },
      {
        "id": "269",
        "title": "We love owls, and The Owl Mag loves Kowloon",
        "date": "2012-12-05",
        "excerpt": "\" The Longwalls evoke wintry discontent and hope springing eternal within the walls of their latest album, Kowloon... a lovely novella of an album. \" That's how our friends at The Owl Mag describe Kow"
      },
      {
        "id": "264",
        "title": "Twangville loves the Longwalls",
        "date": "2012-11-27",
        "excerpt": "Big thanks to Twangville for these kind words on Kowloon , the new Longwalls record out 12/4. Over at Twangville they often say the Longwalls are deserving of much wider audience. We couldn't agree mo"
      },
      {
        "id": "266",
        "title": "More love for The Longwalls' Kowloon -- on sale today!",
        "date": "2012-11-27",
        "excerpt": "\" At once unsettling, melancholic, and peaceful. Indeed, as the listener reaches the final track a feeling of tranquility has already been delivered .\" That's what Boston Music Vibe had to say about K"
      },
      {
        "id": "262",
        "title": "Glowing early words on Kowloon!",
        "date": "2012-11-21",
        "excerpt": "Early reviews are in, and The Longwalls ' latest effort Kowloon seems to be hitting a chord. Our Music Savage writes, \" Sonically, it is a sharp sound that sounds like a great direction for the band. "
      },
      {
        "id": "260",
        "title": "CD release show for The Longwalls' Kowloon set: Saturday 26 January",
        "date": "2012-11-09",
        "excerpt": "It's a bit of a tradition around these parts-- CD release shows at the Lizard Lounge in Cambridge. We love that venue, we couldn't be happier The Longwalls are releasing Kowloon there Saturday 26 Janu"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1451702757/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/kowloon\">Kowloon by The Longwalls</a></iframe>"
  },
  {
    "name": "Live at The Bridge",
    "artist": "The Longwalls",
    "slug": "live-at-the-bridge",
    "artistSlug": "the-longwalls",
    "releaseDate": "2016-03-15",
    "catalogNumber": "SMR006",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/LongWallsLive_Cover_72_small-1.jpg",
    "featuredQuote": {
      "text": "One of the east coast's best pop acts.",
      "source": "Ryan's Smashing Life"
    },
    "description": "A free show. With free beer. And cookies. Friends gathered, old and new. A frigid night in early March 2015 towards the end of Boston’s winter from hell. On the stage where it where it was recorded, The Longwalls played three sets in celebration of the release of their fifth album, Gold Standard. A set of mostly new material was followed by a mini-set of acoustic songs from their first two releases (Field Guide for the Zombie Survivalist and Dark Academy), before the band closed things out with a set of material culled from the classic EPs Careers in Science and Kowloon. There’s nothing quite like a small room filled with music and friends. We tried our best to capture the spirit of the night with this selection of 10 tracks from the show. Download for free and check out the video on YouTube.\n\nEnjoy!",
    "tracks": [
      {
        "number": 1,
        "title": "Careers in Science | Careers in Science, 2011"
      },
      {
        "number": 2,
        "title": "Where Things Go To Fade | Careers in Science, 2011"
      },
      {
        "number": 3,
        "title": "Maybe Golden | Kowloon, 2012"
      },
      {
        "number": 4,
        "title": "Simple Thoughts | Gold Standard, 2015"
      },
      {
        "number": 5,
        "title": "Zombies! | Field Guide for the Zombie Survivalist, 2008"
      },
      {
        "number": 6,
        "title": "Ghosts | Dark Academy, 2010"
      },
      {
        "number": 7,
        "title": "Dark Academy | Dark Academy, 2010"
      },
      {
        "number": 8,
        "title": "Burger and Fries | Gold Standard, 2015"
      },
      {
        "number": 9,
        "title": "Rukia | Gold Standard, 2015"
      },
      {
        "number": 10,
        "title": "UFO | Careers in Science, 2011"
      }
    ],
    "credits": ":\n\nAlan Wuorinen - acoustic guitars, vocals\nDan London - bass, mandolin, vocals\nKurt von Stetten - drums, washboard, harmonica\nBrandon Comstock - electric and acoustic guitars, vocals\n\nWith Mike Quinn - keyboard (Rukia) and glockenspiel (Ghosts)\n\nLive audio and post production: Alex Allinson - The Bridge Sound and Stage\n\nVideographers: Alexander \"Z\" Hayes and Grace Deacon - The Bridge Sound and Stage\n\nVideo editing and post production: Alexander “Z” Hayes - The Bridge Sound and Stage\n\nTitle design: Alexander Budnitz\n\nTitle production: Ange Romanska\n\nThank you!\nOwen Curtin. Janos Arcitype Fulop, Alex Allinson, Alexander \"Z\" Hayes, And everyone at The Bridge Sound and Stage, Mike Quinn, Ryan Spaulding, Alexander Budnitz, WMBR, WEMF, Visions of the Unexcused, DigBoston, Redline Roots, MusicBoxPete, The Huntington News, Surviving the Golden Age, Laura, Ange, Leasa, Jen, Scott & Sarah.",
    "press": [
      {
        "text": "I was lucky enough to be present for this show. Beer was packed at the front of the stage from the still too high snow banks outside",
        "source": "and the mood inside was positively captivated – something this video, and the upcoming video series encapsulate wonderfully.\n— Visions of the Unexcused",
        "url": null
      },
      {
        "text": "The album rips right out of the gate with “Careers in Science” and a burning guitar riff firing over acoustic guitar. Next comes the anthemic “Where Things Go to Fade” with distorted guitars taking JUST the right breaks at just the right times. This is an example of well thought out arrangements played by a band that is tight as hell. The album continues from there with masterfully crafted indie rock tunes with just enough catchiness to have you hooked in tight but never veering into predictability. The highlight for me is “Dark Academy” about the impact of a local arcade on a youth looking for excitement and acceptance in the pre",
        "source": "internet age. If you are old enough to remember those times you’ll dig the hell out of this tune. I know I did. So I invite you to join me in listening to this awesome album. It’s name your price on bandcamp here but I would advise throwing them a few bucks. These guys don’t get nearly the recognition they deserve and I like to believe in a different time and place you’d be reading about them in Rolling Stone……and in that different time and place Rolling Stone is still cool and relevant.\n— Nine Bullets",
        "url": null
      },
      {
        "text": "Boston indie stalwarts, The Longwalls, have released a fine live album, recorded at their March performance at Boston club, The Bridge. The ten tracks are culled from the bands extensive catalog and showcase the band’s immense depth and originality. Live albums are, at best, difficult affairs that try to recreate the precision of recorded tracks, coupled with the spontaneity and energy of a live performance. This album does this with aplomb, transporting the listener to the front row of a great experience.",
        "source": "Floorshime Zipper Boots",
        "url": null
      }
    ],
    "bandcampUrl": "https://thelongwalls.bandcamp.com/album/live-at-the-bridge",
    "soundcloudPlaylist": "https://soundcloud.com/staticmotor/sets/the-longwalls-live-at-the-bridge",
    "youtubePlaylist": "wW2_b4NRBNw",
    "relatedPosts": [
      {
        "id": "931",
        "title": "Live video. Kind words. Alan represents The Longwalls at Outlaw Roadshow 2016 this past fall in NYC.",
        "date": "2016-12-21",
        "excerpt": "Well ain't this a hum-dinger! Alan opens up with \"Sargasso in Space\" off The Longwalls ' classic 2012 EP, Careers in Science ; follows it up with a tease from the band's forthcoming 6th release with ("
      },
      {
        "id": "854",
        "title": "More kind words on The Longwalls' \"Live at The Bridge\"",
        "date": "2016-01-28",
        "excerpt": "\"These guys don’t get nearly the recognition they deserve and I like to believe in a different time and place you’d be reading about them in Rolling Stone……and in that different time and place Rolling"
      },
      {
        "id": "847",
        "title": "Kinds words for The Longwalls' \"Live at The Bridge\"",
        "date": "2016-01-06",
        "excerpt": "The fine folks at Floorshime Zipper Boots have some nice very things to say about The Longwalls live album / video \" Live at The Bridge .\" \"Live albums are, at best, difficult affairs that try to recr"
      },
      {
        "id": "805",
        "title": "The Longwalls' \"Live at The Bridge",
        "date": "2015-12-23",
        "excerpt": "We're so very pleased to release the first Static Motor live album— The Longwalls Live at The Bridge —featuring 10 audio tracks and stellar black and white video. It was a special night for all who we"
      },
      {
        "id": "765",
        "title": "Video Premiere: The Longwalls – Zombies! – Live at The Bridge Sound and Stage",
        "date": "2015-10-30",
        "excerpt": "Big thanks to our pal Derek at Visions of the Unexcused for premiering the first video from The Longwalls - Live at The Bridge . The Longwalls classic track Zombies! gets the acoustic treatment here c"
      }
    ],
    "youtubeVideo": "Ixd24NKZKvY",
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=3280061942/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/live-at-the-bridge\">Live at The Bridge by The Longwalls</a></iframe>"
  },
  {
    "name": "Live On-Air '01-'05",
    "artist": "Gatsby",
    "slug": "live-on-air-01-05",
    "artistSlug": "gatsby",
    "releaseDate": "2013-06-01",
    "catalogNumber": "SMR019",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/live-on-air-01-05.png",
    "featuredQuote": {
      "text": "Gatsby play FAST!",
      "source": "The Noise"
    },
    "description": "\"Do whatever you want, tape is rolling.\" That's Joel Simches through the headphones way back in June 2003. I remember it being incredibly hot in WMFO's Studio Dee that night. But it didn't matter. After going through a few growing pains the previous year we were really hitting our stride as a band. We had just released the Five Songs EP to a sold out show at the Lizard Lounge and our ability to blaze through 3-minute powerpop—shoe horning in a whole lot of chaos along the way—was earning us some love. We had turned a corner and our best days as a band were still ahead of us. Those were the salad days, and the performances from that night are particularly bright.\n\nWe were a bit of an anomaly live. As we were fond of saying back then, it always seemed we were \"too pop for the punk bills, and too punk for the pop bills.\" And we played r-e-a-l-l-y fast, and were sometimes prone to the \"yips.\" Lots of nervous energy I suppose (among other things). So, playing live was always a bit of an adventure for us, which is what made it so interesting to go back through old DATs and CDs to pull this collection together in honor of the 10th anniversary of our first show—November 1, 2001 at the old Mobius artists space in Fort Point. Wow, ten years.\n\nThe collection goes as far back as late 2001—just weeks after that first Mobius show—when Alan and I returned to Hartford (where we had gone to college) to do a couple radio interviews and tape an acoustic performance for our friend Helder Mira's public access TV show. How She Is was just released on our very first EP, and Paint was still a work in progress. The 2003 WMFO recording demonstrates what two more years of 2x a week rehearsals and some 50 shows can do for a band. The performances on Pretend, No View, Holding up a Line, and Cereal Bride are intense and spirited. Joel did a great job mixing this set live on the air; you can really hear the band at work.\n\nFast forward another couple years to May 2005 and you hear a band that's even more intense, and perhaps a bit more cynical (gone were songs about girls!!). We'd just spent the better part of a year recording the Floods + Fires album and were in the midst of a 10-day span that would see our final 3 performances: an acoustic set on WAAF's Bay State Rock, the release show for Floods + Fires at the Lizard Lounge, and a return to WMFO's Studio Dee. With the exception of Snakes and It's All My Fault, all the songs from the May '05 sets are unreleased tracks that would have been the core of the next Gatsby record. Yards has always been a favorite of mine, and the performances on Poor Juliet (our standard set-opener by that time) and Type and Pipe are pretty bombastic (the guitars on Poor Juliet, the drums and bass on Type and Pipe.. when we were good, we were good). And of course ending with Coal Miner, as we often did in those days, is an appropriate way to close things out. I love this particular batch of songs, and regret them never seeing the light of day on a proper Gatsby record. These performances, from our very last as a band, will have to do (of course, we're open to lucrative offers...).\n\nSo here we are, as we were, flubs and all.\n\nIt was a hell of a journey. Thank you for listening.\n\nbrandon\n\n30 October 2011",
    "tracks": [],
    "credits": null,
    "press": [
      {
        "text": "Gatsby play FAST! Last time I saw them I thought of The Feelies, but this time I’m getting more Husker Du: the passionate delivery, the shouted harmonies, and the pleasant, melodic double",
        "source": "time assault. There are two guitarists, so one can always be strumming away, very fast, while the other provides restrained, tasty leads. They have, apparently, exactly one slower song, a beauty of a mid-tempo rocker and a welcome opportunity to breathe.\n— The Noise",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": [],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1379393282/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://gatsby.bandcamp.com/album/do-whatever-you-want-tape-is-rolling-gatsby-live-on-air-2001-2005\">Do Whatever you Want, Tape is Rolling: Gatsby Live On-Air 2001-2005 by Gatsby</a></iframe>"
  },
  {
    "name": "Pyramid",
    "artist": "Kurt von Stetten",
    "slug": "pyramid",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2011-04-01",
    "catalogNumber": "SMR010",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/pyramid.jpg",
    "featuredQuote": {
      "text": "12 tracks of lusciously catchy '90s",
      "source": "dosed indie-pop.\n— Boston Globe"
    },
    "description": "Think about the Pyramid!! One main idea with many (logically organized?) supporting elements. A mosaic. It's a structure for life, art, and one hell of a new album by Kurt von Stetten.\n\nPer usual, Kurt plays every instrument on the record, including cello, guitar, bass, xylophone, drums, washboard, keys/synth, and a variety of children’s toys, noise makers, and hand percussion. And this time, Kurt got some production help--making it his most sonically dynamic effort to date. Headphones, kids. Headphones.",
    "tracks": [
      {
        "number": 1,
        "title": "Words"
      },
      {
        "number": 2,
        "title": "Aioki"
      },
      {
        "number": 3,
        "title": "Slave"
      },
      {
        "number": 4,
        "title": "Come Correck"
      },
      {
        "number": 5,
        "title": "Love Song"
      },
      {
        "number": 6,
        "title": "1st Base"
      },
      {
        "number": 7,
        "title": "Pangea"
      },
      {
        "number": 8,
        "title": "Radical Son"
      },
      {
        "number": 9,
        "title": "Look Around"
      },
      {
        "number": 10,
        "title": "Nature"
      },
      {
        "number": 11,
        "title": "Revenge"
      },
      {
        "number": 12,
        "title": "Sea Hag"
      }
    ],
    "credits": "Kurt von Stetten: cello, guitar, bass, xylophone, drums, washboard, keys/synth, and a variety of children’s toys, noise makers, and hand percussion.\n\nEngineered it Kurt. Mixed by Owen Curtin (The Bridge Sound and Stage). Mastered by Mike Quinn (Moontower).",
    "press": [
      {
        "text": "12 tracks of lusciously catchy ’90s",
        "source": "dosed indie-pop.\n— Boston Globe",
        "url": null
      },
      {
        "text": "A gifted creator… New England’s top new talent… The man wears his heart on his sleeve and much of the magic ends up on the records here. Pyramid offers up more digestible indie pop with dissonant border skirmishes here and there…. New England has a prolific genius on its hands and his name is Kurt von Stetten.",
        "source": "Ryan’s Smashing Life (Best of 2011)",
        "url": null
      },
      {
        "text": "It feels kind of old school",
        "source": "Malkmus-y, but only if Malkmus played EVERY SINGLE INSTRUMENT!\n— Perfect Porridge",
        "url": null
      },
      {
        "text": "A fantastic example of an amazing, talented guy who seems to have no limits to what he can do.",
        "source": "Music Savage",
        "url": null
      },
      {
        "text": "There’s been a musical force hiding in Boston that has been making some of the most unique and creative music over the past decade.",
        "source": "Dysonsound",
        "url": null
      },
      {
        "text": "Medium",
        "source": "fi indie-rock illustrated with lots of personal love and instrumental colour.\n— Ride the Tempo",
        "url": null
      },
      {
        "text": "On his latest album, Pyramid, he crafted some truly great indie rock songs and goes to show that even relatively unknown artists can create something with a great sound.",
        "source": "Oh So Fresh Music",
        "url": null
      },
      {
        "text": "Kurt von Stetten crafts a musical wonder with his latest, Pyramid.",
        "source": "American Chronicle",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "254",
        "title": "Kurt von Stetten is... 16 & Pregnant?!?",
        "date": "2012-05-09",
        "excerpt": "That's right folks. Our own Kurt von Stetten was featured on last night's episode of MTV's 16 & Pregnant . We told him to use protection. Ha! I funny! What we mean to say is Kurt's song Pangaea —off h"
      },
      {
        "id": "244",
        "title": "Best of 2011 for KvS' Cyclops *and* Pyramid!",
        "date": "2012-01-20",
        "excerpt": "Kurt von Stetten's Cyclops has made into a couple of stellar \"best of\" lists for 2011. Ryan's Smashing Life included both Cyclops and Pyramid on his list and called Kurt a \"gifted creator\" and a \"prol"
      },
      {
        "id": "199",
        "title": "Even more love for Kurt von Stetten's Pyramid",
        "date": "2010-12-16",
        "excerpt": "Our pal Kyle over at Music Savage calls Kurt von Stetten's Pyramid \"a fantastic example of an amazing, talented guy who seems to have no limits to what he can do\". Kyle is a whole lot smarter than us,"
      },
      {
        "id": "197",
        "title": "The Kids Love Kurt von Stetten's Pyramid!!!",
        "date": "2010-12-15",
        "excerpt": "People are discovering what we've known all along—our own Kurt von Stetten has made a hella great new album. Check out what these fine folks have to say about Pyramid : RidetheTempo | Oh So Fresh! | P"
      },
      {
        "id": "195",
        "title": "WMBR spins Aioki!",
        "date": "2010-12-10",
        "excerpt": "Our pals from WMBR's Pipeline kicked off last night's show with Aioki off Kurt Von Stetten's new album, Pyramid . Radio gold kids, radio gold. Stream the whole show here ."
      },
      {
        "id": "193",
        "title": "The reviews are in for \"Pyramid\"!!",
        "date": "2010-11-19",
        "excerpt": "The reviews are in for Pyramid ! Well, the first one anyway. Our pal over at Dysonsound has given Pyramid one hell of a nice writeup. He knows way more about music than we do, so we'll all take him at"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=949652847/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/pyramid\">Pyramid by Kurt von Stetten</a></iframe>"
  },
  {
    "name": "Red Shirts",
    "artist": "The Longwalls",
    "slug": "red-shirts",
    "artistSlug": "the-longwalls",
    "releaseDate": "2019-03-26",
    "catalogNumber": "SMR007",
    "formats": [
      "CD",
      "Digital"
    ],
    "coverImage": "assets/images/albums/red-shirts.png",
    "featuredQuote": {
      "text": "One of the more bullshit",
      "source": "free bands making music over the past decade-plus,— Vanyaland"
    },
    "description": "Red Shirts is The Longwalls’ first full-length studio effort since 2015’s Gold Standard.\nSome of these songs were demo’d nearly 15 years ago when the band was first getting started. Some were floating around in heads for nearly as long but never quite materialized. Some were written while the album was being recorded in the studio Brandon built in the basement of his home in Jamaica Plain, MA.\nOne of these songs is about strange disappearances of men around Boston. One of these songs is about feeling passed by. One of these songs claims to know the truth about Billy Shears.\nAll of these songs were tracked by the band on their own, an approach they took with their 2008 debut as well as 2012’s much beloved Kowloon. All of these songs were slated for release nearly two years ago. Short-run, lathe-cut vinyl was produced from the original mixes by Brandon and Kurt in mid 2019. The band played the Jamaica Plain Music Festival.\nBut then things got complicated, and the album was put on ice. After a while a certain restlessness took root. Sonic freezer burn had set in and all these songs needed to somehow sound fresh again. And they do, thanks to a new set of mixes by Benny at Mad Oak Studios.\nNow, all these songs are both old and new. Both pre- and nearly post. And long overdue.",
    "tracks": [
      {
        "number": 1,
        "title": "Red Shirts"
      },
      {
        "number": 2,
        "title": "Parts Per Billion"
      },
      {
        "number": 3,
        "title": "American Easterner"
      },
      {
        "number": 4,
        "title": "Last One"
      },
      {
        "number": 5,
        "title": "Open Your Heart"
      },
      {
        "number": 6,
        "title": "Planes Overhead"
      },
      {
        "number": 7,
        "title": "Buried"
      },
      {
        "number": 8,
        "title": "18 and Over"
      },
      {
        "number": 9,
        "title": "Please Be Good to Me"
      },
      {
        "number": 10,
        "title": "Toothache"
      }
    ],
    "credits": "Alan Wuorinen - vocals, acoustic guitar\nKurt von Stetten - drums, cello, synths, percussion\nDan London - bass, acoustic guitar, backing vocals (lead on “heart“)\nBrandon Comstock - electric guitars, backing vocals (lead on “planes”)\n\nSongs by Alan (BMI); “planes” by Brandon (BMI); “heart” by Dan (SESAC); Jennifer Comstock played some piano on “18”\n\nMusic by The Longwalls\n\nEngineered by The Longwalls at Arlington Music Studios and The Bunker\n\nLathe cut vinyl release mixed by Brandon Comstock and Kurt von Stetten; Mastered for vinyl by Mike Quinn\n\nDigital release mixed and mastered by Benny Grotto at Mad Oak Studios",
    "press": [
      {
        "text": "On their new album, their first studio effort since 2015’s Gold Standard, they showcase why they’re one of the more bullshit",
        "source": "free bands making music over the past decade-plus, and Red Shirts certainly has the songs and pop harmonies that stretch back and dot all those years. — Vanyaland",
        "url": null
      }
    ],
    "bandcampUrl": "https://thelongwalls.bandcamp.com/album/red-shirts",
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC0FDEE6035936214",
    "relatedPosts": [
      {
        "id": "1007",
        "title": "Well, well, well... new record by The Longwalls out today!",
        "date": "2021-05-28",
        "excerpt": "Well hello there! Been a minute... for all of us. Suffice to say this new Longwalls record — Red Shirts — was ready to go a while back, but then things got complicated. As such, there's a version feat"
      },
      {
        "id": "1000",
        "title": "New Longwalls Coming soon...",
        "date": "2021-03-31",
        "excerpt": ""
      },
      {
        "id": "980",
        "title": "New Longwalls music for the 8th Annual JP Music Fest!",
        "date": "2018-09-05",
        "excerpt": "For your listening pleasure, 2 new tracks from the upcoming Longwalls album entitled Red Shirts . Keep an eye out for an album release in early 2019. And for those who can make it to the JP Music Fest"
      },
      {
        "id": "969",
        "title": "Wow, it's been a minute. But things be percolatin'",
        "date": "2018-08-24",
        "excerpt": "Hey there! Been a while. Wow. Well, we'll have you know we've been keepin' on with the keepin' on. Here's what's up. For those following along at home, you know it's about time for the annual Kurt von"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=892155279/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://thelongwalls.bandcamp.com/album/red-shirts\">Red Shirts by The Longwalls</a></iframe>"
  },
  {
    "name": "The Amy Single",
    "artist": "Gatsby",
    "slug": "the-amy-single",
    "artistSlug": "gatsby",
    "releaseDate": "2004-01-01",
    "catalogNumber": "SMR020",
    "formats": [
      "CD"
    ],
    "coverImage": "assets/images/albums/the-amy-single.png",
    "featuredQuote": {
      "text": "There is something special about Gatsby.",
      "source": "Northeast Performer"
    },
    "description": "Recorded in one day with Mike Quinn at Moontower Studio, these are the first Gatsby recordings as a four-piece. Released as a 7\" on blue vinyl, this session finds the band turning a corner, becoming more honed and more focused. A follow-up session would yield three more songs and together would released as the \"Five Songs\" EP at a sold out release show at the Lizard Lounge. If it's possible for band that was only around for 6 years to have \"salad days,\" well, these would probably be it.",
    "tracks": [
      {
        "number": 1,
        "title": "Amy"
      },
      {
        "number": 2,
        "title": "Pretend"
      }
    ],
    "credits": "Jay Figueroa - guitars\nScott Robinson - drums\nBrandon Comstock - guitars, vocals\nAlan Wuorinen - vocals, bass\n\nRecorded, mixed and mastered with Mike Quinn at Moontower Studio, Cambridge.",
    "press": [
      {
        "text": "There is something special about Gatsby. From the lyrics to the guitars to the rhythms, there is something both familiar and unique about this band.",
        "source": "Northeast Performer",
        "url": null
      }
    ],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": null,
    "relatedPosts": []
  },
  {
    "name": "Tree",
    "artist": "Kurt von Stetten",
    "slug": "tree",
    "artistSlug": "kurt-von-stetten",
    "releaseDate": "2010-04-01",
    "catalogNumber": "SMR009-4",
    "formats": [
      "Digital"
    ],
    "coverImage": "assets/images/albums/tree.jpg",
    "featuredQuote": {
      "text": "New England has a prolific genius on its hands and his name is Kurt von Stetten.",
      "source": "Ryan's Smashing Life"
    },
    "description": "Kurt's first album. Well, the earliest one we know about anyway; what lurks in the dark corners of his musical past is really anyone's guess. Anyway..Bore is loud, Bachelor is deep, 1000 lbs is super dreamy, and all were in the Drama Queens set at one point or another. Available for free download.",
    "tracks": [],
    "credits": null,
    "press": [],
    "bandcampUrl": null,
    "soundcloudPlaylist": null,
    "youtubePlaylist": "PLC98736F4D4BC2E30",
    "relatedPosts": [
      {
        "id": "81",
        "title": "Classic Kurt!",
        "date": "2009-09-05",
        "excerpt": "Kurt von Stetten's Tree and Into the Safety of the Alley available now for free download!"
      }
    ],
    "bandcampEmbed": "<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1710767013/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=none/transparent=true/\" seamless><a href=\"https://kurtvonstetten.bandcamp.com/album/tree\">Tree by Kurt von Stetten</a></iframe>"
  }
]