[
  {
    "id": 40,
    "title": "Broken but not undone",
    "slug": "broken-but-not-undone",
    "description": "DIY doesn't carry the same allure and integrity it once did. With the technology at hand, any kid can make a crisp, professional recording. What we've lost is a warts and all ethos, and an intangible passion that comes only from real instrumentation, coated with blood and sweat, and maybe a few tears. Enter the world of DIY practitioner Kurt von Stetten.\n\nThe sounds, textures, and nuances on Broken, But Not Undone are 100% von Stetten. While he's always done his own instrumentation, von Stetten had the last three records professionally mixed and mastered. On Broken, there's nowhere to hide, and the results may not be technically flawless, but it's the way von Stetten wants you to hear it. \"I really tried to just play with sound on a lot of these songs,\" recalls von Stetten. \"I know that I mix incorrectly and that I do not know what I am doing sonically but this is the way I hear them.\" The result is a gloriously chaotic, beautiful trip into the psyche of one of today's great unsung artists.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Those that Know</li>\n\t<li>Tooahyaysay</li>\n\t<li>Cashier Girls</li>\n\t<li>Bucky Fuller</li>\n\t<li>Slime</li>\n\t<li>Age of No</li>\n\t<li>Nature is a ride or die bitch</li>\n\t<li>Competition (Fuck Bob Pollard)</li>\n\t<li>Song for a Phobic, part 3</li>\n\t<li>Sally Dear</li>\n\t<li>Nickname: Cowboy Shit</li>\n\t<li>Her First Crew</li>\n</ol>\nCredits\n\nWords and music: Kurt von Stetten (BMI)\nInstrumentation: Kurt von Stetten: guitar, vocals, cello, keys, drums/percussion, and bass\nEngineered &amp; mixed: Kurt von Stetten\nMastered: (Vinyl) Mike Quinn (Moontower) at Q Division Studios / (CD) Kurt von Stetten\nDesign: Kurt von Stetten",
      "release_date": "20131119"
    }
  },
  {
    "id": 42,
    "title": "The Amy Single",
    "slug": "the-amy-single",
    "description": "Recorded in one day with Mike Quinn at Moontower Studio, these are the first Gatsby recordings as a four-piece. Released as a 7\" on blue vinyl, this session finds the band turning a corner, becoming more honed and more focused. A follow-up session would yield three more songs and together would released as the \"Five Songs\" EP at a sold out release show at the Lizard Lounge. If it's possible for band that was only around for 6 years to have \"salad days,\" well, these would probably be it.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Amy</li>\n\t<li>Pretend</li>\n</ol>\nCredits\n\nJay Figueroa - guitars\nScott Robinson - drums\nBrandon Comstock - guitars, vocals\nAlan Wuorinen - vocals, bass\n\nRecorded, mixed and mastered with Mike Quinn at <a href=\\\"http://www.moontowerstudio.com/\\\" target=\\\"_blank\\\">Moontower Studio</a>, Cambridge.",
      "release_date": "20030408"
    }
  },
  {
    "id": 41,
    "title": "Androlafi",
    "slug": "androlafi",
    "description": "The term \"bedroom project\" carries numerous pejorative connotations, namely lo-fi, half-baked experimentation. But in the world of Kurt von Stetten, the bedroom is merely ground zero for songs that transcend time and genre. Harnessing von Stetton's love of early 90s indie rock (think Pavement, Sebadoh and early Modest Mouse) interweaved with his own insecurities, fears and passions, von Stetton's seventh solo outing Androlafi is his most accomplished and self-assured, a record that proudly stands alongside DIY revisionists Kurt Vile and Ty Segall, and also the seminal 90s output of his heroes.\n\nThe themes of Androlafi (aka Witches) are conjured from von Stetten's obsession with gothic folklore and the eternally frightening cautionary tales told to children. \"I think that most of these songs reference fear and how people deal with fear,\" explains von Stetten. \"Many of the songs are based on the stories my mother and father told me about their childhood and the stories that were told to them. These stories were fun and fantastic, but meant to mask great anxieties. Fear is a powerful motivator and the impetus for a lot of beauty.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "release_date": "20130209"
    }
  },
  {
    "id": 43,
    "title": "Five Songs",
    "slug": "five-songs",
    "description": "The quick follow-up to the Amy Single. Holding up a Line and Donna were recorded for the Vinyl Ritchie Compilation disc, and Moderator (a song with Brandon on lead vox), was slotted in the middle to give the EP two distinct halves with re-mixed Pretend and Amy at the top.\n\nReleased in May 2003 at a sold-out release show at the Lizard Lounge in Cambridge, these recordings find Gatsby doing what it did best: blasting out frenetic pop with lots of hooks, guitars and harmonies.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Pretend</li>\n\t<li>Amy</li>\n\t<li>Moderator</li>\n\t<li>Donna</li>\n\t<li>Holding up a Line</li>\n</ol>\nCredits\n\nJay Figueroa - guitars\nScott Robinson - drums\nBrandon Comstock - guitars, vocals\nAlan Wuorinen - vocals, bass\n\nRecorded, mixed and mastered with Mike Quinn at <a href=\\\"http://www.moontowerstudio.com/\\\" target=\\\"_blank\\\">Moontower Studio</a>, Cambridge.",
      "release_date": "20030605"
    }
  },
  {
    "id": 44,
    "title": "Floods + Fires",
    "slug": "floods-fires",
    "description": "A more balanced affair than the Five Songs EP (2003), Floods + Fires is a dynamic set that pits Gatsby's penchant for noisy, double-time, indie-rock assaults against slower-tempo pop, quiet melodies, and hints of twang. In the end, Floods + Fires is about conflict and the energy that conflict creates...and ultimately takes away. Gatsby's only full-length--and ultimately its swan song, Floods + Fires earned significant critical praise from local, regional, and national reviewers, and found regular radio play on more than 100 stations throughout New England and beyond.\n\nDigital download includes two bonus tracks that we were stupid enough to leave off the CD. If you buy the CD we'll send 'em to you separately.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "release_date": "20050510"
    }
  },
  {
    "id": 45,
    "title": "Tree",
    "slug": "tree",
    "description": "Kurt's first album. Well, the earliest one we know about anyway; what lurks in the dark corners of his musical past is really anyone's guess. Anyway..Bore is loud, Bachelor is deep, 1000 lbs is super dreamy, and all were in the Drama Queens set at one point or another. Available for free download.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "release_date": "20051115"
    }
  },
  {
    "id": 46,
    "title": "Into the Safety of the Alley",
    "slug": "into-the-safety-of-the-alley",
    "description": "Kurt's 3rd release, Several Hours and Ghosts and Demons were mainstays of early Drama Queens' sets, No Game too. Lots of good home-brewed fuzz-rock. Kurt plays every instrument on every track, per usual. You know the drill. Available for free download.",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Several Hours</li>\n\t<li>No Game</li>\n\t<li>Beer Store</li>\n\t<li>Aeroplanes</li>\n\t<li>Bumblebees</li>\n\t<li>Indy Comic Scenes</li>\n\t<li>Ghosts and Demons</li>\n\t<li>Tough Kids</li>\n\t<li>A Rocket</li>\n\t<li>He Had a Job</li>\n\t<li>Bomb Wildly</li>\n\t<li>Nostalgia</li>\n</ol>\nCredits\n\nKurt von Stetten - everything",
      "release_date": "20081111"
    }
  },
  {
    "id": 47,
    "title": "Birds and Clouds",
    "slug": "birds-and-clouds",
    "description": "Kurt's home-made masterpiece Birds and Clouds, on blue vinyl. Pretty cool. A few of these songs are regulars in the Drama Queens live sets (I bet you can guess one of them), so if you like 'em, this is where you can get 'em. Available for free download!",
    "excerpt": "",
    "date": "2013-09-30",
    "meta": {
      "release_date": "20060314"
    }
  },
  {
    "id": 53,
    "title": "Kowloon",
    "slug": "kowloon",
    "description": "In Hong Kong there was once a walled city, Kowloon. An ungoverned 6-acre city within a city, home to 33,000 people. Urban density and decay in overdrive. A crush of tiny apartments. Trash and running water in the streets. Rare pools of light.\n\nYet life maintained. Amidst the darkness and back-alley operators. Against the cold stone, ash, and dust. An embodiment of the unplanned and unchecked, a mix of pessimism and isolationism, a Kowloon can grow within the mind before you know it. Twenty teetering stories of paralyzing uncertainty walled off from rational thought.\n\nKowloon was eventually demolished; a peaceful park of scenic gardens quietly rest in its place. Life maintains.\n\nKowloon is The Longwalls' 3rd release in as many years. It was recorded entirely on their own in their rehearsal space and home studios.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Vaasa</li>\n\t<li>Big MT</li>\n\t<li>Long for Shipwrecks</li>\n\t<li>Liberty Bell</li>\n\t<li>Woods Pretty</li>\n\t<li>Kowloon</li>\n\t<li>Maybe Golden</li>\n\t<li>Bring me Peace</li>\n</ol>\nCredits\n\nAlan Wuorinen – vocals, acoustic guitar, upright bass, pedal steel, synths\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/wp-system/artists/kurt-von-stetten/\\\">Kurt von Stetten</a> – drums, cello, hand percussion, synths, backing vocals\n<a title=\\\"Dan London\\\" href=\\\"http://staticmotor.com/wp-system/artists/dan-london/\\\">Dan London</a> – bass, acoustic guitar, mandolin, backing vocals (lead on \\\"Bring me Peace\\\")\nBrandon Comstock – electric guitar, acoustic guitar, banjo, synths, backing vocals (lead on \\\"Shipwrecks\\\" and \\\"Woods Pretty\\\")\n\nSongs by Alan (BMI); \\\"Shipwrecks\\\" and \\\"Woods Pretty\\\" by Brandon (BMI); \\\"Bring me Peace\\\" by Dan (SESAC).\nMusic by The Longwalls.\n\nProduced &amp; Enginnered by Kurt von Stetten and The Longwalls at Arlington Music Studios and the Beat Dojo\nMixed by Owen Curtin with Marly Carre at <a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\">Bridge Sound and Stage</a>\nMastered by Eric Baird at <a href=\\\"http://halfsonofaudio.com/staff/\\\" target=\\\"_blank\\\">Half Son of Audio</a>\nDesign by <a href=\\\"http://abudnitz.com/\\\" target=\\\"_blank\\\">Alex Budnitz</a>",
      "release_date": "20121204"
    }
  },
  {
    "id": 54,
    "title": "Happy to See Me",
    "slug": "happy-to-see-me",
    "description": "Written over the course of several years in between Nashville and Boston, Happy to See Me is a record about changes——lots and lots of changes. A smart mix of Ray Davies and east coast cool, Happy to See Me is a midnight run through the trials and tribulations associated with becoming comfortable in one's own skin. Better late than never. The album is Dan's solo debut album, and features help from old friends Mike Quinn (Moontower / Q Division, and Kurt von Stetten.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Little Bit About Me</li>\n\t<li>Rock Stars</li>\n\t<li>Bold and the Beautiful</li>\n\t<li>Katherine Comes Along</li>\n\t<li>Flashlight In My Pocket</li>\n\t<li>Brooklyn Heights</li>\n\t<li>Special</li>\n\t<li>Gravity and Time</li>\n\t<li>Dirty Jokes</li>\n\t<li>The Wrong Place</li>\n\t<li>Jersey Devil</li>\n\t<li>Crazy Girls</li>\n\t<li>Oh Transylvania</li>\n</ol>\nCredits\n\n<a title=\\\"Dan London\\\" href=\\\"http://staticmotor.com/wp-system/artists/dan-london/\\\">Dan London</a>: Lead and Backing Vocals, Guitars, Bass, Mandolin, MTron\nWill Dickson: Drums\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/wp-system/artists/kurt-von-stetten/\\\">Kurt von Stetten</a>: Cello, Ukele, Washboard, Tambourine, Backing Vocals, Space Keys, Cowbell\nIlene Altman: Piano, Keys, Backing Vocals, Melodica\nMike Quinn: Wulitzer, Backing Vocals\n\n&nbsp;",
      "release_date": "20130212"
    }
  },
  {
    "id": 55,
    "title": "Cyclops",
    "slug": "cyclops",
    "description": "Diverging from the pop-centric sound of his last release Pyramid, the eclectic and intricate garage rock on Kurt von Stetten's Cyclops deals with fantasy and the fever of awesome ideas; everything from war to fashion. As with each of his releases, he relies on minimal story telling and the power of simple song structure...\n\nA man spends his whole life pretending to be a writer and as a result never has an authentic experience. A young couple tries to escape a war zone, but the two warring factions constantly try to force them to pick a side. A futuristic soldier rethinks his life while he is trapped in a fox hole, pinned down by enemy robot fire. An old boxer grows tired of hitting people and life. A father tells his son about his \"wild years\" and the son realizes that his father is really just a big pussy. A young man gives himself entirely over to fantasy and spends his days fighting a Cyclops and an Invisible Menace. An artist tries to communicate complex ideas through interpretive dance and realizes that, on some level, he must take into account the vernacular of the audience. A fisherman and his crew are bested by a whale and almost starve on the open water. After a man-made accident, a man and woman realize that they have super powers and after denying it they come to accept their awesome responsibility. An older office worker writes a graphic novel and after years of hiding it away starts showing it to people despite being terrified of criticism. A man realizes that scientific inquiry always has its risks- especially if society does not like what you discover. A man berates the hipsters on bikes blocking the sidewalk as he is trying to walk by the Middle East club... in Central Square.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "release_date": "20111213"
    }
  },
  {
    "id": 56,
    "title": "Live On-Air '01-'05",
    "slug": "live-on-air-01-05",
    "description": "\"Do whatever you want, tape is rolling.\" That's Joel Simches through the headphones way back in June 2003. I remember it being incredibly hot in WMFO's Studio Dee that night. But it didn't matter. After going through a few growing pains the previous year we were really hitting our stride as a band. We had just released the Five Songs EP to a sold out show at the Lizard Lounge and our ability to blaze through 3-minute powerpop—shoe horning in a whole lot of chaos along the way—was earning us some love. We had turned a corner and our best days as a band were still ahead of us. Those were the salad days, and the performances from that night are particularly bright.\n\nWe were a bit of an anomaly live. As we were fond of saying back then, it always seemed we were \"too pop for the punk bills, and too punk for the pop bills.\" And we played r-e-a-l-l-y fast, and were sometimes prone to the \"yips.\" Lots of nervous energy I suppose (among other things). So, playing live was always a bit of an adventure for us, which is what made it so interesting to go back through old DATs and CDs to pull this collection together in honor of the 10th anniversary of our first show—November 1, 2001 at the old Mobius artists space in Fort Point. Wow, ten years.\n\nThe collection goes as far back as late 2001—just weeks after that first Mobius show—when Alan and I returned to Hartford (where we had gone to college) to do a couple radio interviews and tape an acoustic performance for our friend Helder Mira's public access TV show. How She Is was just released on our very first EP, and Paint was still a work in progress. The 2003 WMFO recording demonstrates what two more years of 2x a week rehearsals and some 50 shows can do for a band. The performances on Pretend, No View, Holding up a Line, and Cereal Bride are intense and spirited. Joel did a great job mixing this set live on the air; you can really hear the band at work.\n\nFast forward another couple years to May 2005 and you hear a band that's even more intense, and perhaps a bit more cynical (gone were songs about girls!!). We'd just spent the better part of a year recording the Floods + Fires album and were in the midst of a 10-day span that would see our final 3 performances: an acoustic set on WAAF's Bay State Rock, the release show for Floods + Fires at the Lizard Lounge, and a return to WMFO's Studio Dee. With the exception of Snakes and It's All My Fault, all the songs from the May '05 sets are unreleased tracks that would have been the core of the next Gatsby record. Yards has always been a favorite of mine, and the performances on Poor Juliet (our standard set-opener by that time) and Type and Pipe are pretty bombastic (the guitars on Poor Juliet, the drums and bass on Type and Pipe.. when we were good, we were good). And of course ending with Coal Miner, as we often did in those days, is an appropriate way to close things out. I love this particular batch of songs, and regret them never seeing the light of day on a proper Gatsby record. These performances, from our very last as a band, will have to do (of course, we're open to lucrative offers...).\n\nSo here we are, as we were, flubs and all.\n\nIt was a hell of a journey. Thank you for listening.\n\nbrandon\n\n30 October 2011",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "release_date": "20111101"
    }
  },
  {
    "id": 57,
    "title": "Careers in Science",
    "slug": "careers-in-science",
    "description": "The Longwalls are serious about their science. “Careers” is their pulpy run at sci-fi triumph and failure—equal parts spaghetti western and 1950s futurism, pedal steel and 8-bit keyboard, failed missions in space, dystopian states of the body and mind, and phantom extra terrestrials that we may or may not have seen. It’s cold and dangerous in space; Careers in Science is the cosmonaut’s companion in the dark void between the stars.\n\nOne of science fiction’s greatest attributes is its ability to present incredibly relatable, even classic themes through a modern prism, and it’s the perfect vehicle for The Longwalls this time around. Family failure and feelings of inadequacy are way more fun if they happen in space! Still rooted in their own brand of Americana and post-pop, The Longwalls stretch their legs in the studio, head in new textural directions, and collaborate in songwriting like never before.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Careers in Science</li>\n\t<li>Where Things Go to Fade</li>\n\t<li>In the Cooler</li>\n\t<li>Sargasso in Space</li>\n\t<li>Homecoming</li>\n\t<li>Sex and Work</li>\n\t<li>King of Country</li>\n\t<li>UFO</li>\n</ol>\nCredits\n\nAlan Wuorinen – vocals, acoustic guitar, pedal steel, backing vocals, lonesome whistle\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/wp-system/artists/kurt-von-stetten/\\\">Kurt von Stetten</a> – drums, cello, hand percussion, “Cooler” space guitar &amp; “Eno” keys, backing vocals\nDan London – bass, backing vocals (lead on “Sex and Work”)\nBrandon Comstock – electric guitar, electric piano / 8-bit emulators, backing vocals (lead on “Fade” and “UFO”)\n\nSongs by Alan (BMI); \\\"Fade\\\" and \\\"UFO\\\" by Brandon (BMI); \\\"Sex and Work\\\" by Dan.\nMusic by The Longwalls. Trumpet on \\\"Careers\\\" by Damian David.\nProduced The Longwalls with Mike Quinn\nEngineered, mixed, and mastered by Mike Quinn (<a href=\\\"http://www.moontowerstudio.com/\\\" target=\\\"_blank\\\">Moontower</a>) at <a href=\\\"http://www.qdivision.com/\\\" target=\\\"_blank\\\">Q Division Studios</a>\nDesign by <a href=\\\"http://abudnitz.com/\\\" target=\\\"_blank\\\">Alex Budnitz</a>\n\n&nbsp;",
      "release_date": "20110301"
    }
  },
  {
    "id": 58,
    "title": "Pyramid",
    "slug": "pyramid",
    "description": "Think about the Pyramid!! One main idea with many (logically organized?) supporting elements. A mosaic. It's a structure for life, art, and one hell of a new album by Kurt von Stetten.\n\nPer usual, Kurt plays every instrument on the record, including cello, guitar, bass, xylophone, drums, washboard, keys/synth, and a variety of children’s toys, noise makers, and hand percussion. And this time, Kurt got some production help--making it his most sonically dynamic effort to date. Headphones, kids. Headphones.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Words</li>\n\t<li>Aioki</li>\n\t<li>Slave</li>\n\t<li>Come Correck</li>\n\t<li>Love Song</li>\n\t<li>1st Base</li>\n\t<li>Pangea</li>\n\t<li>Radical Son</li>\n\t<li>Look Around</li>\n\t<li>Nature</li>\n\t<li>Revenge</li>\n\t<li>Sea Hag</li>\n</ol>\nCredits\n\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/wp-system/artists/kurt-von-stetten/\\\">Kurt von Stetten</a>: cello, guitar, bass, xylophone, drums, washboard, keys/synth, and a variety of children’s toys, noise makers, and hand percussion.\n\nEngineered it Kurt. Mixed by Owen Curtin (<a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\">The Bridge Sound and Stage</a>). Mastered by Mike Quinn (<a href=\\\"http://www.moontowerstudio.com/\\\" target=\\\"_blank\\\">Moontower</a>).",
      "release_date": "20101116"
    }
  },
  {
    "id": 59,
    "title": "Dark Academy",
    "slug": "dark-academy",
    "description": "Both darker and more varied than their 2008 debut (Field Guide for the Zombie Survivalist),The Longwalls' second release is A 21-minute trip down memory lane with Guided By Voices, Wilco, and a stack of comic books along for the ride. Songs about families, friends, spirits, and A-bombs stalk a line between The Longwalls' love of big twang and classic American indie rock.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Playwrights</li>\n\t<li>Dark Academy</li>\n\t<li>Saturday</li>\n\t<li>Touchdown</li>\n\t<li>Ghosts</li>\n\t<li>Brave Arms</li>\n</ol>\nCredits\n\nAlan Wuorinen – vox, acoustic guitar, electric piano\nDan London – bass, backing vox (lead on \\\"Saturday\\\")\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/wp-system/artists/kurt-von-stetten/\\\">Kurt Von Stetten</a> – drums, cello, hand percussion\nBrandon Comstock – electric guitars, glockenspiel, backing vox (lead on \\\"Ghosts\\\")\n\nSongs by Alan Wuorinen (BMI) except \\\"Ghosts\\\" by Brandon (BMI) and \\\"Saturday\\\" by Dan. Music by The Longwalls.\n\nEngineered, mixed and mastered by Mike Quinn Moontower Studios (www.moontowerstudio.com) November 2009 - January 2010.\nArtwork by Steve Madden www.smadden.com.",
      "release_date": "20100323"
    }
  },
  {
    "id": 60,
    "title": "History",
    "slug": "history",
    "description": "History shows Kurt at his best, mixing and matching story-telling, mental picture-taking, and his favorite indie-rock memories. The result is a remarkably fresh, and often sweet, collection of tunes.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "release_date": "20090428"
    }
  },
  {
    "id": 61,
    "title": "Field Guide for the Zombie Survivalist",
    "slug": "field-guide-for-the-zombie-survivalist",
    "description": "The Longwalls' home-brewed debut, Field Guide for the Zombie Survivalist, is a cascading picture book of persons, places and things--living and undead. With cinematic songs about redheads, zombies, God, painkillers, good jobs and really bad ones, The Longwalls stalk a line from classic indie rock to big-twang Americana––with a few heady stops along the way.",
    "excerpt": "",
    "date": "2013-10-01",
    "meta": {
      "release_date": "20081104"
    }
  },
  {
    "id": 503,
    "title": "Animals",
    "slug": "animals",
    "description": "The ninth solo album from Boston's DIY wunderkind Kurt von Stetten.\n\nA man has a condition that allows him to forget his entire world every five minutes; as a result he feels like he knows everything (and hates it all) like a child. A woman describes the possible end of the world to her brother in the woods where they grew up. A boy leaves home to become an artist because he was already pre-destined to be poor and miserable (he is sorry). A man loses both arms while charged with securing arms for his troops in the civil war- his scout laughed at him and left him for dead. I had a fever dream when I was a child- the theme song from \"three's company\" was playing in the background. A group of boys decides not travel home after the last world war- they decide that this tree is probably as good as any a place to call home. A young man tries to get people to like him by throwing a \"rager\" at his house- he was picking broken beer bottles out of his lawn for weeks to come. Faith will dry your veins- especially for young artists. Math involves unbreakable theorems. Starting a family makes you think about very basic things. A young girl meditates and has random thoughts- it is ok though, because she feels \"complete\" now. You can talk all you want, young man, but you are still making pretty pictures. Thinking that you have special powers and having them are two very different things- just ask your daughters. People in positions of power say some really stupid things about life, religion, science, and leadership.",
    "excerpt": "",
    "date": "2014-08-19",
    "meta": {
      "release_date": "20140930"
    }
  },
  {
    "id": 523,
    "title": "I Will Take You Back",
    "slug": "i-will-take-you-back",
    "description": "Dan London, bassist for Boston-based band The Longwalls, is back with his sophomore solo album I Will Take You Back.\n\nWith songs written during a time and place spanning from Nashville, TN twenty years ago, to Jamaica Plain in the last two years, the album reflects that sense of growth and time. Reminiscent of Elvis Costello and Neil Young, it's old school indie with a hint of alt-country; music meant for vinyl and a turntable, or for driving through small towns on back country roads.\n\nThe lead single anchors the album, and is semi-autobiographical, according to London.\n\n\"The title has that double entendre that worked: the singer of the record, a hyper-real version of me in some far off meta-verse, is looking for what went right and what went wrong in his romantic endeavors, when a smoky Pan with a penchant for pop culture comes along and says I'll be your huckleberry.\"\n\nLet that Pan lead you on a introspective musical journey as well.",
    "excerpt": "",
    "date": "2014-10-22",
    "meta": {
      "track_listing": "<strong>Tracks</strong>\n<ol>\n\t<li>Nothing To Be Afraid Of</li>\n\t<li>Bob Fosse Dreams of Napoleon in Leather</li>\n\t<li>Let’s Get It Over With</li>\n\t<li>I Will Take You Back</li>\n\t<li>In the Wind</li>\n\t<li>Music For Cats</li>\n\t<li>Too Cool For School</li>\n\t<li>She Found Your Picture In My Phone</li>\n\t<li>I Can Play the Game With You</li>\n\t<li>Songs For the Ladies</li>\n\t<li>See the Night</li>\n\t<li>This Ain’t No Lullabye</li>\n</ol>\n<strong>Credits</strong>\n\nRecorded, mixed, and mastered by Mike Quinn at the <a href=\\\"http://www.moontowerstudio.com%20\\\" target=\\\"_blank\\\">Moontower</a>, Davis Square, Somerville, MA. at <a href=\\\"http://www.qdivision.com\\\" target=\\\"_blank\\\">Q Division</a>\n\nDan London - lead vocals, harmonies, guitars, bass, Mtron, mandolin (9), banjo (9)\nWill Dickson - drums (all songs but 3 and 11)\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/artists/kurt-von-stetten/\\\">Kurt von Stetten</a> - drums (3, 11), tambourine, cowbell (1, 10), cello (5), washboard (8), harmonies (1), shaker (2, 6), keys (5), guiro (6)\nBrandon Comstock - guitars (3, 7), guitar solo (3), harmonies (3, 12)\nLew London - mandolin (9)\nMike Quinn - harmonies (1, 2, 3, 12)\n\nAll songs written by <a title=\\\"Dan London\\\" href=\\\"http://staticmotor.com/artists/dan-london/\\\">Dan London</a> © 2014 | Published by Drunken Ballerina Music / SESAC\n\nDesign by <a href=\\\"http://www.abudnitz.com\\\" target=\\\"_blank\\\">Alexander S. Budnitz</a>",
      "release_date": "20141118"
    }
  },
  {
    "id": 641,
    "title": "Gold Standard",
    "slug": "gold-standard",
    "description": "The Longwalls return with their 5th release, Gold Standard. After a series of contemplative EPs, Gold Standard is 11 tracks of glorious, fuzzed-out, Americana-infused post-pop. And no, the title is certainly not a statement. It's a nostalgic reference to an unattainable past. There was a time where there was a bona fide benchmark. That time, whether or not the benchmark actually existed or not, is gone. Misguided nationalistic optimism to the extreme. An idealized form. A gold standard now rendered antiquated by the march of reality, modernity, and violence. So..., now what?",
    "excerpt": "",
    "date": "2015-01-05",
    "meta": {
      "track_listing": "<ol>\n\t<li>The Gold Standard</li>\n\t<li>Home</li>\n\t<li>Hold it</li>\n\t<li>Oh My Brother</li>\n\t<li>Too Many Prayers</li>\n\t<li>Rukia</li>\n\t<li>Simple Thoughts</li>\n\t<li>Burger and Fries</li>\n\t<li>Simo</li>\n\t<li>Unarrested</li>\n\t<li>Bankai</li>\n</ol>\n<strong>Credits</strong>\n\nAlan Wuorinen— vocals (lead on 1, 3. 6, 9, 11), acoustic guitar, pedal steel, keys\n\n<a title=\\\"Kurt von Stetten\\\" href=\\\"http://staticmotor.com/artists/kurt-von-stetten/\\\">Kurt von Stetten</a>— drums, cello, hand percussion\n\n<a title=\\\"Dan London\\\" href=\\\"http://staticmotor.com/artists/dan-london/\\\">Dan London</a>— bass, acoustic guitar, vocals (lead on 4 and 8)\n\nBrandon Comstock— electric guitar, acoustic guitar, banjo, keys, vocals (lead on 2, 5, 7, 10)\n\nSongs 1, 3, 6, 9, 11 by Alan (BMI); 2, 5, 7, 10 by Brandon (BMI); 4 and 8 by Dan (SESAC).\n\nMusic by The Longwalls.\n\nRecorded &amp; Mixed by Alex Allinson at <a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\">The Bridge Sound &amp; Stage</a>. Assistants: Alexander Hayes, Ryan Ainsworth. Intern: Dave Pettibone\n\nTrumpets on “Hold it” by Ian Connelly and Tyler Mehlenbacher\n\nMastered by Mike Quinn at <a href=\\\"http://www.moontowerstudio.com/\\\" target=\\\"_blank\\\">Moontower Studio</a>, <a href=\\\"http://www.qdivision.com/\\\" target=\\\"_blank\\\">Q Division</a>.\n\nDesign by <a href=\\\"http://www.abudnitz.com\\\" target=\\\"_blank\\\">Alex Budnitz</a>.",
      "release_date": "20150224"
    }
  },
  {
    "id": 719,
    "title": "Bon Fortuna",
    "slug": "bon-fortuna",
    "description": "Dreamy, bold and always slightly irreverent, Boston's Kurt von Stetten returns with his 10th solo effort—a glorious dispatch of fearlessly fuzzed-out low-fi pop. Once again written and recorded entirely on his own—with Kurt playing every instruments—Bon Fortuna is truly s DIY gem.\n\nSongs built from overheard conversations and art-school flashbacks span ideas of fear and love and desperation. In Kurt’s own words…\n\nWhile sailing over they had some grand ideas, but the forest was unforgiving (and so was god... any god). A man can make a world inside- very much as wild, dangerous, and free as outside. Once you give in to an idea and take a leap- you might make history (but the people around you may knock your teeth out in the process). Over a sea of men, fists, and knives you realize your life is precious. Guest lecturers often open with guiding principals and immediate sweeping observations; this is often meant to force a master and apprentice relationship when there really is none (especially when my shit is more John Blaze than that). Guy feelings are so deep and not communicated. A persistent general menaces a town for a rumored treasure (a treasure hidden in plain sight); an enemy bomb breaks a dam and the flood actually results in one of the best harvests in years. I know not to leave my car or mouth running. A man goes to help his former love before he dies (he doesn't need directions- he was taught well), but the journey was not fulfilling. A young man on the E train, having just read Oedipus, exclaims \"Oedipus was a pussy\". There are lots of rumored (and fake) beasts in dark lake, but the townsfolk usually just end up harpooning each other in the dark. It was a pretty easy mistake if you think about it- I'm sure it will work out- if I don't see you, good luck!",
    "excerpt": "",
    "date": "2015-09-08",
    "meta": {
      "release_date": "20151006"
    }
  },
  {
    "id": 776,
    "title": "Floods + Fires [Turbo Edition]",
    "slug": "floods-fires-turbo-edition",
    "description": "10 years ago, Gatsby released Floods + Fires. A week later, we broke up.\n\nLike many bands before us, we were left with boxes and boxes of CDs. Boxes that continue to clutter closets. CDs that will never ever be sold. An album that too few heard, but one that I’ve recently came to truly appreciate.\n\nWe were an impressionable lot. At least I was. Raised on metal with an affinity for punk and new wave, Gatsby stumbled into the Boston music scene of the early aughts and found itself immediately influenced by the many great bands of the day. We were the naive, excitable \"happy-to-be-there\" guys, and over the course of a few years we soaked it all up. With the sounds of the day clattering around in our heads, we spent the better part of 2004 making Floods + Fires (original release).\n\nWhile recording I was mostly concerned, too a fault, with how everything measured up to our peers. “What would X band do with this part?” It’s a taxing way to make an album, but I suppose it pushed us a bit (and you can certainly hear nods to Boston bands circa 2003-5 all over the album).\n\nA bit drained by May 2005, we only played a handful of shows after its release before quietly exiting the scene without the typical Boston farewell show fanfare. But I’d listen to the album from time to time. And over the years, with more distance, I became really fond of the music. Impressed even.. in a \"how they hell did we pull that off?!?\" sort of way. And now, 10 years on, I have a true appreciation of the songwriting and the performances.\n\nTo commemorate the 10 year anniversary of its release, I asked our old pal Mike Quinn at Moontower/Q-Division to dig up the old recordings and do a new mix and master, cut out the 4 instrumental interludes, and add back two songs that (stupidly, my bad) didn't make the final cut back in 2004. The result is fast and fresh. Turbo. \n\nAnd digital only. No damn CDs… ;)\n\nEnough said. On behalf of my mates Alan, Scott, and Jay—please enjoy this fresh take on our humble classic.\n\nCheers,\nbrandon",
    "excerpt": "",
    "date": "2015-11-30",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Pretty To Think So</li>\n\t<li>Snakes</li>\n\t<li>High Low</li>\n\t<li>All My Fault</li>\n\t<li>Grad School</li>\n\t<li>Prize Fight</li>\n\t<li>Paint</li>\n\t<li>Agent Birds</li>\n\t<li>My Piano</li>\n\t<li>Cut Me Down</li>\n\t<li>Dodging Bullets</li>\n\t<li>Serial Bride</li>\n</ol>\nCredits\n\nJay Figueroa – guitars\nScott Robinson – drums\nBrandon Comstock – guitars, vocals\nAlan Wuorinen – vocals, bass\n\nAll songs by Alan (c) BMI 2005, except Grad School by Brandon (c) BMI 2005.\n\nOriginally recorded, and mixed with Mike Quinn at Moontower Studio, Cambridge. Mastered by Ian Kennedy at New Alliance East.\n\nRemixed and mastered summer/fall 2015  by Mike Quinn, Moontower Studio / Q Division\n\nTurbo Edition artwork: Alex Budnitz",
      "release_date": "20151201"
    }
  },
  {
    "id": 800,
    "title": "Live at The Bridge",
    "slug": "live-at-the-bridge",
    "description": "A free show. With free beer. And cookies. Friends gathered, old and new. A frigid night in early March 2015 towards the end of Boston’s winter from hell. On the stage where it where it was recorded, The Longwalls played three sets in celebration of the release of their fifth album, Gold Standard. A set of mostly new material was followed by a mini-set of acoustic songs from their first two releases (Field Guide for the Zombie Survivalist and Dark Academy), before the band closed things out with a set of material culled from the classic EPs Careers in Science and Kowloon. There’s nothing quite like a small room filled with music and friends. We tried our best to capture the spirit of the night with this selection of 10 tracks from the show. Download for free and check out the video on YouTube.\n\nEnjoy!",
    "excerpt": "",
    "date": "2015-12-23",
    "meta": {
      "track_listing": "Tracks\n<ol>\n\t<li>Careers in Science | Careers in Science, 2011</li>\n\t<li>Where Things Go To Fade | Careers in Science, 2011</li>\n\t<li>Maybe Golden | Kowloon, 2012</li>\n\t<li>Simple Thoughts | Gold Standard, 2015</li>\n\t<li>Zombies! | Field Guide for the Zombie Survivalist, 2008</li>\n\t<li>Ghosts | Dark Academy, 2010</li>\n\t<li>Dark Academy | Dark Academy, 2010</li>\n\t<li>Burger and Fries | Gold Standard, 2015</li>\n\t<li>Rukia | Gold Standard, 2015</li>\n\t<li>UFO | Careers in Science, 2011</li>\n</ol>\nCredits:\n\nAlan Wuorinen - acoustic guitars, vocals\nDan London - bass, mandolin, vocals\nKurt von Stetten - drums, washboard, harmonica\nBrandon Comstock - electric and acoustic guitars, vocals\n\nWith Mike Quinn - keyboard (Rukia) and glockenspiel (Ghosts)\n\nLive audio and post production: Alex Allinson -<a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\"> The Bridge Sound and Stage</a>\n\nVideographers: Alexander \\\"Z\\\" Hayes and Grace Deacon - <a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\">The Bridge Sound and Stage</a>\n\nVideo editing and post production: Alexander “Z” Hayes - <a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\">The Bridge Sound and Stage</a>\n\nTitle design: <a href=\\\"http://www.abudnitz.com/\\\" target=\\\"_blank\\\">Alexander Budnitz</a>\n\nTitle production: Ange Romanska\n\nThank you!\nOwen Curtin. Janos Arcitype Fulop, Alex Allinson, Alexander \\\"Z\\\" Hayes, And everyone at <a href=\\\"http://thebridgesoundstage.com/\\\" target=\\\"_blank\\\">The Bridge Sound and Stage</a>, <a href=\\\"http://www.moontowerstudio.com/\\\" target=\\\"_blank\\\">Mike Quinn</a>, <a href=\\\"http://www.rslblog.com/\\\" target=\\\"_blank\\\">Ryan Spaulding</a>, <a href=\\\"http://www.abudnitz.com/\\\" target=\\\"_blank\\\">Alexander Budnitz</a>, <a href=\\\"http://wmbr.org/\\\" target=\\\"_blank\\\">WMBR</a>, <a href=\\\"http://wemfradio.com/\\\" target=\\\"_blank\\\">WEMF</a>, <a href=\\\"http://www.theunexcused.com/\\\" target=\\\"_blank\\\">Visions of the Unexcused</a>, <a href=\\\"https://digboston.com/\\\" target=\\\"_blank\\\">DigBoston</a>, <a href=\\\"http://www.redlineroots.com/\\\" target=\\\"_blank\\\">Redline Roots</a>, <a href=\\\"http://www.musicboxpete.com/\\\" target=\\\"_blank\\\">MusicBoxPete</a>, <a href=\\\"http://huntnewsnu.com/\\\" target=\\\"_blank\\\">The Huntington News</a>, <a href=\\\"http://survivingthegoldenage.com/\\\" target=\\\"_blank\\\">Surviving the Golden Age</a>, Laura, Ange, Leasa, Jen, Scott &amp; Sarah.",
      "release_date": "20151222"
    }
  },
  {
    "id": 829,
    "title": "Full Circle",
    "slug": "full-circle",
    "description": "Full Circle - Commonwealth Women Up front. An idea born out of our Indie Music Boston SoundCloud group. 10 tracks of solo artists and bands with a female voice up front. Quiet introspective folk, lush dream pop, fuzzed out guitars and synths. Amazing vocals start to finish. 10 artists you've probably never heard of, but should. And a seriously serendipitous thematic thread of time and space:\n\nDear time,\n\nCan we just pretend, that you forgot to tell us there was a beginning and an end? Let us go off into the sunrise having left nothing behind, so that we may be held struck later, awed and surprised, as her sister sunset arrives. Forget that you gave us remember and expect. So that we make take every moment, without regret. To know not how to wait, or to pine for the end of a day, not realizing that in those moments we’re wishing our very lives away. To never feel the sadness of age, the imminence of parting, the paradox of knowing, what a wild and unexplainable game. Though of course there’s a beauty, crucial undeniably. To dream of what could be, endless possibility, the recollection of blissful memory. There is a truth in this contrast, knowing nothing can last, sometimes good, and sometimes bad. I suppose all we can do, is to learn to surrender, to that never to be found answer. Ironies never to be lost on me, but let’s laugh instead, while we also learn to take our selves less seriously.\n\n–k. augenstein\n\nFull - Circle. Commonwealth Women Up Front.",
    "excerpt": "",
    "date": "2016-01-07",
    "meta": {
      "release_date": "20160209"
    }
  },
  {
    "id": 898,
    "title": "Gutt",
    "slug": "gutt",
    "description": "Ready, ready, ready, ready, ready, ready, ready, set gooooooo...\n\nBold, defiant, insatiable. Boston's Kurt von Stetten returns with his 11th solo effort—in 11 years. Noisy and angular. Low lows. High highs. Big and fragile. Playful and tuneful as ever. And once again written and recorded entirely on his own—with Kurt himself playing every instrument.\n\nIn Kurt's own words...\n\n20 tracks can't be wrong. Give Gutt a go.A smart woman sets a silly kid on the right path. Everything is a stand in for a youth that gets further away every day. He is a performer by vocation, but don't get it twisted, it is just a job. Writing checks to get out of jams is not the smartest thing in the world to do- but it is an adventure. You said you have no one, but you have your health. He will keep that secret because of loyalty, no matter the corporeal price. Just wait it out- it will pass. Putting labels on situations is sometimes a good thing for self preservation. I still use the same dutch oven I was given in childhood. No matter what they say, these things unfold in ways that were never captured on film. We are from the last generation that know we are constant lairs. It really is only a dream- you do not have to create a narrative. The choice is not exactly desirable. He is pretty sure he can make a deal and get out of the situation, but his heart is pounding none the less. Finally, Johnny gets a diagnosis- and it is not good! At night is when it is the worst, but then you wake up and see the good side- I mean it is still a tough loss for the home team though. An overly dramatic response to an everyday situation - just sit there and listen. Continue to wait it out. When ghosts visit you in dreams they are under no obligation to make sense- in fact they could care less. Congratulations, you got what you wanted, but now you have to think about things like heirs.",
    "excerpt": "",
    "date": "2016-10-20",
    "meta": {
      "track_listing": "Tracks\n<ol>\n \t<li>In a car, falling in love</li>\n \t<li>To him it was youth</li>\n \t<li>Performer</li>\n \t<li>Adventure</li>\n \t<li>Pink lungs</li>\n \t<li>A secret from my kingpin</li>\n \t<li>Wait it out</li>\n \t<li>Stressor</li>\n \t<li>Good man</li>\n \t<li>Every shade of grey</li>\n \t<li>70s son</li>\n \t<li>Only in dreams</li>\n \t<li>Desirable</li>\n \t<li>Tragic but fun</li>\n \t<li>A diagnosis for Johnny</li>\n \t<li>Snake mountain (explicit lyrics)</li>\n \t<li>Nosferatyou</li>\n \t<li>Sunshine</li>\n \t<li>The future is fashion</li>\n \t<li>Kings and sons</li>\n</ol>\nCredits\n\nAll vocals instruments by Kvs\nEngineered, mixed and mastered (ha!) by KvS\nArtwork by KvS",
      "release_date": "20161028"
    }
  },
  {
    "id": 951,
    "title": "Cycle",
    "slug": "cycle",
    "description": "When I mess up I hit the all clear...\n\nKurt von Stetten returns with his 12th solo effort—in 12 years. This new mega release, entitled Cycle, ebbs and flows from track to track, bunny-hopping textures and moods like no other KvS release to date. Kurt explores new territory and mines new sounds, creating textural songs that float about you as if they can be reached out and touched. And, once again, the entire album was written, performed, and recorded by Kurt.\n\nIn Kurt's own words...\n\nIn a perfect world the division of labor between the mind and body is simple - until then let's calculate. You'd better run, for the heat of the sun is unparalleled. You talk then I talk, but I am really just going to rephrase what you say. It is going to be really hard to tell this story in the future so he will have to round out some of the harder edges. Those letters just pile up so instead of collecting them she just throws them away. It starts with a jolt and you do what you are told, but you get to decide if it should be fight or flight. Communication should be based on a shared set of facts, absent that you should just rely on past experience. After a rough year of travel and self reflection James is finally on the mend. They have studied the language, but they cannot confirm what is being said. He's not a bad man- oh I have seen way worse! Both sides didn't really know that they broke up. You cannot own it and despite all best efforts you cannot know it. After a good amount of trouble, and really I mean trouble, you have decided that you have had enough. Seriously bro I thought I could get this supported by our town, I am sorry. Ok so I saw this creature while fishing, way out in the deep, it had a curved spine made of protruding bone. Sometimes it is worth it to get grounded- so he decided he didn't need his weekends anymore. Set the repeats up really high. Through it all, for better or worse, she was a scientist first. After the accident it was a good sign that he knew something was hurting. During a dark stretch in his youth he could be seen shouting a people in bars. Humid summer night. Some things look very easy when you are young.",
    "excerpt": "",
    "date": "2017-10-17",
    "meta": {
      "release_date": "20171027"
    }
  },
  {
    "id": 997,
    "title": "Red Shirts",
    "slug": "red-shirts",
    "description": "Red Shirts is The Longwalls’ first full-length studio effort since 2015’s Gold Standard.\nSome of these songs were demo’d nearly 15 years ago when the band was first getting started. Some were floating around in heads for nearly as long but never quite materialized. Some were written while the album was being recorded in the studio Brandon built in the basement of his home in Jamaica Plain, MA.\nOne of these songs is about strange disappearances of men around Boston. One of these songs is about feeling passed by. One of these songs claims to know the truth about Billy Shears.\nAll of these songs were tracked by the band on their own, an approach they took with their 2008 debut as well as 2012’s much beloved Kowloon. All of these songs were slated for release nearly two years ago. Short-run, lathe-cut vinyl was produced from the original mixes by Brandon and Kurt in mid 2019. The band played the Jamaica Plain Music Festival.\nBut then things got complicated, and the album was put on ice. After a while a certain restlessness took root. Sonic freezer burn had set in and all these songs needed to somehow sound fresh again. And they do, thanks to a new set of mixes by Benny at Mad Oak Studios.\nNow, all these songs are both old and new. Both pre- and nearly post. And long overdue.",
    "excerpt": "",
    "date": "2021-05-12",
    "meta": {
      "track_listing": "Tracks\n<ol>\n \t<li>Red Shirts</li>\n \t<li>Parts Per Billion</li>\n \t<li>American Easterner</li>\n \t<li>Last One</li>\n \t<li>Open Your Heart</li>\n \t<li>Planes Overhead</li>\n \t<li>Buried</li>\n \t<li>18 and Over</li>\n \t<li>Please Be Good to Me</li>\n \t<li>Toothache</li>\n</ol>\nCredits\n\nAlan Wuorinen - <em>vocals, acoustic guitar</em>\n<a href=\\\"http://staticmotor.com/artists/kurt-von-stetten/\\\">Kurt von Stetten</a> - <em>drums, cello, synths, percussion</em>\nDan London - <em>bass, acoustic guitar, backing vocals (lead on “heart“)</em>\nBrandon Comstock - <em>electric guitars, backing vocals (lead on “planes”)</em>\n\nSongs by Alan (BMI); “planes” by Brandon (BMI); “heart” by Dan (SESAC); Jennifer Comstock played some piano on “18”\n\nMusic by The Longwalls\n\nEngineered by The Longwalls at Arlington Music Studios and The Bunker\n\nLathe cut vinyl release mixed by Brandon Comstock and <a href=\\\"http://staticmotor.com/artists/kurt-von-stetten/\\\">Kurt von Stetten</a>; Mastered for vinyl by Mike Quinn\n\nDigital release mixed and mastered by Benny Grotto at <a href=\\\"https://www.madoakstudios.com/\\\" target=\\\"_blank\\\">Mad Oak Studios</a>",
      "release_date": "20210528"
    }
  }
]