[
  {
    "date": "2021-05-28",
    "title": "Well, well, well... new record by The Longwalls out today!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Red Shirts",
      "Video"
    ],
    "excerpt": "Well hello there! Been a minute... for all of us. Suffice to say this new Longwalls record — Red Shirts — was ready to go a while back, but then things got complicated. As such, there's a version featuring the original mixes by Brandon and Kurt on short-run, lathe-cut vinyl ( that you can pick up he"
  },
  {
    "date": "2021-03-31",
    "title": "New Longwalls Coming soon...",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Red Shirts"
    ],
    "excerpt": ""
  },
  {
    "date": "2018-09-05",
    "title": "New Longwalls music for the 8th Annual JP Music Fest!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "JP Music Fest",
      "Red Shirts"
    ],
    "excerpt": "For your listening pleasure, 2 new tracks from the upcoming Longwalls album entitled Red Shirts . Keep an eye out for an album release in early 2019. And for those who can make it to the JP Music Festival this Saturday, we got some fancy red-tint cassettes/download cards for free! Offer valid while "
  },
  {
    "date": "2018-08-24",
    "title": "Wow, it's been a minute. But things be percolatin'",
    "type": "news",
    "categories": [
      "Kurt von Stetten",
      "The Longwalls"
    ],
    "tags": [
      "JP Music Fest",
      "Live",
      "Red Shirts"
    ],
    "excerpt": "Hey there! Been a while. Wow. Well, we'll have you know we've been keepin' on with the keepin' on. Here's what's up. For those following along at home, you know it's about time for the annual Kurt von Stetten release. Yep. We're looking at November for the next one. No title yet, but there will be s"
  },
  {
    "date": "2017-11-10",
    "title": "Kurt von Stetten delivers a \"definite must have\"",
    "type": "live",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cycle",
      "Review",
      "Video"
    ],
    "excerpt": "The very knowledgable folks at Floorshime Zipper Boots have deemed Kurt von Stetten's \"Cycle\" a \"definite must have.\" We certainly agree. And at 23 tracks, it's both quant and qual. Star qual to be exact. Dig it! Download: Bandcamp > iTunes > Google Play > Amazon > Static Motor >"
  },
  {
    "date": "2017-10-27",
    "title": "\"Cycle\" —23 new tracks from Kurt von Stetten— on sale now!",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cycle",
      "Video"
    ],
    "excerpt": "Hey now! It's that time of year. Again. We don't how he does it, we're just happy he does. These 23 new tracks from Kurt von Stetten are quite a trip. Distorted synths and REM jangle cohabitate as Kurt bunnyhops textures, sounds, and moods. Download now Cycle now! Check out the video for Calculator "
  },
  {
    "date": "2017-10-17",
    "title": "Kurt von Stetten back with new (double!) album entitled \"Cycle\"",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cycle"
    ],
    "excerpt": "Clocking in at an hour plus with 23 tracks, this is a ton of new material from our favorite son, Kurt von Stetten . This new mega release, entitled Cycle , ebbs and flows from track to track, bunny-hopping textures and moods like no other KvS release to date. Fo' reals! Here's the first single, Calc"
  },
  {
    "date": "2017-01-08",
    "title": "The Longwalls wish you a happy, snowy Sunday!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Video"
    ],
    "excerpt": "Big thanks to Rob at Sleepover Shows for putting this all together. The song is, of course, \" Home \" off 2015's Gold Standard . Enjoy!"
  },
  {
    "date": "2016-12-21",
    "title": "Live video. Kind words. Alan represents The Longwalls at Outlaw Roadshow 2016 this past fall in NYC.",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Dark Academy",
      "Gold Standard",
      "Kowloon",
      "Live",
      "Live at The Bridge",
      "Outlaw Roadshow",
      "Video"
    ],
    "excerpt": "Well ain't this a hum-dinger! Alan opens up with \"Sargasso in Space\" off The Longwalls ' classic 2012 EP, Careers in Science ; follows it up with a tease from the band's forthcoming 6th release with (soon-to-be-blistering) \"Red Shirts;\" slows things down with \"Rukia\" from 2015's Gold Standard ; and "
  },
  {
    "date": "2016-10-28",
    "title": "Kurt von Stetten releases video for \"The Future is Fashion\" from new album Gutt—on sale now!",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Gutt",
      "Video"
    ],
    "excerpt": "A new animated video from Kurt von Stetten dropped in our laps last night! It's for the track \"The Future is Fashion\" of off Kurt's new one, Gutt . It's 20 tracks, it's EPIC, and it's on sale now! Download: here on SMR > Bandcamp > iTunes >"
  },
  {
    "date": "2016-10-23",
    "title": "The Longwalls' lend to track to \"Keep Safe Boston 2016,\" a benefit compilation for Fenway Health",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Benefit",
      "Gold Standard"
    ],
    "excerpt": "Keep Safe Boston 2016 Compilation For Fenway Health is dedicated in loving memory to all lives affected by the events of June 12, 2016 at Pulse nightclub in Orlando, Florida. The Longwalls are proud to have lent the track \" Too Many Prayers \" from 2015's Gold Standard to the cause. Stream some track"
  },
  {
    "date": "2016-10-21",
    "title": "Kurt von Stetten to release new album, Gutt, Friday 10/28",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Gutt"
    ],
    "excerpt": "Well, well, well. Here we are busy with another Longwalls album, getting into our fall routines and.. oh looky here: A new KvS album called Gutt ! I guess it has been a year since the excellent Bon Fortuna record. Anyway.. Bold, defiant, insatiable. Boston's Kurt von Stetten returns with his 11th so"
  },
  {
    "date": "2016-10-20",
    "title": "The Longwalls' Alan Wuorinen to play solo set at the Outlaw Roadshow NYC!",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Outlaw Roadshow",
      "Video"
    ],
    "excerpt": "The Longwalls ' own Alan Wuorinen is playing a solo acoustic set at the 2016 edition of Outlaw Roadshow NYC . He goes on at 8:30 at the Bowery Electric ! Thanks to Ryan Spaulding for having Alan down, and apologies the rest of the band can't make it this time around! Check out Rukia, by Alan. In his"
  },
  {
    "date": "2016-05-26",
    "title": "The Longwalls to play \"Listen Local\" 2016 - FREE SHOW!",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Listen Local 2016",
      "Live"
    ],
    "excerpt": "Long weekend, so Sunday night is quite OK for partying. Join us this Sunday for the 3rd Annual Listen Local event featuring some of Boston's best bands selected by the tastemakers that bring them to you first (the estimable Ryan Spaulding in our case). And just across the street from Boston's bigges"
  },
  {
    "date": "2016-03-31",
    "title": "Friday night's alright for fighting!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Rumble 2016"
    ],
    "excerpt": "More great coverage as the Rock & Roll Rumble approaches! Things kick off this Sunday and The Longwalls close out night 5 next Friday, April 8. Check out this great history of the event from Brett Milano of the Boston Herald . And here's a cool preview of night 5 via Vanyaland . Otherwise, be sure t"
  },
  {
    "date": "2016-03-23",
    "title": "A very thoughtful review of \"Full Circle - Commonwealth Women Up Front\"",
    "type": "press",
    "categories": [
      "Uncategorized"
    ],
    "tags": [
      "Full Circle",
      "Review"
    ],
    "excerpt": "Discover some new artists. All these singers and bands excel in writing cool, gorgeous songs. They showcase vocal range and musical prowess. Impossible not to listen to it from start to finish again and again and again. Every song impresses with its songwriting, composition and ability to move, soot"
  },
  {
    "date": "2016-03-16",
    "title": "Friday, April 8: The Longwalls play the Rock & Roll Rumble!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Rumble 2016"
    ],
    "excerpt": "The luck of the draw puts The Longwalls on Friday 4/8 for the prelims of the 2016 Rock & Roll Rumble at ONCE Lounge and Ballroom . Get tix here ! Lots of nice words have been written about the annual showcase: check out \" 10 Questions with The Longwalls \" as well as the Improper Boston , Vanyaland ,"
  },
  {
    "date": "2016-03-07",
    "title": "How about that, The Longwalls are playing in the 2016 Rock & Roll Rumble!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Rumble 2016"
    ],
    "excerpt": "As announced last night on Boston Emissions , our very own Longwalls have been selected as one of the 24 bands for the 2016 Rock & Roll Rumble ! Quite the honor we'd say. Dates and times TBD but the initial round is the first week of April. Block those calendars, we'll need your support! Now check o"
  },
  {
    "date": "2016-02-11",
    "title": "\"Full Circle - Commonwealth Women Up Front\" available now for FREE download!",
    "type": "news",
    "categories": [
      "Uncategorized"
    ],
    "tags": [
      "Full Circle",
      "Review"
    ],
    "excerpt": "We're oh so proud to release the first every Static Motor compilation— \" Full Circle - Commonwealth Women Up Front. \" Born from a SoundCloud group , the comp features 10 tracks of 10 tracks of solo artists and bands with a female voice up front. Quiet introspective lo-fi folk, lush dream pop, surfy "
  },
  {
    "date": "2016-01-28",
    "title": "COMING SOON: Full Circle - Commonwealth Women Up Front, out Feb 9",
    "type": "news",
    "categories": [
      "Uncategorized"
    ],
    "tags": [
      "Full Circle"
    ],
    "excerpt": "Our first foray into compilation albums is going to be something special. I've been moderating a group on SoundCloud called \" Indie Music Boston \" (the biggest moderated group for Boston in fact) for several years now and always thought it would be cool to produce a compilation album solely of artis"
  },
  {
    "date": "2016-01-28",
    "title": "More kind words on The Longwalls' \"Live at The Bridge\"",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Live at The Bridge",
      "Review",
      "Video"
    ],
    "excerpt": "\"These guys don’t get nearly the recognition they deserve and I like to believe in a different time and place you’d be reading about them in Rolling Stone……and in that different time and place Rolling Stone is still cool and relevant.\" Wow.. the fine folks at Nine Bullets have blown us away with the"
  },
  {
    "date": "2016-01-06",
    "title": "Kinds words for The Longwalls' \"Live at The Bridge\"",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Live at The Bridge",
      "Review",
      "Video"
    ],
    "excerpt": "The fine folks at Floorshime Zipper Boots have some nice very things to say about The Longwalls live album / video \" Live at The Bridge .\" \"Live albums are, at best, difficult affairs that try to recreate the precision of recorded tracks, coupled with the spontaneity and energy of a live performance"
  },
  {
    "date": "2015-12-23",
    "title": "The Longwalls' \"Live at The Bridge",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Live at The Bridge",
      "Video"
    ],
    "excerpt": "We're so very pleased to release the first Static Motor live album— The Longwalls Live at The Bridge —featuring 10 audio tracks and stellar black and white video. It was a special night for all who were there and we've worked to try and capture the spirit of that special night back in March when the"
  },
  {
    "date": "2015-12-01",
    "title": "REISSUE: Floods + Fires [Turbo Edition] by Gatsby",
    "type": "news",
    "categories": [
      "Gatsby"
    ],
    "tags": [
      "Floods + Fires [Turbo Edition]"
    ],
    "excerpt": "We're excited (and a little proud) to announce today's release of Floods + Fires [Turbo Edition] —a newly remixed and remastered edition of Gatsby's classic 2005 full-length. Download it for FREE! Here on StaticMotor > Bandcamp > SoundCloud > Gatsby is the original Static Motor band, and precursor t"
  },
  {
    "date": "2015-10-30",
    "title": "Video Premiere: The Longwalls – Zombies! – Live at The Bridge Sound and Stage",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Live",
      "Live at The Bridge",
      "Video"
    ],
    "excerpt": "Big thanks to our pal Derek at Visions of the Unexcused for premiering the first video from The Longwalls - Live at The Bridge . The Longwalls classic track Zombies! gets the acoustic treatment here complete with mandolin, washboard and even a little harmonica. Good times were had back in March when"
  },
  {
    "date": "2015-10-09",
    "title": "The Longwalls are headed to NYC for The Outlaw Roadshow 2015!",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Outlaw Roadshow"
    ],
    "excerpt": "Huzzah! The Longwalls are headed back to The Bowery Electric in NYC for the 2015 edition of The Outlaw Roadshow ! Presented by Boston's own Ryan Spaulding (Ryan's Smashing Life) and Counting Crows legend Adam Duritz, The Outlaw Roadshow is a showcase of up-and-coming bands that started as part of Au"
  },
  {
    "date": "2015-10-09",
    "title": "Kind words on The Longwalls from Ryan's Smashing Life",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Live",
      "Outlaw Roadshow",
      "Review"
    ],
    "excerpt": "As The Longwalls get ready to head back to The Bowery Electric in NYC for The Outlaw Roadshow 2015, Ryan's Smashing Life has posted some very kind words on the band and their latest album— Gold Standard —writing, \"One of the east coast's standout pop acts, you aren't going to want to miss what I've "
  },
  {
    "date": "2015-10-06",
    "title": "Kurt von Stetten's \"Bon Fortuna\" on sale now!",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Bon Fortuna",
      "Video"
    ],
    "excerpt": "We're pleased as punch to announce Bon Fortuna —the new record by Kurt von Stetten —is on sale now! Dreamy, bold and always irreverent, Kurt returns with a glorious dispatch of fearlessly fuzzed-out art pop. And this one is a bit of a milestone: 10 solo albums in 10 years with Kurt playing every ins"
  },
  {
    "date": "2015-09-29",
    "title": "More kind words on \"Bon Fortuna,\" the new album by Kurt von Stetten out 10/6",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Bon Fortuna",
      "Review"
    ],
    "excerpt": "\"Another fantastic von Stetten album... it very well be his most solid work to date, and that’s saying quite a bit.\" That's what our pals at Visions of the Unexcused have to say about the new Kurt von Stetten album, B on Fortuna . Meanwhile Bishop and Rock call Bon Fortuna, \"a dreamy, multi-layered "
  },
  {
    "date": "2015-09-15",
    "title": "The Sound of Confusion reviews Kurt von Stetten's \"Bon Fortuna\"—and it's a good one!",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Bon Fortuna",
      "Review"
    ],
    "excerpt": "\"'Spanish Ship' is still a powerful statement. It's bold, hard-hitting, well-crafted, and at well under three-minutes it doesn't outstay its welcome. Plus, it's not even the best track on the LP, which shows you just how good this guy is.\" Wow, kind words indeed from The Sound of Confusion . Thank y"
  },
  {
    "date": "2015-09-08",
    "title": "\"Bon Fortuna\" by Kurt von Stetten on sale October 6",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Bon Fortuna"
    ],
    "excerpt": "Get ready folks! Bon Fortuna —The 10th solo album from Kurt von Stetten is on its way! Look for a digital release on 10/6, and if you follow KvS on Twitter keep an eye out for give-aways of physical copies-- it's the only way to get your hands on the real thing. In the meantime, check out Spanish Sh"
  },
  {
    "date": "2015-09-04",
    "title": "On tap for the fall: new KvS, Longwalls and... Gatsby?",
    "type": "news",
    "categories": [
      "Gatsby",
      "Kurt von Stetten",
      "The Longwalls"
    ],
    "tags": [
      "Bon Fortuna",
      "Floods + Fires [Turbo Edition]",
      "Gold Standard",
      "Live",
      "Video"
    ],
    "excerpt": "Wow, what a summer. And now, back to school. Our own Kurt von Stetten has completed his 10th solo album in 10 years! Damn. It's called Bon Fortuna and is slated for an October release date. Meanwhile, The Longwalls will soon be releasing Live at the Bridge—a live concert video shot/recorded during t"
  },
  {
    "date": "2015-03-20",
    "title": "A crazy few weeks for The Longwalls!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Live",
      "Radio",
      "Review",
      "Video"
    ],
    "excerpt": "Well.. that was fun!! Huge thanks to everyone who came out to The Bridge Sound & Stage for The Longwalls ' Gold Standard release show! (Check out this preview from MusicBoxPete ). It was an amazing time full of amazing faces from near and far... lots of love in the room ( photos ). Thank you! Leadin"
  },
  {
    "date": "2015-03-06",
    "title": "DigBoston interviews The Longwalls",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "interview",
      "Review"
    ],
    "excerpt": "The fine folks at DigBoston paid a visit to The Longwalls rehearsal space last week to discuss the new album, Gold Standard , the release party Saturday March 7 , and otherwise what the hell the band has been up to lately. Read all about it!!"
  },
  {
    "date": "2015-02-25",
    "title": "Early love for The Longwalls' \"Gold Standard\"",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Review"
    ],
    "excerpt": "Two of our favorite Boston blogs— Redline Roots and Visions of the Unexcused —have offered some kind words on the new Longwalls record, Gold Standard . Redline Roots writes, \" Gold Standard further presents the band as a strong force that produces some catchy songs with a bit of a punk attitude and "
  },
  {
    "date": "2015-02-24",
    "title": "\"Gold Standard\" by The Longwalls on sale now!",
    "type": "release",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Live"
    ],
    "excerpt": "More than a year in the making... we're so very proud to release the new full-length album by Boston's The Longwalls ! After a series of contemplative EPs, Gold Standard , bursts forth with 11 tracks of glorious, fuzzed-out, Americana-infused post-pop. Own it now on limited edition CD or via digital"
  },
  {
    "date": "2015-01-23",
    "title": "The Longwalls release party for \"Gold Standard\" set for Saturday, March 7",
    "type": "release",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Live"
    ],
    "excerpt": "Join The Longwalls on Saturday, March 7 as they celebrate the release of their new full-length album, Gold Standard . The party will be held at Bridge Sound and Stage —the studio where the album was recorded—and will feature an opening performance by Longwalls bassist Dan London . What's more? The e"
  },
  {
    "date": "2015-01-08",
    "title": "The Longwalls' \"Gold Standard\" to be released 2/24!",
    "type": "release",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard"
    ],
    "excerpt": "After a series of contemplative EPs, The Longwalls return with Gold Standard —11 tracks of glorious, fuzzed-out, Americana-infused post-pop. Enjoy a quick taste here, look out for the album release (limited edition CD / digital) on 2/24, and stay tuned for details on a release show/party 3/7. More s"
  },
  {
    "date": "2015-01-07",
    "title": "Dan London makes best of 2014 on the Americana Rock Soundoff!",
    "type": "press",
    "categories": [
      "Dan London"
    ],
    "tags": [
      "Best of",
      "I Will Take You Back",
      "Podcast"
    ],
    "excerpt": "Our pal Von has included Dan London on his best of 2014 edition of the Americana Rock Soundoff !. It's a great collection of music and we're proud Dan made the cut. Give a listen and check out Dan's latest— I Will Take You Back —before doing anything else. Ya herd? (And thanks Von!)"
  },
  {
    "date": "2014-12-10",
    "title": "Kurt von Stetten is (still) winning the internet",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Animals",
      "Cyclops",
      "interview",
      "Vans",
      "Video"
    ],
    "excerpt": "Kurt von Stetten is killing it! On the heels of composing the new theme for the Lost at Home Podcast , a fantastic interview by the fab folks at Visions of the Unexcused —entitled \" The Last Renaissance Man: Ten Questions with Kurt von Stetten \"—explores Kurt's creative endeavors from music to visua"
  },
  {
    "date": "2014-12-02",
    "title": "Kurt von Stetten is Lost at Home (but fine)",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Podcast"
    ],
    "excerpt": "Our own Kurt Von Stetten has been working with the fine folks at Lost at Home Podcast on a theme song for their show. The new original song will debut this Wednesday! Check it out now and then tune in to tomorrow's episode to hear its debut along with plenty of horror B film chatter and discussions "
  },
  {
    "date": "2014-11-03",
    "title": "Dan London's \"I Will Take You Back\" to be released Tuesday, 11/18",
    "type": "release",
    "categories": [
      "Dan London"
    ],
    "tags": [
      "I Will Take You Back"
    ],
    "excerpt": "We're proud to announce that Longwalls bassist Dan London will release his second solo effort— I Will Take You Back —on Tuesday, November 18. With songs written during a time and place spanning from Nashville, TN twenty years ago, to Jamaica Plain in the last two years, the album reflects that sense"
  },
  {
    "date": "2014-10-28",
    "title": "An amazing day for The Longwalls at the Outlaw Roadshow 2014",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Outlaw Roadshow"
    ],
    "excerpt": "Wow, what a weekend! Big thanks to all at The Outlaw Roadshow for an incredible experience. Ryan Spaulding , Adam Duritz and Counting Crows , The Bowery Electric , Man on Fire , and Squarespace put on amazing 3-day event and The Longwalls couldn't be more honored to have been a part of it. Thank you"
  },
  {
    "date": "2014-10-22",
    "title": "Kurt von Stetten wins the internet with original song for fan!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Animals",
      "Video"
    ],
    "excerpt": "You read right. A couple weeks ago our own Kurt von Stetten held a contest on Twitter : he asked followers to post short videos of themselves listening to his latest release, Animals . For those that followed through, Kurt would then craft an original song about the fan. One lucky winner, Ravi Jain "
  },
  {
    "date": "2014-10-20",
    "title": "Kind words from Bishop & Rook on Kurt von Stetten's latest, \"Animals\"",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Animals",
      "Review"
    ],
    "excerpt": "The fine folks at Bishop & Rook have written a really nice review of Kurt von Stetten's latest release, \" Animals .\" They write, \" Perhaps all of these records are annual invitations into a complex mind of a musical intellect, a mind full of radical ideas of a broader picture too ambiguous for a cas"
  },
  {
    "date": "2014-10-20",
    "title": "The Outlaw Roadshow calls The Longwalls \"Boston's best kept music secret.\"",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Outlaw Roadshow"
    ],
    "excerpt": "Well now! Kinds words indeed from mighty music blogger and Outlaw Roadshow producer Ryan's Smashing Life . Check it out here , and if you're in NYC on Saturday 10/25 be sure to RSVP and check out The Longwalls at Noon at The Bowery Electric . It's day three of a truly amazing festival and we're all "
  },
  {
    "date": "2014-10-15",
    "title": "The Longwalls play the Bowery Electric 10/25 at 12:30 as part of the Outlaw Roadshow!",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Outlaw Roadshow"
    ],
    "excerpt": "The Longwalls are more than a little excited to be opening the final day of the Outlaw Roadshow at 12:30 on 10/25 at the Bowery Electric in NYC. They kick-off quite a bill: taking the stage afterwards will be none other than heavyweights Filligar , Tigerman WOAH , and Mean Creek . Wow. And maybe som"
  },
  {
    "date": "2014-10-03",
    "title": "The Longwalls to play the Outlaw Roadshow October 25 in NYC!",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Outlaw Roadshow"
    ],
    "excerpt": "Well that sure is exciting!! Produced by none other than the Counting Crows’ Adam Duritz and local music hero Ryan Spaulding ( Ryan's Smashing Life ), this year's NYC edition of the Outlaw Roadshow is set for Oct. 23-25 at the Bowery Electric in NYC. Some 30 bands are taking part! Read all about it "
  },
  {
    "date": "2014-09-30",
    "title": "Kurt von Stetten's \"Animals\" on sale now, new video for We Were So Very Wrong",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Animals",
      "Video"
    ],
    "excerpt": "Animals , the latest home-brewed effort from Boston DIY wunderkind Kurt von Stetten is on sale now! Downloads only this time around kids (Obamacare is hitting KvS industries pretty hard). Grab it here or over on iTunes or Bandcamp . And while you're at it check out his latest video for the track We "
  },
  {
    "date": "2014-09-23",
    "title": "Early love for Kurt von Stetten's \"Animals.\"",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Animals",
      "Review"
    ],
    "excerpt": "The fine folks over at Examiner.com and Popa's Tunes have some nice things to say about Animals , the new album by Kurt von Stetten . The album comes out Tuesday 9/30 and is Kurt's 9th full length in as many years. Damn. And as Popa would say, this one is an album filled with expansive, full-bodied "
  },
  {
    "date": "2014-08-19",
    "title": "Kurt von Stetten \"Animals\" out 9/30!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Animals"
    ],
    "excerpt": "It's that time a year again folks! Our own Kurt von Stetten has a new release ready for the fall! It's called Animals and it finds Kurt coloring way outside the lines and conjuring up animals of many different stripes—some strange, some familiar, and all so undeniably human. His 9th record in nearly"
  },
  {
    "date": "2014-07-31",
    "title": "The Longwalls live on air!",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "Live",
      "Radio"
    ],
    "excerpt": "And possibly a bit tipsy. Give a listen to WEMF this Saturday afternoon from 4-6pm and hear the mighty Longwalls on The Outlaw Radio Show . They'll be hanging with host extraordinaire Ryan Spaulding and previewing a track or two from their forthcoming new album— The Gold Standard. They'll also be pl"
  },
  {
    "date": "2014-06-30",
    "title": "Much new music on the way!",
    "type": "news",
    "categories": [
      "Dan London",
      "Kurt von Stetten",
      "The Longwalls"
    ],
    "tags": [
      "Gold Standard",
      "I Will Take You Back",
      "Recording"
    ],
    "excerpt": "Making making making. That's what we do! Here's the latest... The new Longwalls album, tentatively titled The Gold Standard, is nearing completion. 11 songs (!) are in the hopper over at Bridge Sound and Stage and we're close to mixing time. Look for a fall release. In the meantime, the new solo alb"
  },
  {
    "date": "2014-03-18",
    "title": "It's makin' season...",
    "type": "news",
    "categories": [
      "Dan London",
      "Kurt von Stetten",
      "The Longwalls"
    ],
    "tags": [
      "Recording"
    ],
    "excerpt": "The Boston polar vortex will soon yield a bountiful crop of new musics. The Longwalls are deep into the recording of their 5th album at Bridge Sound and Stage . This one is going to be a full-length (first since their debut ) and so far is turning out to be gloriously all over the map. Meanwhile Dan"
  },
  {
    "date": "2014-02-07",
    "title": "More kind words on KvS' Broken But Not Undone",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Review"
    ],
    "excerpt": "The fine folks at The Dadada have remarked that on Broken But Not Undone , Kurt von Stetten \" continues to pump out intriguing, though-provoking low-fi excellence. Fans of GBV take notice .\" Just another day of KvS pumping and provoking..."
  },
  {
    "date": "2014-02-03",
    "title": "Kurt von Stetten is to Boston what Robert Pollard is to Dayton",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Review"
    ],
    "excerpt": "Those aren't our words. Nope. They come from the keyboard of Visions of the Unexcused . And clearly they know what they're talking about. They go on to say that Kurt von Stetten's latest— Broken But Not Undone —manages to be \" consistently unique, challenging, and thoroughly rewarding. \" High praise"
  },
  {
    "date": "2014-01-06",
    "title": "KvS' Broken But Not Undone lands in the RSL top 50 for 2013!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Best of",
      "Broken but not undone",
      "Review"
    ],
    "excerpt": "Ryan's Smashing Life has long been one of, if not the , best music blogs in Boston. So we're pleased as punch that Kurt von Stetten's Broken But Not Undon e has made the blog's best of list for 2013! It's an impressive list; we're proud to be included. Check it out ."
  },
  {
    "date": "2013-12-12",
    "title": "Meanwhile in Canada....",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Lynden Snakes",
      "Review"
    ],
    "excerpt": "Love is growing for the Kurt von Stetten / Bonnie Trash collaboration! Their first single, Edith , was song of the day on New Lease and featured on Quick Before it Melts . Meanwhile, the fine folks at Grayowl Point wrote, \" Edith is rough, loud, and full of energy, and should be a welcome treat to a"
  },
  {
    "date": "2013-12-10",
    "title": "The Horn reviews KvS' Broken But Not Undone",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Review"
    ],
    "excerpt": "Listen to The Horn ! They know of what they speak, and what they speak is this: Broken but Not Undone (the latest from Kurt von Stetten ) is \"deceptively large scale, with soaring dream pop and loud lo fi garage rock... This is an artist worth checking out.\" We certainly agree! So check it out ."
  },
  {
    "date": "2013-12-10",
    "title": "WMBR Music Director names KvS' Broken But Not Undone as one of the best of 2013.",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Best of",
      "Broken but not undone",
      "Radio"
    ],
    "excerpt": "The very smart, talented, forward-thinking Chris from WMBR has named Kurt von Stetten's latest— Broken But Not Undone —as one of the best of 2013 . He's a Music Director, and it's MIT, so he knows what's he's talking about. Have a listen , and thank you Chris!!"
  },
  {
    "date": "2013-12-09",
    "title": "Kind words on Broken But Not Undone",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Review"
    ],
    "excerpt": "Alan cross has described \"Those That Know,\" the first track off Broken But Not Undone —the new LP by Kurt von Stetten —thusly, \"This song is erratic, insecure, passionate and sweaty all at once. Gloriously chaotic.\" Wow. We'd say that describes the whole album... it also sorta describes Kurt when he"
  },
  {
    "date": "2013-11-26",
    "title": "Collaboration time! Kurt von Stetten & Bonnie Trash release first single.",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Lynden Snakes"
    ],
    "excerpt": "Just one week after the release of his latest LP— Broken But Not Undone —our own Kurt von Stetten is back with yet another project. Yikes. The track Edith is the result of a collaboration born on Twitter (!) with Toronto/Guelph-based band Bonnie Trash . Kurt is heavily featured on this first track; "
  },
  {
    "date": "2013-11-20",
    "title": "Kurt von Stetten live on WMBR",
    "type": "live",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Live",
      "Radio"
    ],
    "excerpt": "We had quite a day yesterday! We launched this new site, release the new Kurt von Stetten album Broken But Not Undone , and capped things off with a short (but sweet) acoustic appearance on WMBR's Pipeline show . Listen to audio of the entire show here (KvS comes on about 14mins in). Big thanks to M"
  },
  {
    "date": "2013-11-19",
    "title": "Broken, But Not Undone by Kurt von Stetten on sale now! (mostly...)",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone"
    ],
    "excerpt": "Few things are harder to wrangle in the land of DIY than a firm release date for vinyl. You give ample time, even push back the release date to be safe. And then the test pressings take longer than you'd hoped and two weeks before your release date you're told it'll be another 3 weeks until you get "
  },
  {
    "date": "2013-11-19",
    "title": "Early love for KvS' Broken But Not Undone",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Review"
    ],
    "excerpt": "One sale today and the early reviews are already in! Floorshime Zipper Boots calls Broken But Not Undone an \" altogether perfect record...the singular must have of the fall. \" Meanwhile our pal Ryan's Smashing Life says Kurt is \" operating on different plane. \" High praise for Kurt von Stetten . We'"
  },
  {
    "date": "2013-11-16",
    "title": "New video from Kurt von Stetten!",
    "type": "video",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone",
      "Video"
    ],
    "excerpt": "Video for the first single— Those That Know —off the new Kurt von Stetten album Broken, But Not Undone . Dig it... then question why you ever entertained the notion of going art / music school. Dummy."
  },
  {
    "date": "2013-11-14",
    "title": "Broken, but note undone.. the new album by Kurt von Stetten out on vinyl / digital 11/19.",
    "type": "release",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Broken but not undone"
    ],
    "excerpt": "We're more than a little excited about this one. Kurt's second of the calendar year, Broken, but not undone is a return to the sort of homemade indie rock that's been lost in the din of quasi-talented folks with way too many tools at their disposal. Yeah, I said it. It's a good one, we promise. #fuc"
  },
  {
    "date": "2013-09-05",
    "title": "We play the guitar on the MTV...",
    "type": "placement",
    "categories": [
      "Kurt von Stetten",
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Cyclops",
      "TV"
    ],
    "excerpt": "Kurt von Stetten's L.A.R.P (from 2011's Cyclops ), as well as Sargasso in Space and Where Things Go to Fade by The Longwalls (from 2011's Careers in Science ) are all being featured this month on a certain MTV reality show... that will remain nameless. More info here."
  },
  {
    "date": "2013-04-15",
    "title": "The love rolls on for Kurt von Stetten's Androlafi",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Androlafi",
      "Review"
    ],
    "excerpt": "More love for Kurt von Stetten's latest, Androlafi ! The Noise calls it \" Music that shouts to be heard .\" Why thank you. And the lovely folks at Golden Mixtape say it's \" An indie delight. \" All in a day's work."
  },
  {
    "date": "2013-03-27",
    "title": "Kurt von Stetten featured in Vans BMX video!",
    "type": "video",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cyclops",
      "Vans",
      "Video"
    ],
    "excerpt": "We couldn't be more excited about Vans pairing our own Kurt von Stetten with the amazing BMX rider Dan Sandoval . The track is \"He's no Writer\" off Kurt's 2011 release, Cyclops . The rest speaks for itself."
  },
  {
    "date": "2013-03-25",
    "title": "More love for The Longwalls' Kowloon!",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "\" Masterfully blends traditional folk instruments and music with a modern style .\" More very kind words on The Longwalls ' Kowloon -- this time from the new Red Line Roots blog !"
  },
  {
    "date": "2013-03-25",
    "title": "Kurt von Stetten Androlafi UK review.",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Androlafi",
      "Review"
    ],
    "excerpt": "Love from across the pond sounds like this: \" Almost taking us back to the very birth of modern guitar music. This is the complete antithesis of so called \"manufactured pop\". Naturally it'll sell a fraction of what that will, but we'd choose this any day .\" That's The Sound of Confusion on Androlafi"
  },
  {
    "date": "2013-03-25",
    "title": "Kurt von Stetten's Anthropos Elafi video",
    "type": "video",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Androlafi",
      "Video"
    ],
    "excerpt": "Nice little write-up of Kurt von Stetten's Antrhopos Elafi video (from his latest, Androlafi ) via the fine folks at Beats Per Minute ."
  },
  {
    "date": "2013-02-20",
    "title": "The kids love Androlafi!",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Androlafi",
      "Review"
    ],
    "excerpt": "For Kurt von Stetten's new album, Androlafi , the word is in. And the word is good. Something Daily called the album, \" Terrific, all over the place, and quite unlike anything else I’ve heard so far this year .\" Visions of the Unexcused says, \" Listening to von Stetten’s music is like ingesting a dr"
  },
  {
    "date": "2013-01-31",
    "title": "Kowloon rolls on...",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Live",
      "Review"
    ],
    "excerpt": "A full-moon-sized thank you to everyone who trekked out in the cold Saturday for The Longwalls ' Kowloon release show. Epic night. Much love. We won't soon forget. Meanwhile, kind words on Kowloon continue to roll in. The Noise says the boys \" live somewhere between a more rustic Velvet Underground "
  },
  {
    "date": "2013-01-18",
    "title": "Busy times in Static Motor land!",
    "type": "news",
    "categories": [
      "Dan London",
      "Kurt von Stetten",
      "The Longwalls"
    ],
    "tags": [
      "Androlafi",
      "Kowloon",
      "Live",
      "TV"
    ],
    "excerpt": "No rest.. we've got The Longwalls CD release show for Kowloon coming up Saturday, January 26! We've also got the release of Kurt von Stetten's new one, Androlafi , coming up Tuesday, February 19th. In addition we've got some song placements coming up on MTV and Dan London is hard at work on his next"
  },
  {
    "date": "2012-12-11",
    "title": "Love of Kowloon from... Kowloon!",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "We never thought someone born in Kowloon would ever hear the new Longwalls record . Small world, and we're glad the music found him. Thanks to the Ricky from the Panic Manual for his post and recollections."
  },
  {
    "date": "2012-12-11",
    "title": "The Longwalls' Kowloon featured on Boston Emissions",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Radio"
    ],
    "excerpt": "Big thanks to Anngelle Wood and Boston Emissions for featuring The Longwalls ' Kowloon Sunday night (alongside old pals The Beatings and Black Helicopter ). Stream to the first hour , and check out the full playlist . Radio! Radio!"
  },
  {
    "date": "2012-12-11",
    "title": "More praise for The Longwalls' Kowloon.",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "\"The Longwalls have created a solid album that treats melancholy with a bit of twang, a pinch of grunge and a ton of heart.\" That's what the fine folks at mxdwn have to say about the new Longwalls record, Kowloon . It's a thoughtful write-up, which we really appreciate. Check it out ."
  },
  {
    "date": "2012-12-05",
    "title": "We love owls, and The Owl Mag loves Kowloon",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "\" The Longwalls evoke wintry discontent and hope springing eternal within the walls of their latest album, Kowloon... a lovely novella of an album. \" That's how our friends at The Owl Mag describe Kowloon , the new album by The Longwalls (on sale now). They get it. They really get it. Thanks guys!"
  },
  {
    "date": "2012-11-27",
    "title": "Twangville loves the Longwalls",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "Big thanks to Twangville for these kind words on Kowloon , the new Longwalls record out 12/4. Over at Twangville they often say the Longwalls are deserving of much wider audience. We couldn't agree more. Help the cause and tell a friend, would ya? Merci."
  },
  {
    "date": "2012-11-27",
    "title": "More love for The Longwalls' Kowloon -- on sale today!",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "\" At once unsettling, melancholic, and peaceful. Indeed, as the listener reaches the final track a feeling of tranquility has already been delivered .\" That's what Boston Music Vibe had to say about Kowloon , the new record from The Longwalls -- on sale today!!"
  },
  {
    "date": "2012-11-21",
    "title": "Glowing early words on Kowloon!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Review"
    ],
    "excerpt": "Early reviews are in, and The Longwalls ' latest effort Kowloon seems to be hitting a chord. Our Music Savage writes, \" Sonically, it is a sharp sound that sounds like a great direction for the band. \" And the fine folks over at Mojophenia write, \" The Longwalls capture the sound of a dusty repetiti"
  },
  {
    "date": "2012-11-09",
    "title": "CD release show for The Longwalls' Kowloon set: Saturday 26 January",
    "type": "release",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Kowloon",
      "Live"
    ],
    "excerpt": "It's a bit of a tradition around these parts-- CD release shows at the Lizard Lounge in Cambridge. We love that venue, we couldn't be happier The Longwalls are releasing Kowloon there Saturday 26 January , and we love that Glenn Yoder is on board with his CD release that night as well. Gonna be epic"
  },
  {
    "date": "2012-08-07",
    "title": "KvS and the Vans Downtown Showdown!",
    "type": "live",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "History",
      "Vans",
      "Video"
    ],
    "excerpt": "Wouldn't you know it.. our own Kurt von Stetten's song 50cc's (off the album History ) is featured in this here skate highlights video from the Blueprint Obstacle at the 2012 Vans Downtown Showdown. Damn. Shove it."
  },
  {
    "date": "2012-05-23",
    "title": "And the award for most dubious headline goes to....",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "interview",
      "TV"
    ],
    "excerpt": "Lexington Patch has posted a nice interview with Kurt von Stetten regarding his recent song features on MTV's 16 & Pregnant. The title? \" Lexington Native Featured on MTV's '16 and Pregnant .\" Wow. But seriously, it's a nice interview, check it out. And thanks to Lexington Patch! (And here's the MTV"
  },
  {
    "date": "2012-05-22",
    "title": "Kurt von Stetten on Pandora!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cyclops",
      "History",
      "Pandora",
      "Radio"
    ],
    "excerpt": "Pandora listeners— Kurt von Stetten's album Cyclops is now up on Pandora (along with 2009's History ). Easier said then done. Check it out, Kurt makes great radio."
  },
  {
    "date": "2012-05-09",
    "title": "Kurt von Stetten is... 16 & Pregnant?!?",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Pyramid",
      "TV"
    ],
    "excerpt": "That's right folks. Our own Kurt von Stetten was featured on last night's episode of MTV's 16 & Pregnant . We told him to use protection. Ha! I funny! What we mean to say is Kurt's song Pangaea —off his 2010 album Pyramid —was featured on last night's episode \"Hope\" ( watch it here ). Crazy huh? And"
  },
  {
    "date": "2012-04-11",
    "title": "More love for the Cyclops!",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cyclops",
      "Review"
    ],
    "excerpt": "Somehow we missed these: Boston's own The Noise recently ran a glowing review of Kurt von Stetten's Cyclops calling it an \" aural feast not to be overlooked .\" Damn. And the Elusive Little Comments blog can't wait to hear more. Neither can we. Thankfully a new album is already in the works. That's h"
  },
  {
    "date": "2012-04-10",
    "title": "More praise for Dan London's Happy to See Me!",
    "type": "press",
    "categories": [
      "Dan London"
    ],
    "tags": [
      "Happy to See Me",
      "Review"
    ],
    "excerpt": "\" Sun soaked guitar spiel with Alt-Pop immediacy. File under Ray Davies or Tom Petty. \" That's what Mojophenia has to say about Dan London's Happy to See Me . And our friends over at Americana Roots were kind enough to include two tracks on their Americana Rock Mix #132. Good stuff all around."
  },
  {
    "date": "2012-03-01",
    "title": "Happy to See Me reviews!",
    "type": "press",
    "categories": [
      "Dan London"
    ],
    "tags": [
      "Happy to See Me",
      "Review"
    ],
    "excerpt": "A couple nice reviews are in for Dan London's solo debut Happy to See Me . Both involve food— one explicitly , the other (in Dutch!) likely the result of a rather hilarious translation . Oh, and pick up the CD here or name your price for a digital download over at Bandcamp . Enjoy!"
  },
  {
    "date": "2012-01-22",
    "title": "Hot best of '11 action—Longwalls style!",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Best of",
      "Careers in Science",
      "Review"
    ],
    "excerpt": "The Longwalls ' Careers in Science album has also landed on a few of best of 2011 lists by the fine folks at The Noise , Twangville , and Beat the Indie Drum ! Thanks to all! Was a good year in SMR land. On to the next."
  },
  {
    "date": "2012-01-20",
    "title": "Video: Code of Fisherman by Kurt von Stetten",
    "type": "video",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cyclops",
      "Video"
    ],
    "excerpt": "In case you missed it, Kurt von Stetten produced a video for the track Code of Fisherman off his new album Cyclops . Kurt hand painted all the elements before scanning them into his Commadore 64 to get his animation on. Check it!"
  },
  {
    "date": "2012-01-20",
    "title": "Best of 2011 for KvS' Cyclops *and* Pyramid!",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Best of",
      "Cyclops",
      "Pyramid",
      "Review"
    ],
    "excerpt": "Kurt von Stetten's Cyclops has made into a couple of stellar \"best of\" lists for 2011. Ryan's Smashing Life included both Cyclops and Pyramid on his list and called Kurt a \"gifted creator\" and a \"prolific genius\" and Music Savage says \"The album deepens with each listen, and I’ve very much enjoyed h"
  },
  {
    "date": "2011-12-13",
    "title": "Kurt von Stetten's Cyclops is killing it!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Cyclops",
      "Review"
    ],
    "excerpt": "Early reviews are in from Dysonsound , Music Savage , The Owl Mag , Earmilk , and Migrate Music . It's official, Kurt von Stetten's new album Cyclops is KILLING IT. More soon, when we catch our breath. Phew."
  },
  {
    "date": "2011-11-03",
    "title": "Gatsby Lives.. Live!",
    "type": "live",
    "categories": [
      "Gatsby"
    ],
    "tags": [
      "Live",
      "Live On-Air '01-05"
    ],
    "excerpt": "In honor of the 10-year anniversary of Gatsby's first ever show—November 1, 2001—we've put together a collection of live material culled from radio and TV performances between 2001 and 2005. It's truly a blast! We've also launched a Gatsby page over on Bandcamp where you can download both the new li"
  },
  {
    "date": "2011-08-30",
    "title": "Careers in Science: \"Rural America meets the urban streets\"",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Review"
    ],
    "excerpt": "The fine folks over at Culture Bomb have some very nice things to say about The Longwalls' Careers in Science Album! Lines like \"clash-like rhythms mixed with an Elvis Costello, jangling guitar\" make us positively giddy. And we like gumbo. And, we like that we left them wanting more..."
  },
  {
    "date": "2011-08-23",
    "title": "Careers in Science hangin' around!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Radio"
    ],
    "excerpt": "The Longwalls' album \" Careers in Science \" is hanging around the Noise local radio chart. The album has been on the charts since April is hanging in there at #15 for August. Big thanks to all the local DJs!"
  },
  {
    "date": "2011-07-18",
    "title": "BTID hearts (x4!) Careers in Science",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Review"
    ],
    "excerpt": "Matt at Beat The Indie Drum has called The Longwalls' Careers in Science a \"start-to-finish power-pop gem.\" He's really smart, so you should listen to what he has to say! Thanks Matt!"
  },
  {
    "date": "2011-07-01",
    "title": "Brandon talks Pandora at Music Think Tank",
    "type": "news",
    "categories": [
      "Uncategorized"
    ],
    "tags": [
      "Pandora"
    ],
    "excerpt": "Static Motor operator Brandon has written a post talking about his experiences as a DIY label working with Pandora. It's an interesting tale; Music Think Tank even ran it on their front page. It's generated a bunch of interesting comments, check it out! And should you hunger for more, Brandon writes"
  },
  {
    "date": "2011-05-04",
    "title": "Ingenious, infectious, and practically anthemic!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Review"
    ],
    "excerpt": "Wow! Some very kind words from The Noise on The Longwalls new album Careers in Science . (Although, we think the CriticTron 3000 needs an upgrade...). Check it out! (scroll..)"
  },
  {
    "date": "2011-04-29",
    "title": "Two months in the Top 10!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Radio"
    ],
    "excerpt": "Whoa! Two months in the top 10 of the Noise Local Radio Chart for The Longwalls ' Careers in Science ! Big thanks (again) to all the local DJs for spinning the new record!!"
  },
  {
    "date": "2011-04-21",
    "title": "#7 with a bullett!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Radio"
    ],
    "excerpt": "#7 with a bullet!! The Longwalls' new album Careers in Science has made the top 10 of The Noise local radio chart for the month of April! Huge thanks to our friends at WMBR , WMFO , WFNX , WZLX and all the local DJs for lending your support. You're the best!"
  },
  {
    "date": "2011-04-12",
    "title": "Thank you!!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Live"
    ],
    "excerpt": "A HUGE thank you is in order for everyone who came out to The Longwalls' Careers in Science CD release show at Precinct on Friday night. We had a blast, thank you so much! And thanks to Glenn Yoder and Found Audio for coming along for the ride! Good times, more on the way soon..."
  },
  {
    "date": "2011-03-07",
    "title": "Kurt von Stetten: radio star!!",
    "type": "radio",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Radio"
    ],
    "excerpt": "Our own Kurt von Stetten is doing quite well on local radio! In January he cracked the top 10 at WMBR , and recently he's found his way into the top 10 of The Noise montly radio chart for March! Good on ya, Kurt!!"
  },
  {
    "date": "2011-03-07",
    "title": "New video for The Longwalls' \"Ghosts\"!",
    "type": "video",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Dark Academy",
      "Ghosts",
      "Video"
    ],
    "excerpt": "The Longwalls have just released a haunting, stop-motion video for the song Ghosts off 2010's Dark Academy EP. Check it out ! The video was produced by our good friend Ryan Murphy , be sure to let him know what you think!! Enjoy!"
  },
  {
    "date": "2011-03-04",
    "title": "As we suspected—people are loving \"Careers in Science\"!!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science",
      "Review"
    ],
    "excerpt": "\" The pure sound of these songs provide such visceral pleasure .\" Some very kind words indeed on The Longwalls' Careers in Science from the Boston Globe ! Meanwhile, Oh So Fresh! Music thinks the album is a bit like \" modern Springsteen, but with an indie touch .\" We'll take it!!"
  },
  {
    "date": "2011-02-22",
    "title": "Blogging about Careers in Science",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science"
    ],
    "excerpt": "Curious about The Longwalls' upcoming Careers in Science album?!? Head on over to Alan's blog where he's talking about the thinking behind each song, posting early demos, live recordings, and a few of the final cuts. Some good readin' we reckon.."
  },
  {
    "date": "2011-02-22",
    "title": "Careers in Science / Longwalls update",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Careers in Science"
    ],
    "excerpt": "Hey ya'll! A few things to check out: (1) Brandon's colleague Alex talks about Careers in Science album art design over on the Sametz blog ! (2) Ride the Tempo gave the album a nice 'lil mention . (3) Our pal Dysonsound included us on a guest mix tape for TSURURADIO's Nudiezine ! All good stuff as w"
  },
  {
    "date": "2011-01-15",
    "title": "Kurt von Stetten's New Year's resolutions!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [],
    "excerpt": "Our own Kurt von Stetten, along with a number of local rock luminaries, offer their New Year’s resolutions to the Boston Globe . Kurt takes a haiku approach.. naturally..."
  },
  {
    "date": "2010-12-17",
    "title": "Boston Globe—DIY pop powerhouse Kurt von Stetten is on a roll!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "interview"
    ],
    "excerpt": "Our pal Jonathan Perry of the Boston Globe has written a really nice story on Kurt von Stetten and Static Motor. We're beside ourselves with pride. Check it out ! And tell a friend!!"
  },
  {
    "date": "2010-12-16",
    "title": "Even more love for Kurt von Stetten's Pyramid",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Pyramid",
      "Review"
    ],
    "excerpt": "Our pal Kyle over at Music Savage calls Kurt von Stetten's Pyramid \"a fantastic example of an amazing, talented guy who seems to have no limits to what he can do\". Kyle is a whole lot smarter than us, so it must be true. (Thanks Kyle!)"
  },
  {
    "date": "2010-12-15",
    "title": "The Kids Love Kurt von Stetten's Pyramid!!!",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Pyramid",
      "Review"
    ],
    "excerpt": "People are discovering what we've known all along—our own Kurt von Stetten has made a hella great new album. Check out what these fine folks have to say about Pyramid : RidetheTempo | Oh So Fresh! | Perfect Porridge ."
  },
  {
    "date": "2010-12-10",
    "title": "WMBR spins Aioki!",
    "type": "radio",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Pyramid",
      "Radio"
    ],
    "excerpt": "Our pals from WMBR's Pipeline kicked off last night's show with Aioki off Kurt Von Stetten's new album, Pyramid . Radio gold kids, radio gold. Stream the whole show here ."
  },
  {
    "date": "2010-11-19",
    "title": "The reviews are in for \"Pyramid\"!!",
    "type": "press",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Pyramid",
      "Review"
    ],
    "excerpt": "The reviews are in for Pyramid ! Well, the first one anyway. Our pal over at Dysonsound has given Pyramid one hell of a nice writeup. He knows way more about music than we do, so we'll all take him at his word, ok?!?"
  },
  {
    "date": "2010-07-23",
    "title": "The Longwalls live on WMFO",
    "type": "live",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live",
      "Radio"
    ],
    "excerpt": "The Longwalls played live On The Town with Mikey Dee at WMFO back in May. The set includes tracks from Field Guide , the new Dark Academy EP, as well as a few new songs set for release on a new EP early next year. Check out parts of the set for free on SoundCloud ."
  },
  {
    "date": "2010-07-04",
    "title": "The Longwalls Throwback Summer Weekend",
    "type": "news",
    "categories": [
      "Gatsby",
      "The Longwalls"
    ],
    "tags": [
      "Live"
    ],
    "excerpt": "Join The Longwalls Friday, July 30 at Tommy Doyle's in Hyannis and Saturday, July 31 at the Lizard Lounge in Cambridge for our Throwback Summer Weekend. Unfortunately our main man Kurt von Stetten is on holiday that week, but we're excited to announce that our old pal and Gatsby mate Scott Robinson "
  },
  {
    "date": "2010-05-07",
    "title": "Have you checked out Kurt Von Stetten's blog?",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [],
    "excerpt": "If not, you should. Kurt is busy blogging new songs in preparation for new full-length release!! Lots of manic, new, home-brewed, fuzz-rock is on the way. Check it out."
  },
  {
    "date": "2010-05-07",
    "title": "A big thank you!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live"
    ],
    "excerpt": "A big thanks is in order for all who came out to The Longwalls' Dark Academy release show at the Lizard Lounge on May 1. It was great night and we're so happy we were able to share it with so many friends--old and new. You guys are the best. On to the next!"
  },
  {
    "date": "2010-04-30",
    "title": "The Noise loves \"Dark Academy\"!",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Dark Academy",
      "Review"
    ],
    "excerpt": "Boston's own The Noise can't recommend The Longwalls more highly, and says Dark Academy has \"all the earmarks of future classic and gets better with every listen.\" Gee, that's really nice of them. Read it all here (scroll down a bit)."
  },
  {
    "date": "2010-04-14",
    "title": "Dark Academy looming...",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Dark Academy"
    ],
    "excerpt": "The Longwalls ' new EP Dark Academy is in hand and will be available soon here at Static Motor as well as CD Baby, iTunes, and many other fine retail outlets. We also have a release show set for Saturday, May 1 at the Lizard Lounge in Cambridge with the great Cassavettes. More soon so stay tuned, a'"
  },
  {
    "date": "2010-04-14",
    "title": "The Longwalls Band in Boston",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Live"
    ],
    "excerpt": "An exceptionally badass live performance by The Longwalls is up now at Band in Boston . Go check it out. Now! GO!!!"
  },
  {
    "date": "2010-04-07",
    "title": "Kind words on Dark Academy",
    "type": "press",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Dark Academy",
      "Review"
    ],
    "excerpt": "Wow, some *very* kind words on The Longwalls ' Dark Academy EP on the Slowcoustic blog . Check it out!"
  },
  {
    "date": "2010-04-02",
    "title": "Get some indie cred in your twang collection!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Dark Academy",
      "Review"
    ],
    "excerpt": "The fine folks at Twangville have posted a nice review of The Longwalls Dark Academy EP. They think we do a little Jayhawks and mix in a little Shins. But I swear, there ain't no wah-wah anywhere. Haven't used a Wah peddle since 'ought one or so. Anyway, read it here . And if you want to buy it, whi"
  },
  {
    "date": "2009-09-21",
    "title": "The Longwalls' Zombies! kicks off PopMatters Mixtape",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "Nom Nom Nom....PopMatters Mixtape #4 is all about zombies, so who better to kick if off than your Longwalls?!?! It's a great mix, and they even embedded our video. Check it out!!"
  },
  {
    "date": "2009-09-06",
    "title": "Zombies! Premiere!",
    "type": "video",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "The Longwalls ' Zombies! video premiere with the Plymouth Rock Studios gang is set for Friday, October 30! Details so far: Renting a theatre, showing a bunch of zombie shorts, then the video launch, then chats with video Director & Producer, then Zombieland feature film (!). Plus \"new toy\" donations"
  },
  {
    "date": "2009-09-06",
    "title": "More Zombies! bloggage",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "Another article on The Longwalls' Zombies! video shoot, and what a fully-functioning Plymouth Rock Studios could mean to their community."
  },
  {
    "date": "2009-09-06",
    "title": "Even more Zombies! bloggage",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "A nice blog post on The Longwalls' weekend video shoot for Zombies down at Plymouth Rock Studios here . Thanks!"
  },
  {
    "date": "2009-09-06",
    "title": "All Zombies all the time!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "A great recap of the The Longwalls Zombies! video shoot from Director Louie Jannetty on his blog ."
  },
  {
    "date": "2009-09-06",
    "title": "Field Guide almost sold out!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist"
    ],
    "excerpt": "The Longwalls' debut— Field Guide for the Zombie Survivalist — is just about sold out. There's 4 copies (I think!) available on CD Baby , that's about it. If you want the CD, get it now as we probably won't print another batch any time soon."
  },
  {
    "date": "2009-09-05",
    "title": "Classic Kurt!",
    "type": "news",
    "categories": [
      "Kurt von Stetten"
    ],
    "tags": [
      "Into the Safety of the Alley",
      "Tree"
    ],
    "excerpt": "Kurt von Stetten's Tree and Into the Safety of the Alley available now for free download!"
  },
  {
    "date": "2009-09-04",
    "title": "Zombie shoot, great success!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "Thank you thank you thank you to everyone who took part in the The Longwalls' Zombies! shoot this weekend down at Plymouth Rock Studios. The crew (Louie Jannetty Director,Josh Bethoney Producer, and Sean English, Dir. of Photography) were brilliant and amazing (and patient) and all the extras who wo"
  },
  {
    "date": "2009-09-04",
    "title": "Zombies on the blog",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "A nice blog post on The Longwalls' weekend video shoot for Zombies down at Plymouth Rock Studios here . Thanks guys!"
  },
  {
    "date": "2009-09-01",
    "title": "Zombies are coming!",
    "type": "news",
    "categories": [
      "The Longwalls"
    ],
    "tags": [
      "Field Guide for the Zombie Survivalist",
      "Video",
      "Zombies"
    ],
    "excerpt": "The Longwalls video shoot for Zombies starts next Friday night! We'll be shooting Friday night, all day Saturday, and Sunday morning. Gonna be a long weekend but we're pretty excited about it. In preperation for the video, we've just souped up the Zombie track with some new guitar work and some Hamm"
  }
]